[
    {
        "Name": "Hooded Seal",
        "Genus": "Cystophora",
        "Diet": "Omnivore that eats marine fish, shrimp and other crustaceans, octopus and squid",
        "Behavior": "They can be characterized as solitary.",
        "Features": "The male’s inflatable “hood” and red nose balloon.",
        "Fun_Fact": "Hooded seal pups are called bluebacks because the color of the fur on their back is blue-gray. This pretty color made people want to make fur coats out of them and made them a target for hunters.",
        "Text": "“The seal with the inflatable red nose.” A casual look at a male hooded seal reveals a typical large true seal . This means he has a blubbery, cylindrical body, no ear flaps, small flippers, and a tail that makes him an excellent swimmer but clumsy on the ice floes where he usually lives. But then, if the hooded seal is about to go for a dive or wants to impress a rival or a female, the skin on top of his head can balloon to the size of two footballs. Not only this, but he can shut off one of his nostrils and fill the other with so much air that another balloon, this one bright red, pops out of his nose. Both the balloon on the head and the one that comes out of the animal’s nose can produce sounds that warn rivals and would-be predators and attract females. Here are some facts about this unusual pinniped: This species’ scientific name is Cystophora cristata. Cystophora is Greek for “bladder-bearer,” and describes the bladder-like structure found on the male hooded seal’s head. Cristata is Latin for “crested.” There are only one species of hooded seals, though biologists separate them into two populations. There’s the population in the northeast Atlantic and a population in the northwest Atlantic. The hooded seal is a large seal with silver-gray fur with black spots. They have black faces and small limbs. Though their limbs are small, these seals are expert swimmers and divers. Males are a little longer than females but weigh much more. They can weigh 661 pounds on average to a female’s 353 pounds, and of course, they can inflate their nasal passages. Hooded seals also differ from other seals in the adaptations nature made to their teeth. Unlike other seals, they have two incisors in their upper jaw and one incisor in their lower jaw. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The male hooded seal’s “hood” and red nose have long been objects of fascination for biologists. They are the result of a cavity or bladder in the seal’s nose that can stretch. When it’s not inflated, the bladder hangs down over the seal’s mouth. When he inflates it, it makes his head look almost twice as big as it is, which intimidates opponents and is supposed to impress females. When the hood is partially inflated, the seal also blows up the stretchy septum in their left nasal cavity till it resembles a red balloon. When the seal shakes these balloons, they can make whooshing and pinging noises that are audible over land and in the water. Hooded seals are largely solitary until the breeding season, which is unusual. They don’t establish social hierarchies or fight over territories, though male seals will compete for an area around a female. Even after they give birth, hooded seal cows and their pups don’t stay together long. Seals mostly eat during the fall and winter and stop eating during the spring and summer when they breed and shed their old fur. This means that the mother doesn’t eat while they’re nursing their pups even as the pups gain 15 pounds every day on their very fatty milk until they’re weaned. She loses 15 to 22 pounds every day in the meantime. After the spring breeding season, the seals enter the water again to find food, then haul out in the summer to molt. Hooded seals spend most of their time swimming and diving in the cold waters of the North Atlantic Ocean and the Arctic Ocean. They haul out on ice floes or on land that is covered with ice and are careful to migrate to areas where ice floes are plentiful. The seal’s diet is mainly crustaceans and fish . They are partial to the capelin, which is a type of smelt found in cold northern waters. This small fish gives the seal the fat it stores in its blubber and utilizes when it doesn’t eat. Other foods are squid and octopus , cod , redfish, herring , and halibut. Humans have been the main predators of hooded seals. The animals have been hunted since at least the 18th century and were harvested so indiscriminately that it was difficult for their populations to recover. They were first killed for oil and to make leather out of their hides. Then, even baby seals were killed for their beautiful fur, and their mothers were often killed as they tried to protect them. Some people are subsistence hunters of hooded seals, but the seal has been so depleted by commercial hunting that even subsistence hunting is problematic. Seals are also found stranded on beaches and get entangled in nets meant for other marine animals. Less rapacious predators of the animal are killer whales , sharks , including the Greenland shark , and polar bears . Seals, which don’t move well out of the water, are especially vulnerable when they are breeding or molting on pack ice. Smaller predators include heartworms, which infest the animal’s heart and lung arteries and can shorten its life. These animals that are held in captivity also die from tuberculosis and infection. Hooded seals are eaten by killer whales, sharks, and polar bears. The hooded seal eats fish, marine mollusks, and marine crustaceans. Though the physical adaptations of the adults allow them to dive deeply to find this food, newly weaned pups have to catch their prey close to the shore. The breeding season for the hooded seal is in spring. Since she nurses her pup for such a short time, a hooded seal cow attracts the attention of males shortly after she gives birth. The males inflate and sound their balloons both to impress her and to threaten each other. Sometimes they will simply shove each other off the pack ice. The bull and cow mate in the water, then he’ll go off and find another cow. In the meantime, the first cow is pregnant for about eight months. The mother is fiercely protective of the baby for as long as it’s nursing. The hooded seal population is believed to be 650,000 animals according to the MarineBio Conservation Society . Still, the animal is listed as vulnerable . The northwest Atlantic population is either stable or increasing, but the northeast Atlantic population is still in decline. Though the hooded seal is still hunted in areas, it is protected by the Marine Mammal Protection Act of 1972 and is subject to a strict quota. No more than 10,000 hooded seals can be caught in any given year around the world.",
        "score": 0.75881857
    },
    {
        "Name": "Chameleon",
        "Genus": "Chamaeleonidae",
        "Diet": "Omnivore that enjoys insects and especially likes snails, leaves",
        "Text": "The chameleon, scientific name Chamaeleonidae, is a species of lizard known for their ability to change colors and degrees of brightness. There are over 160 species of chameleon spread across Madagascar, Spain, Africa, Asia, and Portugal. They have large eyes and curled tails, and some species can change the color of their skin to blend in with their surroundings as a defense mechanism from predators. These lizards can change their skin to pink, blue, red, orange, green, black, brown, light blue, yellow, and turquoise. The scientific name for a chameleon is Chamaeleo, which is derived from the Greek word “chamai” meaning on the ground and “leōn” meaning lion. This genus of lizards contains over 160 species that are native to Africa, Madagascar, Southern Europe, and Asia. They are known for their ability to change colors with their environment, allowing them to blend in perfectly with trees or rocks. Furthermore, they can also move each eye independently of one another to have a larger field of vision. A chameleon is an incredible animal with a unique ability to change its colors and blend into its environment. They come in many shapes, sizes, and colors depending on the species. Generally speaking, most chameleons have flattened bodies and long tails with five digits on each foot that are adapted for gripping branches or other surfaces. Their eyes can move independently of one another which helps them scan their surroundings more efficiently. Chameleons also possess a protruding tongue which they use to capture prey such as insects or small lizards. On average, they range in size from 2 inches up to 24 inches in length! Depending on the species, they usually feature bright hues of green and yellow with various patterns of spots throughout their body making them quite eye-catching reptiles! See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Chameleons are animals that are found throughout the jungle and desert alike, in Africa, Asia, and parts of Southern Europe , and chameleons have also been introduced to parts of North America. Most of these lizards live in trees or in bushes. Only a few species of chameleon live on the ground under piles of leaves. There are many animals that eat these lizards. In fact, the smaller a chameleon is, the more likely it is to be eaten by a larger animal. Some of the predators include snakes, birds, and sometimes monkeys . Though they can blend in with their environment, they are near the bottom of the food chain. This means there are many animals above them on the food chain that can eat them. A chameleon’s ability to change color to match its environment is its way of protecting itself when a predator is nearby. If this lizard is on a branch, its skin can turn a color that is very close to the color of the branch. Many predators may pass by without ever seeing the chameleon sitting quietly on the tree branch. The chameleon is a very unique species of lizard, known for its ability to change color in order to adapt to their environment. It has been around for millions of years and is believed to have descended from the iguanid family. Chameleons are found throughout Africa, Madagascar, parts of southern Europe and Asia, as well as some islands in the Indian Ocean. The evolution of the chameleon has also enabled it to develop several interesting characteristics that make it uniquely suited to its habitat. They have specialized eyes with 360-degree vision which allows them to see predators from any direction, long tongues so they can catch prey quickly, prehensile tails which help them climb trees more easily, and claws that enable them to grip branches firmly. Additionally, their skin pigmentation allows them to blend into their surroundings almost instantly when threatened by a predator or other animals. Overall, the incredible evolutionary process behind the chameleon’s remarkable adaptation capabilities is truly amazing! Chameleons are known for their ability to change color, but they also possess many other interesting behaviors. Chameleons are known to be solitary creatures, spending most of their time alone or in pairs. They can often be seen basking in the sun on branches or leaves, and when disturbed they will normally take cover among the foliage. Their long tongues help them catch prey such as insects and small reptiles; they have excellent vision which helps them spot potential food sources from a distance. When threatened by predators, chameleons may puff themselves up to appear larger than normal and give off a hissing sound as a warning sign. In addition to this defensive behavior, some species of chameleon may even fight each other using their tails! Chameleons are animals that communicate with one another by using their body language. For instance, a chameleon trying to protect its territory from an intruder is likely to turn sideways. This makes the lizard look bigger and more threatening. A chameleon that feels threatened may open its mouth to try to scare another one away. Most species of these lizards lay eggs, while a few have live babies. The female digs a hole in the ground and lays her eggs inside it to keep them warm. Usually, they lay around 20 eggs, but it can be more or fewer depending on the species. It can take four months to a year for the eggs to hatch. Jackson’s chameleon is one example of a species that have live babies. This lizard can have from 8 to 30 live babies after being pregnant for about six months. Chameleons, like most other reptiles, reproduce sexually. During courtship and mating rituals, male chameleons will display their bright colors to attract mates. Male chameleons also use head bobbing as a way of flirting and competing with rivals for the attention of females. If a male is successful in both displaying his colors and winning the battle using body language instead of physical contact, he may be chosen by the female for mating purposes. The gestation period for chameleon eggs ranges anywhere from one month to several months depending on species and environmental factors such as temperature or humidity levels. After hatching from eggs laid in nests underground or in trees or bushes, baby chameleons are born without parental care; they must fend for themselves after birth. The lifespan of a chameleon depends on its species but generally ranges from five to fifteen years when kept in captivity with optimal conditions such as proper diet and environment being met regularly. Wild-living chameleons tend to have shorter lifespans due to a lack of food sources, predators, disease exposure, etc., which can drastically reduce their life expectancy if not addressed properly. Chameleons eat a diet that’s mostly focused on insects . While chameleons are omnivores that will feed on vegetation such as dandelions and other vegetation, most of their prey is insects such as grasshoppers, crickets, and dragonflies. For a full list of chameleon diets, give our ‘ What Do Chameleons Eat? 16 Foods in their Diet ‘ page a read! Chameleons are fascinating creatures that come in a variety of shapes and sizes. Unfortunately, their numbers have been steadily declining due to a number of factors, including habitat destruction and hunting for the pet trade. As a result, several species of chameleon have been listed as endangered or critically endangered on the IUCN Red List. For example, Parson’s Chameleon is classified as Endangered due to its restricted range and continued decline in population size from ongoing habitat loss, poaching for pets, and over-collection by scientists. Another species at risk is the Panther Chameleon which has seen significant declines in Madagascar due to deforestation activities such as burning woodlands for agriculture. Conservation efforts must focus on protecting suitable habitats so these amazing animals can continue to thrive around the world.",
        "score": 0.7389118
    },
    {
        "Name": "European Polecat",
        "Genus": "Mustela",
        "Diet": "Carnivore that eats rodents, rabbits, lizards",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Mask-like face markings",
        "Fun_Fact": "Its fur changes color in the winter!",
        "Text": "“The European polecat can interbreed with ferrets.” The European polecat is a small, slender mammal that is related to weasels , ferrets , and minks . Despite its diminutive size, it is a swift, fierce predator. The European polecat is native to Europe , North Africa , and parts of Asia . Once considered vermin and hunted to near extinction, the European polecat now enjoys a healthy population in most of its former range. The European polecat’s scientific name is Mustela putorius . The name polecat comes from the French term “poule chat,” which means “chicken cat.” The term refers to the fact that polecats would sometimes raid chicken coops for eggs and chicks. The polecat has a slender body, short legs, and a wide head. Small ears, a round nose, and bright eyes give this little guy an adorable look, but don’t be fooled. The polecat is a fierce fighter who will defend itself aggressively. The polecat has thick, glossy fur. Its colors are mostly deep brown to black with red patches and a yellow underbelly. It usually has a white patch around its nose and a raccoon-like mask around its eyes. One chief way to make the identification of a polecat is the way its fur changes. In summer, the fur gets lighter and thinner. In winter, the polecat’s coat gets thicker and shades to a silvery gray color. Compared to other members of the mustelid family, the polecat has exceptionally large, sharp teeth. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The European polecat is a solitary, nocturnal hunter. Some female polecats and young polecats may look for food in the daytime, but adults and males prefer to hunt at night. The polecat sets up a range of territory that it uses as a hunting ground. The size of this personal habitat can range from a small plot of land to a large spread that includes several dens. Some polecats use the abandoned dens of foxes and badgers instead of building their own. Despite this, the polecat is not strongly territorial. A polecat will often share its territory with other polecats, and it usually doesn’t mark its habitat with scent. A polecat is a quiet animal with few vocalizations. It may growl or squeak when frightened. The European polecat prefers to live near water sources. It can often be found near marshes, riverbanks, dunes, and coastal cliffs. Being close to water increases its food supply. Polecats are adaptable animals that can be found in wetlands , grasslands , agricultural land, prairies, and forests. European polecats use hedgerows for shelter and navigation. They also prefer to use existing nests rather than build their own. The polecat is a carnivore that eats voles , mice , and other rodents . It also eats lizards , frogs , and birds . If it can’t find its preferred prey, a polecat may supplement its diet with fruit and insects . A polecat’s diet can vary greatly. It changes according to what is available and the time of year. Scientists have seen European polecats eating the following: Despite its small size, the polecat can defend itself from larger predators. It uses its anal glands to produce a strong, unpleasant smell that wards off many predators. Large carnivores usually leave polecats alone for that reason. Most polecats are killed by cars. Other threats are habitat loss, especially hedge removal when forests are cleared. Polecats are sometimes trapped accidentally or poisoned by preying on rodents who have eaten poisons. The polecat’s breeding season is in winter. Polecats are polygamous, and both males and females reproduce with several mates. They reach sexual maturity when they’re a year old. There is no courtship or mating ritual. A male grabs a female by the neck and copulates with her. Male polecats are known as hobs, and females are known as jills. A pregnant female incubates the babies for 42 days and then gives birth to a litter of three to seven kits. The mothers feed and care for the kits until they are about 3 months old. Mother polecats are extremely protective of their young and will defend them aggressively against intruders. European polecats have a lifespan of six to 14 years in the wild. Their lifespan in captivity may be longer. Because of its extensive range of distribution, exact population numbers are unknown, but conservationists are concerned that the polecat’s population is decreasing. The European polecat is listed as “least concern” by the International Union for the Conservation of Nature (IUCN) . It enjoys protected status in the United Kingdom . In the past century, polecats were considered vermin and were routinely killed by gamekeepers and farmers. That led to the near extinction of this species. Today, polecats have recovered their population numbers. Many people now appreciate their help in controlling rat populations. In the United Kingdom, they are protected under the Wildlife and Countryside Act and are a priority species under the U.K. Biodiversity Framework. The European polecat was once hunted as vermin. Today, farmers and gamekeepers appreciate the polecat’s help in controlling rodent populations. This masked bandit has recovered from the brink of extinction and now has a stable population.",
        "score": 0.73784924
    },
    {
        "Name": "Fallow Deer",
        "Genus": "Dama",
        "Diet": "Herbivore that enjoys vegetation",
        "Behavior": "They usually live in herds and can be characterized as solitary.",
        "Features": "An adult deer with a common coat hangs on to the white spots it had as a fawn.",
        "Fun_Fact": "The fallow deer has more variation in its coat colors than most other deer.",
        "Text": "A person who first sees the most common type of fallow deer may wonder why it never got rid of the white spots other deer have when they’re fawns then lose as they grow up. But a spotted, light brown coat with a black stripe that runs down the back to the tail is just one of the many types of colors the pelage of this wide-ranging deer can sport. Some fallow deer are white, some are black, and many have what is called menil coloration. This means that the spots stand out more, and there is no black on the tail or the rump. The spots persist throughout the winter, while with the common coloration the coat turns gray and the spots fade. The deer’s hind legs are also longer than the front legs, and the male has a distinct Adam’s apple that bobs up and down when it calls. The fallow deer is native to Europe and Asia Minor and probably north Africa , and it’s been introduced in countries around the world as a game animal. It’s also raised for its meat and for the valve male’s antlers, which is supposed to have health-giving properties. Many zoos have a small herd of fallow deer. The deer’s scientific name is Dama dama. Dama is simply the Latin word for deer and related species such as antelope . Fallow refers to the light brown color of the deer’s pelt. There are two subspecies of the fallow deer. They are: Some scientists believe at the Persian fallow deer, which is rare, is a separate species. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Fallow deer also differ from other deer in that males are much larger than females. Males can weigh twice as much as females, and the largest buck weighed as much as 330 pounds. Besides hunting and use as livestock, fallow deer are valued because of their beauty and grace. The texture of the deer’s coat differs with the season. During the warm season, the colors of the coat are paler, and the hair is shorter and smoother. The winter coat is shaggy, darker, and has an undercoat. If the deer has white spots, they are abundant on the back and sides of the animal, absent on the legs and the head, and sparse on the neck. Only the male fallow deer has antlers, and his antlers are large, shaped like shovels, and have many points. Indeed, they resemble the antlers of the bull moose, and they’re usually between 1.6 and 2.29 feet long. The buck starts growing palmate antlers when he’s about three years old. Before that, his antlers are simply spikes. The buck loses his antlers in April and grows another pair that are fully grown by August. Fallow deer are nocturnal and are most active between just after sunset and sunrise. During those hours they feed, look for food, or rest. Bucks usually keep to themselves, but at the end of summer, they start to gather into herds that are made up of no more than six individuals. By the fall, which is their breeding season or rut, these bachelor herds drift towards herds made up of females and juveniles. The senses of the fallow deer are quite acute, and their vision is especially sharp. They communicate with each other through posturing, vocalization, and smells. They have an impressive array of vocalizations, including: The deer also uses its body to communicate. An alert stance is a raised head and rigidly held body. They also trot, gallop and pronk, which is when the animal leaps high in the air on all four stiffly held legs. Like white-tailed deer, the fallow deer raises its tail when it runs. Because fallow deer are the prey of so many carnivores, including humans, they are vigilant. This is especially true of females with fawns. The fallow deer can thrive in a variety of habitats, as long as it can support the vegetation that they eat. They do best in old-growth forests dominated by broad-leafed, deciduous trees such as oaks, especially if these forests contain glades. Fallow deer can also be found in forests of deciduous trees and conifers, in grasslands, savannas, and scrublands. Like many types of deer, fallow deer are herbivores, but they are not particular when it comes to their diet. They eat grasses, acorns, and other fruit produced by trees, leaves, twigs, and shrubbery. They’ll also take herbs, shoots, and buds and will even eat bark. Their preferences depend on what is available. Fallow deer are hunted by humans and other predators that are big or clever enough to bring them down. The mammal’s overall alertness to its surroundings and its propensity to gather in herds saves it from those predators who are not hunting with firearms. Fallow deer have a somewhat complex reproductive strategy. When they enter the rut, bucks stop eating. Since the rut can last for 135 days, a buck can lose as much as 17 percent of his body weight and develop a fatty liver. If the deer lives in the northern hemisphere, the rut occurs in October. If they live in the southern hemisphere, it happens in April. During the breeding season, the buck establishes a rutting stand or a territory. He does this by attacking low-hanging branches and leaves with their antlers, groaning and grunting and scraping the ground, and urinating in the area. Each buck has its own distinctive vocalization that both warns other bucks away and entices females. If a buck enters another’s territory and refuses to leave, the two may fight by shoving their antlers together. The antlers might sustain damage, but a severe injury to the body is unusual. On the other hand, females visit the males’ territories and choose a mate. The male will sniff the female and “dance” around her to impress her before she allows him to copulate. Sometimes a group of bucks will claim a small territory in an area. This area is called a lek. Female fallow deer are polyestrous, which means that they can go into heat several times during the breeding season if they don’t become pregnant. However, the doe usually does become pregnant during her first heat. Does can become pregnant when they are 16 months old, even though they are not fully grown until they are between four and six years old. Males are fertile when they’re 17 months old, but due to the dominance of older males, they usually don’t have a chance at mating until they are four years old. Bucks are fully grown when they are between five and nine years old. The doe is pregnant for between 33 and 35 weeks. When the time comes to give birth, she’ll find a hiding place then bear a single fawn, rarely twins. The baby weighs between 4.4 and 8.8 pounds, and its mother keeps it hidden in a thicket. She’ll leave to forage then come back to nurse it every four hours or so. When the fawn is about a month old, its mother will introduce it to the herd of other mothers and their fawns. Bucks do not help care for fawns. The mother starts to wean the baby after about 20 days, and weaning is complete when the fawn is about seven months old. It is completely independent when it’s a year old. The fallow deer’s conservation status is Least Concern , and there are places where they are considered either livestock or an invasive species. The former is true in Pennsylvania and other states while the latter is true in parts of California. There are at least 100,000 animals in Great Britain and 4,431 in Australia . The Persian fallow deer is rare and considered endangered . It is only found in Israel and Iran . There are over a thousand of them as of 2021. The lifespan of this deer seems to be around 11 years in the wild, much less than the lifespan of D. dama .",
        "score": 0.7254059
    },
    {
        "Name": "White Ferret Albino Ferrets",
        "Genus": "Mustela",
        "Diet": "Carnivore that enjoys kibble, raw meat, dairy and produce",
        "Behavior": "They can be characterized as social.",
        "Features": "White coat",
        "Fun_Fact": "There are two different types of white ferrets!",
        "Text": "The emergence of white fur, like the white Ferret, in nature is often a rousing success or a lethal failure and rarely little in between. The snowshoe hare — which shows off-white fur to hide in the snow during the winter and a browner coat in the off-seasons — has learned that even in the right environment, white isn’t always a good look. But the common ferret is unique in that white incidence of the species has actually been bred into members of the species intentionally and for purely aesthetic purposes. See all of our expert product reviews . And since the common ferret is a distinct subspecies of the European polecat with no wild counterparts, predators don’t factor into the survival of white members of the species. In fact, white ferrets can actually take two forms: fully albino ferrets and those that simply possess all or mostly white fur. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Since they’re just regular ferrets with either an instance of albinism or a dark-eyed white coloration, white ferrets don’t have a distinct species name — but the scientific name of the common ferret actually tells us a lot. The taxonomic identification for this species is Mustela putorius furo , and that technically makes ferrets a subspecies of their direct ancestor the European polecat ( Mustela putorius ). See all of our expert product reviews . As members of the genus Mustela , both European polecats and common ferrets are part of the weasel family (Mustelidae) and are related to the mink and stoat . The white ferret’s taxonomy tells us a lot, but we can also learn quite a bit by translating Latin. Ferrets are part of the Mustelidae family, which also encompasses species like polecats, stoats, and ermines. Domestic ferrets are thought to have originated from the European polecat and were domesticated roughly 2,500 years ago. Ferrets are taxonomically classified as Mustela putorius furo , which designates them as a subspecies of their ancestor, the European polecat (Mustela putorius) . Furthermore, every existing ferret originates from the Stromer’s polecat (Mustela stromeri) , a diminutive European species from the Middle Pleistocene era (roughly 790,000 to 130,000 years ago). Apart from their coats, these cute ferrets are indistinguishable from their darker and more colorful counterparts. The difference is merely one of pigmentation. There are some points of differentiation between the two distinct types of white ferret though. The easiest point of identification is the eyes. Albinism causes ferrets to develop bright red eyes, while dark-eyed ferrets aptly enough have black eyes. Dark-eyed ferrets will sometimes have slight coloration or patterns in other colors or shades, and that can be another sure sign that you’re not dealing with an albino ferret. While short-haired ferrets are the most common breeds, you can also find albino and dark-eyed white ferrets with long hair or even afghan fur. White ferrets are the same as ferrets in terms of behavior — energetic and mischievous creatures with slinky and agile bodies that allow them to sneak practically anywhere and climb onto any surface. Being white at least means that you can potentially find where they’re hiding more easily. It is important to keep in mind that ferrets are wild animals and obligate carnivores who can be easily scared. This is something to be doubly cautious about when dealing with a white ferret. Albino ferrets are often hard of hearing because of smaller components in their inner ear, and the lack of pigmentation in the lens of their eyes leaves them with terrible vision. Dark-eyed white ferrets are also one of the variations more prone to deafness acquired by a condition known as Waardenburg Syndrome. You may need to adjust your behavior to avoid scaring white ferrets as a result of these sensory limitations. If ferrets were to live in the wild, they’d likely follow the instincts they inherited from the polecat and either dig burrows to hide in or abscond with burrows left behind by moles , rabbits , or snakes . They still adore digging through anything, and many human companions of ferrets make sure to equip their habitats with plenty of different materials to burrow into. Habitats should generally be 2′ x 2′ x 3′ and include a secure door. Ferrets are known for being escape artists, and white ferrets are no exception. When dealing with albinos, you should be especially aware of the lighting since they’re especially photosensitive. The facts are that the ferret we know today never had to exist in anything resembling the wild, but they once served a purpose as more than just mischievous companions and itinerate thieves. Five centuries before the beginning of the Common Era, ferrets were initially tamed to hunt rats , mice , and rabbits . That’s also where they got their high sense of energy. Ferrets were voracious hunters with long and flexible bodies that allowed them to chase their prey into burrows and holes. They aren’t quite such capable hunters now, but that legacy makes a convincing argument for feeding raw meat like chicken and beef or even live meals to a ferret. There are also a number of different dry food brands catered to the needs of ferrets as well as an extensive selection of treats. While dogs left in the wild are sometimes known to revert to their native instincts and run in packs and colonies of domesticated cats can decimate a community’s bird population, the domestication of the ferret has left it utterly incapable of surviving in the wilderness. The ferret as it exists today never has to exist in the wild, and thousands of years of domestication have left it incapable of functioning in an ecosystem it’s thrown into. While their fellow domesticated animals can breed and procreate after being released into the wild, the closest relative to the ferret to live in the wild is the European polecat. And unless they’re long-haired and left in the snow, their white fur is only going to make them an obvious target for predators. In the average neighborhood where pet ferrets are kept, this could mean everything from birds of prey like hawks and eagles to wild scavengers like coyotes and foxes to house cats and pet dogs. While some convey the red eyes and white fur of albino ferrets with sickliness, these cute ferrets don’t actually have any distinct vulnerabilities to disease or negative health conditions. The average ferret is fully weaned after three to six weeks and will reach sexual maturity around the age of six months. The lifespan of a white ferret is the same as the lifespan of any other ferret — seven to ten years. Ferret mating season falls anywhere from the spring to the summer, and a mother can give birth to as many as seven kits in a litter. Since ferrets are fully domesticated breeds with no actual predators, the population could quickly grow out of control if not for conscientious breeding habits from humans. While there’s no global estimate on the population size for either albino or dark-eyed white ferrets, the prices associated with these pets can tell us a decent amount about how rare they are in the overall ferret population. Both types of white albinos can sometimes be found for $50, making them among some of the more affordable choices. In the wild, these sorts of traits would be rare — but we’ve been thousands of years meticulously breeding these traits through one generation after another. There are believed to be at least five million pet ferrets in the United States today, and neither the subspecies nor its white-coated members are going anywhere anytime soon. But the related black-footed ferret is another story. With a population that hovers around 300, they’re the most endangered mammal in North America .",
        "score": 0.7248315
    },
    {
        "Name": "Leopard",
        "Genus": "Panthera",
        "Diet": "Carnivore that eats deer, warthog , rodents",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Dense patterned fur and long, sharp teeth",
        "Fun_Fact": "Spends much of the time high in the trees!",
        "Text": "The leopard is a medium-sized wildcat that lives in a variety of different habitats across sub-Saharan Africa and southern Asia. Distinguished by their uniquely beautiful “spotted” coat, leopards are apex predators that ambush prey from a perch in the trees. This hunting method is unlike their big cat cousins who engage their prey in high-speed chases. The leopard is an animal with a long, lithe body — which powerful legs support — and a long tail that they use for balance in the trees. Leopards can vary greatly in their coloration and markings depending on their surrounding habitat. Those on open grasslands have a light yellow, sun-bleached background coat. Meanwhile, those that live in forests tend to be darker to blend into the shade and have more markings for camouflage. The dark, ring-like patterns that cover the leopard’s coat are rosettes, which provide them with camouflage in their surrounding environment. Leopards are incredibly strong and muscular animals and are able to pull themselves up trees using their legs and retractable claws. Like many other feline species, the leopard is able to draw its claws into folds of skin on its paws. That ability ensures that their claws don’t become blunt while the animal is walking about. Their remarkable eyesight and hearing give them a great advantage during night hunting. The first mammals are believed to have lived 208 million years ago — after the extinction of dinosaurs. The first carnivores came from animals known as miacoids about 60 million years ago. These tree dwellers were about the size of a domestic cat and had developed sharp crushing teeth. Miacoids are the oldest relative to the modern-day leopard. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Carnivores, or the Carnivora order, split into two sub-orders — Caniformia and Feliformia — around 40 million years ago. The Caniformia group was more bear-like and evolved into bears, dogs, weasels, raccoons, skunks, badgers, sea lions, walruses, and seals. Feliformia was more cat-like and evolved into cats, hyenas, and mongooses. Proailurus , the genus of the oldest cat, lived 30 million years ago, the first fossils of which researchers discovered in France in 1879. This arboreal creature weighed around 25 pounds and had eight more teeth than modern cats. 20 million years ago, the direct ancestor of modern cats, Pseudaelurines, lived, according to the fossil record. Fossil records from the La Brea Tar Pits indicate that the saber-tooth tiger, Smilodon, lived in that area at least 2.6 million years ago. These big cats became extinct around 10,000 years ago. There are seven different subspecies of leopards. Each differs in appearance and geographic location, with the African leopard being the most common and widespread. Leopards have not only the widest range of all big cats, but they are also one of the most adaptable. In fact, they live in a variety of different habitats. They commonly call home areas throughout sub-Saharan Africa and southern Asia. There are also small and isolated populations of leopards inhabiting remote geographic locations in the Far East, Northern Africa, and Arabia. Provided there is a good source of cover and an ample supply of food, leopards will inhabit numerous habitats. Those include tropical rainforests, tree-lined savannas, barren deserts, and mountain highlands. One of the reasons why experts believe they continue to survive successfully throughout much of their natural range is that leopards have adapted to the growing presence of people. In fact, they both live and hunt in areas close to urban activity. However, in some parts of their natural range, deforestation and growing settlements threaten populations with the loss of their habitat. Leopards are solitary animals that hunt both on the ground and in the trees. They are excellent climbers, spending the majority of daytime hours resting in tree branches or under sheltered rocks. They are unique amongst large felines, as leopards rely heavily on being able to get close enough to their prey before ambushing it, rather than expelling vast amounts of energy in a high-speed chase. Once they catch and kill their prey, they drag it to safety either into dense vegetation or up a tree trunk and into the branches. Leopards are solitary animals that mark their territory using scent markings and by producing rough, rasping calls, which some say sound like sawing through coarse wood. Home range sizes vary depending on the habitat and the food available but those of male leopards are significantly larger than those of their female counterparts, which often overlap the ranges of a number of both males and other females (sometimes by up to 40%). Check out some incredible facts about leopards . Throughout their natural range, leopards have no distinctive breeding season, with females instead being able to reproduce every couple of months. After a gestation period that lasts for around three months, the female leopard gives birth to between two and six cubs that are born blind and weigh about one pound. Leopard cubs are incredibly vulnerable in the wild. Because of that, they remain hidden in dense vegetation, into which their dark, woolly fur and blurry spots allow them to camouflage. They hide this way until they are able to follow their mother around at between 6 and 8 weeks of age. Weaned at around 3 months old, leopard cubs will remain with their mother for another 18 months until she is ready to mate again and encourages their young to independently establish their own territories. Although male leopards live solitary lives except when mating, female leopards’ range tends to overlap their mothers. Leopards tend to live for between ten and fifteen years in the wild, depending on the habitat and the food supply available. Leopards primarily hunt medium-sized mammals such as deer and warthogs, and these cats often ambush this prey from the branches above or dense vegetation just meters away. The leopard also eats a wide variety of small prey, including birds, reptiles, and rodents. They even hunt dung beetles when larger animals are scarce. By eating much smaller (and a wider variety) of prey, leopards are able to avoid intense competition for food from other large carnivores like tigers and hyenas, with which they share parts of their natural range . Leopards are incredibly strong and capable of taking prey much heavier than themselves. Such prey included antelopes . They then remarkably haul their meal into the safety of the branches to either eat it immediately or cache it for later. Due to the fact that the leopard is a stealthy and apex predator throughout its natural environment, generally, the biggest threat to adult leopards are other leopards, along with the occasional lion or tiger that can get close enough. Nile crocodiles also pose a threat due to their immense strength, extreme aggression, and willingness to sink their fangs into anything. They have taken on leopards crossing bodies of water and won. Pythons are another especially formidable foe and have in the past overpowered these beautiful apex predators. Young leopard cubs however are much more vulnerable and the fact that they have numerous natural predators leads them to remain hidden in dense vegetation for their first couple of months. Although, it is during the times when their mother is off hunting that leopard cubs are most at threat from hyenas, jackals , lions, tigers, snakes, and birds of prey. Despite their adaptability to differing surroundings, leopard populations in parts of their natural range are declining due to habitat loss to the timber industry and agriculture and hunting by humans as trophies and for their meat and fur. Originally thought to be a hybrid of the lion and the jaguar , the leopard has been the subject of much genetic confusion and wasn’t really distinguished properly until just over 100 years ago. Some of the confusion is thought to come from the black panther, which is a leopard that has a completely black coat of fur, with occasional faint markings. This genetic mutation, melanism, causes large amounts of dark pigment to occur in the skin and fur, and a number of mammalian species exhibit it. Black panthers tend to occur most in dense forests with larger populations being found in southern Asia than in Africa and are born into a litter that also contains yellow cubs. Black panthers are actually fairly common and amazingly enough, researchers believe that up to 50% of the leopards found inhabiting the thick, tropical rainforests of the Malay Peninsula are black. Since big game hunting took off in Africa, the leopard has been one of the most sought-after animals for hunters to kill. Because leopards are part of the African “Big Five” — the most desirable animals for sports hunters — trophy hunting has severely affected them in some areas. Locals who live near these big cats also often kill them for their meat and fur. Beyond that, many see them as pests to farms and livestock, due to their lack of fear of people, even though people seldom see them. Despite their persecution, recent booms in the tourist industry in Africa have meant that more and more people are paying for the privilege to see one of these majestic animals in the wild. That brings money into local communities. Because of that, locals are now more willing to protect these cats, as leopards are providing an important and new-found source of good income for them. Today, the IUCN lists the leopard as being Not Extinct in its natural environment, as populations are stable throughout much of its range. A number of sub-species, however, are either Endangered or Critically Endangered in their native habitats and one is thought to now be extinct. This is due to the fact that these populations are either small or geographically isolated, and because local hunting and habitat loss severely affect them. For example, the Javan leopard from the Indonesian island of Java is one of the most endangered animals in the world. In a number of African countries, however, sport hunters still legally hunt leopards as trophies, with annual quotas allocated by CITES (The Convention on International Trade in Endangered Species).",
        "score": 0.7213205
    },
    {
        "Name": "Labouts Fairy Wrasse 2",
        "Genus": "Cirrhilabrus",
        "Diet": "Carnivore that eats zooplankton and invertebrates",
        "Origin": "Australia",
        "Behavior": "They usually live in beds (like reefs).Their aggression level is medium.",
        "Fun_Fact": "Females are sequential hermaphrodites, which means they can convert to males anytime during their life cycle.",
        "Text": "Labout’s fairy wrasse occurs in small groups on the outer reefs of the Great Barrier Reef and New Caledonia. These stunning fish have a distinctive pattern of colors ranging from red, yellow, and orange, with a blue head and nose. While the males and females are similar in color, the males experience an increase in the intensity of their colors during courting. In addition, these colors may vary according to their mood. These colorful fish are a welcomed site in any reef aquarium, which is why they are so popular among fish enthusiasts. But, it’s not just their colors that make them attractive; they also have a peaceful nature. However, only one male can be kept with a group of females, and females need to be introduced into the aquarium before or at the same time as the male. In addition, they like to jump, so be sure to cover the tank with a tight-fitting canopy. The Labout’s fairy wrasses’ scientific name is Cirrhilabrus laboutei, and they form part of the order Labriformes . This order consists of about 642 species of ray-finned fishes in 87 genera. Included in this group are parrotfishes and wrasse. Members of this order have sexual reproduction and rely on their pectoral fins to move around. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Labout’s fairy wrasse belongs to the family Labridae . Most species in this family have slender, colorful bodies with a single long-based dorsal fin. In addition, they have well-developed canine teeth, prominent pectoral fins, thick lips, and cycloid scales. Several species in this family are protogynous hermaphrodites, meaning females can convert to males at any point in their life cycle and have two sex-related color forms. There are 61 species of fairy wrasse in the world, and while it would take forever to name them all, here are 4 of the most popular species: The six-line wrasse is a saltwater fish that is becoming more popular amongst fish enthusiasts every day. They are generally found in the Red Sea, Pacific, and Indian Oceans. These tiny fish are breathtakingly beautiful and named after the six colorful strips running down their bodies. They are very small fish that only reach up to 3 inches in length when fully mature. Unfortunately, aquarists struggle to breed them in captivity. This may be due to the fact that they are all born female and choose when to switch to males based on their environment and other factors. The pink-streaked wrasse is considered one of the best reef wrasses in the aquarium community. In addition to being small and colorful, these fish are sexually dichromatic. This means that males have more pronounced yellow lines running down their bodies and blueish-gray patterns on their gill covers. When introduced to an aquarium, pink-streaked wrasse is shy, but it will slowly come out of its shell and start to spend more time in the open. They are not fussy eaters and will feed on frozen or flake food. The mystery wrasse is a beautiful fish, also known as the white barred wrasse, which is distinctly different from other lined wrasses. Instead of having horizontal lines, they have slender vertical white bars that become thinner as they age, sometimes fading altogether. While scientists have known about this mysterious fish for several decades already, it is still very new to the aquarium scene The leopard wrasse is a non-migratory fish found in temperate waters, with temperatures ranging from 75 to 82 F. They are native to the Pacific and Indian Oceans, and significant populations occur in waters surrounding: Male and female leopard wrasse differ in appearance. Females have a blue, green, turquoise, or teal pattern of wavy lines covering their bodies. In addition, they have black spots, similar to a leopard . However, these spots vary in color from dark brown to mauve or black, and their anal fins and pelvic fins have yellow patches on them. The males have a mixed orange and red base and yellowish-green spots. These spots are lined with a darker hue of black or blue. The Labout’s fairy wrasse have multicolored backs, which are made more prominent by their pale purple and white bellies. In addition, they display vibrant orange, pink, purple, and red stripes. Their heads and the undersides of their gills are covered in dusky blue blemishes, and their fins are transparent with shades of red, yellow, and blue hues. Both sexes look similar, but the males’ color will intensify when courting. Labout’s fairy wrasse is native to Australia and Melanesia, located in the Western Central Pacific Ocean. They prefer to occupy the coastal reef habitats where coral rubble substrate is abundant. They tend to stay near small soft corals or coral mounds where they can quickly hide when danger lurks. However, some species have been spotted in clean oceanic reefs hunting for food like invertebrates . Unfortunately, there is no accurate information regarding their population size; however, their numbers seem stable as Labout’s fairy wrasse is listed as Least Concern on IUCN’s Redlist . Predators of the Labout’s fairy wrasse include nocturnal species like: Labout’s fairy wrasse are carnivores, and in captivity, they eat fish pellets, enriched brine, Mysis shrimp, or zooplankton , which they eat in the wild. These fish should generally be fed 4 to 6 times a day! Because they are carnivorous, they need small meals frequently throughout the day to stay healthy. You can break this up into pellets 3 times a day and live meals two times a day. The Labout’s fairy wrasse is a sequential hermaphrodite, meaning they can transform into males at any time throughout their life cycle. While this may be why they don’t breed well in captivity, you can try to encourage this transition by capturing the most dominant male in the tank. These fish breed best when there is one male amongst several females in the tank. If there is more than one male, fights will typically break out, which kills the mood. Unfortunately, the Labout’s fairy wrasse’s breeding habits are relatively unknown, and it is very difficult to breed them in captivity. They live quite long for fish, with an average lifespan of 6 to 8 years. Humans do not eat the Labout’s fair wrasse, but they are fished in large numbers for the exotic pet trade. There is no available information on their population size, but they are listed as Least Concern on IUCN’s redlist.",
        "score": 0.72030085
    },
    {
        "Name": "Douc",
        "Genus": "Pygathrix",
        "Diet": "Herbivore with no preference",
        "Behavior": "They can be characterized as gregarious.",
        "Features": "Its colors, especially the colors of the red-shanked douc",
        "Fun_Fact": "When these monkeys want to mate, they wiggle their eyebrows.",
        "Text": "The Douc can be called “A Casualty of War.” The douc is an Old World Monkey from Indochina with the face of an ancient, bearded sage. Despite this, it is playful, full of life, and gregarious. The red-shanked species is also the most colorful monkey in the world with a coat that comes in shades of white, red, gray, and black. Despite this, all three species of this primate are in danger of going extinct due to hunting and deforestation. Indeed, the monkey was one of the many casualties of the Vietnam War, as Agent Orange was used to defoliate the trees where it lived. To add insult to injury, soldiers used the animal as target practice. The populations still haven’t recovered from this. Here are five facts to know about this uniquely beautiful monkey: The genus these langurs belong to is Pygathrix . Pygathrix means “hairy buttocks” in Ancient Greek. Pugḗ means “buttocks” and thrix means “hair.” It is, after all, one way to describe this Old World monkey. The nemaeus in P. nemaeus evokes the Nemean lion of Hercules as the monkey’s beard and whiskers resemble the mane of a lion. The nigripes in P. nigripes means “black-footed” in Latin, and the cinerea in P. cinerea is Latin for “ash-colored.” There do not appear to be subspecies, though grey-shanked and red-shanked doucs live close enough to interbreed. The name douc is Vietnamese for “monkey.” The douc is a type of monkey called a langur. Langurs belong to the Colobinae subfamily in the Cercopithecidae family. They are Old World monkeys, which means they are native to Asia and Africa . The red-shanked douc is indigenous to the Indochina region, specifically Vietnam, southern Laos, and potentially northeastern Cambodia, located east of the Mekong River. The exquisite red-shanked douc langur is exclusively found in northern and central Vietnam as well as Laos, residing within the mid to upper levels of the canopy in lowland to montane primary and secondary rainforest habitats. Scientists have gained fresh perspectives on evolution through an endangered monkey species, the leaf-eating douc langur, which is endemic to East and Southeast Asia. This primate possesses a “duplicated” gene that initially emerged as an additional copy of an enzyme-related gene but eventually underwent a mutation, resulting in a gene that serves a distinct function related to another enzyme. The animal’s appearance is singular, and it is one of the most colorful of primates. This is especially true of the red-shanked species. What all Pygathrix langurs have in common is a face with almond eyes and a tiny nose framed by a beard that makes the animal look like a sometimes solemn old man. The body is long and slender, between 21 and 24 inches in length, and the tail is about as long as the body. Males are larger than females. The red-shanked douc is so colorful that is known as the five-color douc. It can be told from other Pygathrix langurs because it looks like it’s wearing reddish-brown leggings. It has white forearms and a white tail that’s used for keeping balance and ends in a tassel. The langur has a yellow-orange face and ears framed by a white beard and whiskers that are more voluminous than the whiskers of the other doucs. Dark eyes have blue eyelids. There’s a black band across the forehead. The legs above the red “leggings” are shades of gray, and the feet below them are black. The belly and the back are gray, and there’s a triangular white patch on the rump. Males can be told from females because males have spots just above the triangle. This is true of all three species. The infant has a black face and tan fur and grows into adult colors over time. The black-shanked can be told from other species because it has a slate-colored face with yellow rings around its eyes. This contrasts greatly with its white whiskers. It has black fur from its forehead down to its shoulders where it turns black as it continues down the monkey’s back. Its shanks are black, which gives it its name. The belly is pale gray, and the tail is white. Black-shanked douc langurs are the smallest of the doucs. The grey-shanked has, as its name says, gray shanks, and indeed most of its body is gray. Its feet and its hands are black, and it has a white throat with an orange, black-lined band that meets up with black patches on the animal’s shoulders. The tail of the grey-shanked douc is about 4 inches longer than the tails of the other species. Despite its sometimes somber look, the douc is an active, agile, and playful primate. It lives in the trees in groups that can be as small as four but as large as 50, though a group of 50 is very unusual. However, there are instances of ales who travel alone. It is diurnal, which means it’s active during the day. There are usually two females for every male. Males dominate, and there’s a dominance hierarchy, but these primates are seen to be unusually genial. They will even share their food, which is unusual for monkeys. They have a great repertoire of facial expressions, including a play face that invites another member of the group to play. Grimacing, on the other hand, means submission. The douc doesn’t have a large vocal range, though they growl to show aggression and have distress and warning calls. The monkeys also spend much time grooming each other. They usually groom in the afternoon, before they take a nap or go to sleep for the night. This is especially true of females. Doucs are noisy when they travel from tree to tree. They are led by a dominant male, with females and babies in the middle and subordinate males at the back. However, they’re usually resting, grooming, digesting, playing, and play-fighting. They rarely leave the trees, though they’ve been known to go to the ground to eat soil for its mineral content. These monkeys live in the forests of Vietnam , Laos , and Cambodia . The red-shanked can be found in the lowlands and as high as 6000 feet in the mountains . Black-shanked and grey-shanked live in evergreen or mixed evergreen and deciduous forests. They can also live in the mountains and prefer trees that are 82 to 115 feet tall. These Old World monkeys are largely folivores, which means they eat leaves, especially leaves that are young and tender. They’ll also eat seeds, fruit, buds, and flowers. Interestingly, they prefer fruit that’s not quite ripe, as ripe fruit upsets their stomachs. Doucs are very particular about what they eat, and if a leaf, flower, or fruit isn’t up to their standards, they’ll toss it. They get all the hydration they need from their food or from sipping the morning dew. The monkeys have a multi-chambered stomach, much like a cow, that helps them break down their food through fermentation. A well-fed douc often has a potbelly. Among the leaves and fruits eaten are: Doucs do not seem to have natural predators. Their main predators are humans, who destroy their habitat, hunt them for bush meat and medicines, and kidnap them for the pet trade. Because of this, there are no more than 26,000 of these monkeys left in the wild, and all three species are critically endangered . Though 26,000 sounds like a large number, their numbers are declining. Even though the Vietnam War ended decades ago, the monkeys still haven’t recovered from the devastation of Agent Orange. Black-shanked doucs don’t appear to have a breeding season. Grey-shanked and red-shanked doucs breed from August to December. Females initiate mating through facial expressions, including jutting out the jaw, shaking the head, and raising and lowering the eyebrows. If the male is interested, he might suggest moving to another area to mate. Pregnancy lasts between 165 and 205 days, and the mother enters a period of quiet and usually stays near another female. She is intensely interested in all the babies in the group until about two weeks before she gives birth herself. A single infant is born after about an hour and a half of labor. Twins are rare among doucs. Females give birth every couple of years or so. The mother is the primary caretaker of the baby, though she’ll allow other monkeys to babysit. Infants are weaned when they’re about a year old and become sexually mature when they’re about four or five. Females mature a bit earlier than males. A well-cared-for captive douc can live into its 20s, and though they are challenging to raise in captivity, some zoos have done so. The Philadelphia Zoo kept a female Pygathrix nemaeus named Toi, who lived to be 21. She started what the zookeepers believed was an age-related decline and was euthanized in 2018. These colorful and energetic monkeys are all critically endangered. There are only about 26,000 left in the wild in Indochina.",
        "score": 0.7128033
    },
    {
        "Name": "Black And Tan Coonhound",
        "Genus": "Canis",
        "Diet": "Omnivore with no preference",
        "Behavior": "Their temperament can be characterized as stubborn, strong, loyal, independent and loving.",
        "Features": "Large, droopy ears.",
        "Fun_Fact": "This dog has its own unique howl.",
        "Text": "Each dog develops its own unique baying, which its owner can recognize from a far distance. The Black and Tan Coonhound is an all-American old-fashioned breed of dog that is a mix between the Black and Tan Virginia Foxhound and the Bloodhound , appearing in the 18th century. This crossbreed is a working dog mainly used for hunting raccoons , but it can also be used to hunt large game. Friendly, mellow, and calm indoors, it becomes strong, stubborn, and independent outdoors with its strong hunting instinct taking over to engage in tracking after starting to trail. Today, it makes an excellent scenthound that can track old, cold trails as well as an excellent pet and a search and rescue dog for law enforcement. See all of our expert product reviews . Black and Tan Coonhounds have a black coat with tan trim, and this is the only recognized coat type for the breed. They can be crossbred with other breeds such as treeing walkers, beagles , German shepherds , and whippets . The black and tan coonhound originated in the United States and dates back to the late 18th century when frontiersmen needed a breed of dog able to hunt raccoons. They crossed different breeds of European hounds, it is believed to be the foxhound and the bloodhound, to get the American breed of hound, the black and tan coonhound. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . This breed is a large-sized single-coat shorthair dog with a dense coat. Males are 23-27 inches in height and weigh 50-75 pounds, while females are slightly smaller at 21-26 inches in height and weigh 40-65 pounds. Black and Tan Coonhound puppies at 8 weeks of age weigh 10 pounds on average and are fully grown around 17-19 months. See all of our expert product reviews . As a crossbreed of the Bloodhound and Black and Tan Virginia Foxhound, the Black and Tan Coonhound is generally healthy and inherits the best from both parents. If you get your dog from a rescue, you can ask about a health screening. Hip dysplasia is a more common issue among dogs that are outdoors hunting, while ear infections are more common with long-eared dogs. In general, however, the health issues this breed might face are: This old-fashioned mix of the Bloodhound and the Black and Tan Virginia Foxhound results in a crossbreed that has a friendly, stubborn, loyal, and independent personality. Its temperament is mellow and strong. Black and Tan Coonhounds have unique health needs. As a working breed and part of the hunting dog category, its health issues often result from outdoor exertion. Potential owners should therefore get certificates of health if purchasing from a breeder and medical records or health screenings if purchasing from a rescue. The most important time for taking care of your pet is during puppyhood. During this time, your puppy will be doing most of its growing, and nutrients are necessary for its developing body and needs. As your puppy becomes a juvenile and eventually an adult, it will reach its full height and weight. Its dietary needs will change, but the breed has the specific nutrients it needs no matter its age. Puppy food: Puppy food must be high-quality and with meat as its main ingredient. It should also be AAFCO compliant. Choose puppy food for large breeds or dog food for all life stages to support growth. Puppies between 8-12 weeks need 4 meals a day, while those 3-6 months old need 3 meals a day, and those 6 months to one year need 2 meals a day. Adult dog food: Adult dog food , like puppy food, needs to be AAFCO-compliant and high-quality. Choose one that is for large adult breeds and has meat as its main ingredient. One meal a day is all a one-year-old adult needs. A-Z Animals feels th e best dog food for Virginia Foxhounds is Wellness CORE Digestive Health Dry Dog Food with Wholesome Grains, Real Meat & Brown Rice. By including healthy grains, this probiotic-coated kibble with digestive enzymes and fiber works from within the digestive system to boost the immune system. A special blend of fish ingredients supplies natural glucosamine and chondroitin to your dog’s diet for hip dysplasia prevention. The taurine is important for both heart and eye health. Pick up Wellness CORE Digestive Health Wholesome Grains dog food on Chewy or Amazon. Your Black and Tan Coonhound, like other dog breeds , changes its coat once or twice a year during shedding season, when it changes coats for Blawinter and spring. Its short, dense coat is low shedding and needs weekly brushing in addition to monthly bathing. Care must be taken to inspect eyes and ears for any dirt, infections or other problems and nails need trimming anywhere from every 2 weeks to once a month. With the word “coonhound” in its name, it is most commonly used for hunting raccoons, but this old-fashioned mix can also be used to hunt large game such as deer , mountain lions , and bears . It’s also known as a “cold nose,” meaning it has the ability to detect an old, cold trail with its sense of smell. With that being said, it is one of the most difficult breeds to train due to its strong, stubborn, and independent nature. Obedience training and socialization should begin as early in puppyhood as possible after weaning, with a firm, consistent and experienced dog trainer or leader. Although it is intelligent, it can be easily distracted by scents. As a working breed used for trailing and tracking raccoons and large games, the Black and Tan Coonhound can easily handle running for several miles and excels in obedience and agility sports. Its daily exercise needs, however, are only a long walk, a field trip, or even just a moderately-long jog. It enjoys visiting new places to sniff, so it greatly enjoys an adventure in a park, the woods, or a hiking trail. It also enjoys chasing balls and children. It is important to keep a leash on it at all times to avoid its tendency to wander, run away and chase animals. Black and Tan Coonhound puppies quickly start using their noses to become familiar with their surroundings. You’ll want to train and socialize them early on to new people, animals, and places, so keep a loose leash on around its neck so it won’t feel constrictive. Black and Tan Coonhounds are boisterous playmates for children, and with their large size, they are better suited for older children. They are loyal, excellent family pets . Dogs that are similar to this breed are the Bloodhound, the Black and Tan Virginia Foxhound, and the Treeing Walker.",
        "score": 0.7124254
    },
    {
        "Name": "Black Footed Ferret",
        "Genus": "Mustela",
        "Diet": "Carnivore that eats prairie dogs, ground squirrels, birds, insects",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Black mask",
        "Fun_Fact": "Black footed ferrets are the only ones native to North America.",
        "Text": "“The black-footed ferret is the only ferret native to North America” The habitat of Black-footed ferrets includes a range extending over the plains of Wyoming, Montana, South Dakota, and Arizona. They are carnivores with a diet consisting mostly of prairie dogs. These mammals have a long, sleek body that allows them to easily fit into tunnels and burrows. They are solitary animals with a lifespan of 3 to 4 years in the wild. Mustela nigripes is the scientific name of the black-footed ferret. Mustela is a Latin word meaning weasel while nigripes translates to black-footed. This animal is sometimes called an American polecat . It belongs to the Mustelidae family and the class Mammalia. The black-footed ferret has a long, slender bod y with white to cream-colored fur on its back along with black feet and a black-tipped tail. One of the most notable facts about its appearance is the black fur on its face that makes it look like it’s wearing a mask. This ferret aka American polecat measures 18 to 24 inches in length with a tail 5 to 6 inches long. An adult black-footed ferret weighs an average of 2 pounds. Males are normally bigger than females. As a comparison, a 24-inch-long ferret is equal to 11 golf tees lined up end to end. A 2-pound black-footed ferret is equal in weight to 1 ½ basketball. The heaviest black-footed ferret weighs in at 2.5 pounds. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The black-footed ferret has many adaptations that help it to survive in its habitat. For one, its wiry, slender body allows it to slip into a prairie dog burrow in pursuit of its prey. Its large eyes help this mammal to see in the dark. Another one of its amazing adaptations is a strong sense of smell. This ferret finds prey and navigates its environment by detecting the scents all around it. The cream-colored coat of this ferret helps it to blend into its habitat so it can hide from predators. This animal’s sharp claws are used to dig into the ground to create a new burrow or expand an existing one. A strong jaw helps this ferret to capture and hold a prairie dog. When one ferret spots a predator near its burrow, the animal starts to chatter and hiss to signal danger to other ferrets nearby. Black-footed ferrets are solitary animals. But, when they do form a group it’s called a business. There are usually 3 or more ferrets in a business. These mammals are shy but may become aggressive during mating season. Black-footed ferrets are part of the large Mustelid family which itself consists of 55 species. Included in that family are mink, otters, and weasels. A common feature most members share is an elongated, slender body, comparatively short legs and a small head with a short snout, and a preference for a carnivorous diet. Ferrets’ earliest known ancestor Mustela stromeri is believed to have also been the forbear of two mid-Pleistocene subspecies, Mustela eversmanni and M. putorius. Black-footed ferrets are believed to have emerged about 2 million years ago developing a preference for a diet of prairie dogs after evolving simultaneously with them over millennia. They are also believed to have already been living in North America, by the Late Paleolithic, about 100,000 years ago. Decades ago, the population of the black-footed ferret was so low the species was thought to be extinct. Their numbers were greatly decreased by a plague that ran through the prairie dog population. It is known as the sylvatic plague and is carried by fleas . It kills 90 percent of the prairie dogs that become infected. When the prairie dog population goes down it takes away the main component in the diet of the black-footed ferrets. As a result, these ferrets began to die off in large numbers. Habitat loss is another reason why the population of the black-footed ferret has fallen so low. Expansion of farmland destroys many of the prairie dog burrows where these ferrets live . One of the most amazing facts is a small population of black-footed ferrets was discovered in 1981. With the help of captive breeding programs and more community education, this ferret’s population slowly began to increase. However, officially, the black-footed ferret is still Endangered . Black-footed ferrets are native to North America . They live in a range that includes Wyoming, Montana, Arizona, and South Dakota. They live in a temperate location of plains and grasslands. These ferrets don’t migrate. But, they do spend more time in their burrows during the winter season. These animals are carnivores. The diet of this ferret consists mainly of prairie dogs. In fact, this prairie dog hunter eats approximately 100 of these rodents in the course of a year! If one prairie dog weighs 3 pounds, that means a black-footed ferret eats 300 pounds of prairie dogs per year. Imagine, 300 pounds is equal to nine-tenths the weight of a panda bear . Golden eagles , owls , coyotes , bobcats , and badgers are all predators of these animals. Most of these predators are nocturnal as well. An owl flying over the plains can easily see the movements of a black-footed ferret and swoop down to capture one. Or, a bobcat can choose a location near the burrow of a black-footed ferret and wait until it ventures out looking for food at night. Prairie dogs make up the biggest part of the diet of these animals. This is why this animal is known as an expert prairie dog hunter! They also may eat ground squirrels , mice , rats , rabbits , reptiles , birds , and sometimes insects . The conservation status of the black-footed ferret is Endangered. When its main diet of prairie dogs decreases, the population of ferrets goes down as well. Also, this ferret is threatened by habitat loss due to land development. They are sometimes killed by farmers who consider them pests that may go after their chickens and smaller livestock. There are conservation actions being taken now to protect this ferret. These actions include captive breeding and educating the public about these unique animals. The breeding season of these animals happens in March and April. In this species, female ferrets compete for males. The gestation period of a female is 41 to 43 days. They give live birth to 3 to 4 babies also called kits. The female ferret cares for the kits in the burrow after they are born. The male doesn’t play a part in the care of the young. Newborn ferrets weigh from 0.2 to 0.3 ounces. They are born with their eyes closed and have a thin coat of white hair. They are mostly helpless until their eyes open. In about 3 weeks, they begin to get black markings on their fur, and their eyes open at 35 days old. After being weaned at around 3 months old, the kits begin to venture out of their underground location as their mother teaches them how to hunt for food. They stay with their mother for about 5 or 6 months before going off to live independently. The lifespan of these animals is 3 to 4 years. The record for the oldest black-footed ferret is 9 years. According to the IUCN Red List of Threatened Species, the population of these animals consists of 206 mature individuals. The conservation status of this ferret is endangered , and they have a decreasing population.",
        "score": 0.71090764
    },
    {
        "Name": "Northern Fur Seal",
        "Genus": "Callorhinus",
        "Diet": "Carnivore that eats herring, mackerel, squid and other fish",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Dense, chestnut-colored underfur",
        "Fun_Fact": "Dense underfur means they don’t need blubber to stay warm",
        "Text": "“The Northern Fur Seal is the largest member of the fur seal family.” The fur seal is well-suited to the cold northern waters of its habitat. Blessed with extremely dense fur and a thick underfur, this large marine mammal can stay warm in freezing temperatures. Although the northern fur seal was hunted almost to extinction, its population has rebounded. The northern fur seal’s scientific name is Callorhinus ursinus , which means “bear-like”. They are the largest member of the fur seal subfamily, Arctocephalinae , which is an eared seal that is part of the marine family of pinnipeds, Otariidae . Although this pinniped is one of the oldest species found in the genus Otariidae , and its current form is believed to have origins dating back two million to five million years ago, during the Pliocene epoch, they come from an older ancestor that walked the Earth. This ancestor dates back to the Miocene, around 15 million to 17 million years ago, and was originally a land mammal but quickly adapted to a marine environment. These adaptations made way for the emergence of the semi-aquatic pinnipeds that we see today. While fur seals are made up of two genera, Callorhinus , and Arctocephalus , the northern fur seal is the only one of its genus Callorhinus ursinus . They have been studied longer than most other marine mammals and are often confused with the Guadalupe fur seal and California sea lion . See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The northern fur seal has dark brown fur with a gray mane and thick, chestnut-colored underfur. This seal has a sturdy, well-built body with a small head and dense fur. It has the longest flippers of any member of its family. Its fur has 300,000 hairs per square inch. Northern fur seals are sexually dysmorphic, which means there are large size differences between males and females. An average male is about 10 feet long and weighs up to 600 pounds. The average female is much smaller, reaching an average length of 5 feet and a weight of 120 pounds. Size is not the only difference in their appearance. Females have more muted coloring and are often light brown or gray. Baby seals are almost black at birth, but they later develop distinct colors. Northern fur seals are pelagic, which means they spend most of their life in the water. They have developed an ability known as “jug handling,” which allows them to rest while bobbing on the water. To do this, they lift their flippers out of the water and bob on the surface. Despite their size, they are fast swimmers. They only visit the land to breed and raise their young. The spots where fur seals gather are known as rookeries or haulouts. These seals are highly intelligent. They use a variety of loud vocalizations. They mate once a year and give birth the following year. During their mating and breeding season, they fast for 40 days and can lose up to 20% of their body weight. Northern fur seals are migratory. The females begin their southward migration in late October or November, while the males begin their journey in late August. They spend the next few months at sea. The northern fur seal spends most of its life on the beaches and waters of the Northwest Pacific Ocean. Its habitat range extends from Baja California at its southernmost point to the Sea of Okhotsk and the Bering Sea at its most northern point. In the summer, northern fur seals travel to various islands to breed. The places Biologists have seen breeding fur seals on the Channel Islands and the Commander Islands. South Farallon Island, off the coast of California , has seen a resurgence of northern fur seal rookeries in the past decade. The Pribilof Islands are one of the major breeding grounds for this species. The islands were once called the Northern Fur Seal Islands. More than 500,000 northern fur seals breed here each summer. The Pribilofs are a group of volcanic islands off the coast of mainland Alaska in the Bering Sea. They are about 200 miles north of Unalaska and 500 miles south of the Siberian coast. Once owned by Russia , they came under the control of the U.S. during the 1867 Alaska Purchase. Their principal islands are Saint Paul and Saint George. Despite their harsh conditions, the islands have become a tourist attraction for people who want to see seals , cormorants, reindeer , arctic foxes , and other unique wildlife. The total estimated human population of the islands is about 470. These seals are carnivores that eat fish and small marine mammals. It eats a varied diet of fish, including herring , squid , pollock, and mackerel. The seal is a solitary hunter. It typically feeds in the evening, night, and early morning. These seals’ predators are sharks and killer whales . Steller’s sea lions and Arctic foxes will occasionally eat seal pups. The carcasses of dead pups and seals are the main diet of gulls and arctic foxes. Humans have historically been the biggest threat to northern fur seals. In earlier centuries, Aleutian natives hunted them for their meat and fur. In the 18th and 19th centuries, the commercial fur trade almost eliminated fur seal populations. Today, northern fur seals are protected by national and international law. There are roughly 1 million of these seals across their habitat. Northern fur seals, however, are classed as vulnerable because of a drop in healthy live births. Researchers are uncertain what has caused the drop in population, but they believe fishing net entanglements, fishing debris, water pollution, and climate change may all be to blame. These seals mate once a year. In May, they go to their rookeries, where the males compete for breeding spots on the sea beach or floating ice. The oldest, strongest males mate with several females at a time and travel with their harem to the breeding site. Some males will mate with 50 or more females. Males without a harem must compete to mate with the remaining females. The mating season lasts from May to July. Adult males usually arrive in May and establish their territories. The females usually arrive in June and give birth within two days. A few days later, the female mates again. Gestation takes about one year. When the females give birth, their children are the product of the previous year’s mating. Although males are sexually mature at 5 to 6 years, younger males cannot compete with older males for a breeding site. It takes about 10 years for a male to create a harem and claim one of the top breeding spots. Each female cow gives birth to one pup. At birth, a pup’s weight is about 13 pounds. The pups learn to swim by practicing in shallow pools on the island before venturing out into the sea. Mother seals can recognize their own pup’s calls, which makes it possible for them to find them in the crowded breeding area. Mothers nurse their young for about five days and then begin foraging for food. The pups nurse from their mothers for about four months. During this time, the cows divide their time between nursing their pups and hunting for food. Once the pups are weaned, the youngsters can hunt on their own. There are over 1 million of these seals across its range. The species is vulnerable , however, because of drops in seal pup production since 1980. The largest breeding site is on the Pribilof Islands. These seals were highly prized for their thick, warm fur. Widespread slaughter of this seal almost caused it to become extinct. In 1911, Russia , Japan , the U.S. , and the U.K. signed the North Pacific Fur Seal Convention to restrict hunting on the islands. This was the first international treaty aimed at protecting wildlife. The 1966 Fur Seal Act prohibits all hunting except subsistence hunting by indigenous Aleutians. Today, there are about 1.1 million northern fur seals left in the wild. It is classified as “vulnerable” by the International Union for the Conservation of Nature (IUCN).",
        "score": 0.70951706
    },
    {
        "Name": "Scarlet Tanager",
        "Diet": "Insectivore that eats mainly invertebrates, including moths, butterflies, ants, and beetles",
        "Behavior": "They usually live in pairs flocks and can be characterized as solitary.",
        "Features": "Black and red contrasting colors",
        "Fun_Fact": "Males molt into an olive-yellow color during the fall and winter",
        "Text": "“Listen for their robin-like warbles in Eastern deciduous forests.” The scarlet tanager inhabits mature forests high in the canopy. Look for their contrasting black and red colors as they perch on branches and dash out to grab their prey. You may hear their raspy warbles before you see them. Although, their calls are often mistaken for a robin’s . Discover everything about this fascinating bird , including where you can find them and how they behave. The scarlet tanager lives in over 35 countries, including the United States , Canada, Mexico, Cuba, and Peru. It spends spring and summer in the Northeast United States and parts of Southern Canada. They migrate through Central America and the nearby islands before stopping in Northwestern South America for the winter. They live in mature deciduous forests and some mixed conifer forests in their summer habitats. When they’re migrating, they stop in similar forest environments but also reside in parks and gardens. In their South American winter homes, they inhabit mature forests on hills and mountains, often near a forest edge. To find them, look for flashes of red high in the trees and listen for their raspy robin calls. Females choose their nest site in a shady deciduous tree around 50 feet above the ground. She builds a shallow open cup on a horizontal branch away from the trunk. It takes her around three days to make the nest, and she begins by finding material on the forest floor. The materials include twigs, grasses, bark strips, and pine needles; she lines it with vine tendrils and fine plant fiber. The scarlet tanager (Piranga olivacea) is from the Cardinalidae family, which encompasses New World passerine birds , such as cardinals, grosbeaks, and buntings. The Piranga genus comprises members of the cardinal family, and its specific name, Olivacea, is New Latin for “olive-green.” These medium-sized American songbirds are the smallest Piranga species north of the Mexican border. The scarlet tanager is stocky with thick bills, large heads, and short, broad tails. They are smaller than a northern cardinal , measure 6.3 to 6.7 inches, weigh 0.8 to 1.3 ounces and have a 9.8 to 11.4-inch wingspan. Adult males are a dazzling red color with black wings and tails. Females and immatures are olive-yellow with darker green wings and tails. After the breeding season, males molt into their winter plumage, which resembles the females. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Males arrive early to the breeding grounds, where they defend their territories. They perform singing battles with other males and will sometimes get into confrontations involving threatening postures and eventual chasing. Pairs are fairly solitary during the breeding season but disperse quickly to join flocks for migration and wintering. The scarlet tanager is a long-distance migrant. This bird inhabits the Northeastern United States and parts of Southeast Canada during the warmer months. During migration, they fly at night, cutting across the Gulf of Mexico, Cuba, and the eastern coast of Central America. Their wintering grounds are in Northwestern South America, like Ecuador and Peru. Scarlet tanagers are insectivores who supplement their diet with fruit and tender buds. They eat mainly invertebrates, including moths, butterflies, ants , beetles, flies, cicadas, termites, grasshoppers, locusts, snails, and spiders. They also eat wild berries like mulberry and elderberry. To find food, they walk along branches peeling back the bark. They often sit perched or hover to grab flying insects mid-air quickly. If they can’t swallow their prey whole, they squish it by pressing it into a branch. The IUCN lists the scarlet tanager as LC or “least concern.” Due to its extensive range and vast, stable population, this bird does not meet the criteria for a “threatened” species. While no significant threats exist to this tanager, they are still vulnerable to habitat loss, and forest fragmentation may affect their population over time. They are also susceptible to the effects of climate change, such as spring heat waves, wildfires, and heavy rainfall. Adult scarlet tanagers can be eaten by birds of prey like owls and merlins. But their young are the most vulnerable and often fall victim to blue jays, crows, grackles, squirrels , chipmunks, and snakes. They may be still around other birds like crows, choosing to be silent and watchful. But when necessary, they will mob predators by diving, swooping, and calling. During courting, males hop around with their wings drooped and tails spread, showing their contrasting colors. When pairs form, they are monogamous during the breeding season but will switch mates annually. Females lay between two and five bluish-green eggs with brown spots and provide incubation for 12 to 14 days. Both parents feed the nestlings, and they fledge the nest nine to 15 days after hatching. However, parents feed them for another two weeks until they are fully independent. Scarlet tanagers are sexually mature and molt for the first time around one-year-old. They can live up to 11 years. Its global population is unknown, but according to the IUCN, its numbers have been stable in North America for over 50 years (1966 to 2019). While not exact, Partners in Flight estimate its breeding population at 2.6 million mature individuals. They are also not experiencing any extreme fluctuations or fragmentations in their numbers. Sources:",
        "score": 0.70847565
    },
    {
        "Name": "Sable Ferret",
        "Genus": "Mustela",
        "Diet": "Carnivore that eats rabbits and vermin if it is used for ferreting and enjoys meat the form of food",
        "Behavior": "They can be characterized as gregarious.",
        "Features": "Its beautiful, dark brown fur",
        "Fun_Fact": "Ferrets were used during the Revolutionary War to keep down the rat population.",
        "Text": "“The Sable Ferret is the most common of the pet ferrets.” Though it requires more upkeep than a dog or a cat , the sable ferret makes a great pet. It is clean, as it can be trained to go in a litter box, lively, intelligent, and endlessly curious about its world. It is one of many color morphs of the domesticated ferret and the most popular. Here’s more about this lovely little mustelid: See all of our expert product reviews . The scientific name of the sable ferret is Mustela furo . This is the scientific name it shares with other ferrets. Mustela is Latin for “weasel” and furo is Latin for “cat” or “robber.” A synonym is Mustela putorius furo . Mustela putorius, the polecat is believed to be the ancestor of the domesticated ferret. By the way, putorius is Latin for “stench.” Sable ferrets are descendants of European polecats (Mustela putorius). These critters may have been domesticated over 2,000 years ago in ancient civilizations. For example, they are thought to have aided Greeks and Romans with hunting, as well as controling rodent populations. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Ferrets gained popularity as mere lovable pets in the 20th century. People began to recognize their playful, charming natures, and breeders selectively developed their color variations. Sable ferrets eventually became one of the most popular among ferret enthusiasts. See all of our expert product reviews . There are different color morphs of sable ferrets, including the mask sable ferret and the mitt sable ferret. The standard sable Ferret has deep brown guard hairs over a paler undercoat. It is probably the same animal as the sable mask ferret because both of them have dark masks over their eyes. Not only this but the mask changes with the seasons and with the animal’s age. The mask may cover much of the animal’s face in the summer but only cover the eyes in the winter. The sable mitt ferret is the same as the other sable ferrets but has white feet. The black sable ferret’s guard hairs are black as opposed to dark brown, but they also cover a lighter undercoat. The sable ferret’s color patterns can also be a point or solid as well as standard. A solid ferret’s fur is one color, with no white or cream anywhere. Point ferrets have darker brown on their faces, feet, and tails in a way that recalls a Siamese cat. The sable ferret is not the same as a Russian sable. The Russian sable is a relative of the ferret and is considered a type of marten. It is bigger than a ferret, with a body length of 14 to 22 inches with a 2.8 to 4.7-inch long tail. The Russian sable is a wild animal found in Russia , Mongolia , China , North Korea , and Japan . Unlike the sable ferret, it is an omnivore and does not make a good pet. It is illegal to own in some places. The sable ferret has the long, limber body of other ferrets as well as its ancestor the polecat. Traits that help in identification are an undercoat that ranges from white to brown and is covered with deep brown guard hairs. The colors of the fur are all the same shade, especially the head, the neck, and the body. Its eyes are black and are covered with a dark mask, and its nose can be mottled, black, or pink. Like other ferrets, the sable is about 20 inches long, weighs between 0.66 to 5.95 pounds, and males are bigger than females. Sable mitt ferrets have white feet, and sable mask ferrets have the trademark mask over the eyes. Like the polecat , the sable ferret has anal glands that it uses for scent marking and identification. Identification of one ferret by another can also be done through urinating. This cute ferret is playful, inquisitive, and tidy, but it will sleep about 18 to 20 hours a day and be most active just when the sun rises and just after it goes down. How much it wants to play might depend on whether its human is around to interact with it. The sable ferret gets along with dogs and cats in the family but as a carnivore, it may be dangerous to have around pet birds and other creatures smaller than it is. It can be trained to do tricks and obey commands and can even be house-trained to do its business in a litter box. This is easy for the ferret to learn because it would use a specific spot to eliminate in the wild. Owners of ferrets are delighted when they burst into what’s called a war dance. In this dance, they leap about and crash into things. It has nothing to do with war but simply means the ferret is happy and wants to play. If it has a ferret companion, they may play fight. The sable ferret has a large repertoire of sounds, including docks, clucks, screeches, squeaks, barks, and hisses. Though polecats are solitary, ferrets will happily live together. They like to burrow and hide, so their enclosure or play area should have places where they can do this. The sable ferret also likes to sleep in a closed-in place, so a sleeping box should also be provided. The last wild ferret in North America is the black-footed ferret that lives underground in prairie dog towns. If members of M. furo lived in the wild, they would live in woods near bodies of freshwater. As a pet, the intelligent and energetic sable ferret needs as big an enclosure as is practicable. Since this cute ferret loves to chew on things, it’s best to get a metal cage. The cage also needs to be equipped with objects the ferret can explore, hide in, burrow through and play with as well as a litter box. Even with a large cage, a ferret needs to be let out for at least an hour or two to explore its larger environment and to play with its human. In the wild, a ferret would take small animals such as rabbits and mice and eat all of it, including its fur, skin, and viscera. Some pet owners do offer their ferrets freshly killed or even live animals, but this isn’t enough for a domestic ferret. Fortunately, there is food on the market that is made for ferrets and contains a healthy amount of taurine. The best ratio is 34 percent animal protein and 20 percent fat. Sable ferrets, like other members of M. furo do not process plant material well and shouldn’t be offered fruits or vegetables as treats. Instead, it is best to give them pureed baby food made of meat as a treat. One thing to consider before buying a domesticated ferret is indeed its diet. The animal has such a fast metabolism that it needs to eat as much as 10 times a day. Because they are pets, these ferrets don’t have natural predators. If they did live in the wild, they would have to face predators such as birds of prey, coyotes , mountain lions , and other large carnivores. The biggest threat to these ferret concern its health. Pet ferrets are unfortunately subject to many diseases and disorders. These include cancers and disorders of the adrenal glands. They can also suffer from viruses, parasites, canine and feline distempers, and problems with their teeth. They can also swallow objects that can obstruct their bowels and be subject to hairballs like pet cats. Ferrets can also spread diseases to humans. It is important for a pet sable ferret to be vaccinated for rabies and other diseases. These ferrets are ready to mate when they’re about six months old, even though they’re not fully grown until they’re a year old. Male ferrets mate with many females, and females can have as many as three births a year. Some litters can have as much as 15 kits, and if the female has less than five kits, she will go into estrous even as she’s still nursing them. The ferret breeding season is usually between March and August. The female is pregnant for about 42 days, and the kits are born helpless and blind. Their eyes do not open until they’re five weeks old, even as they are weaned when they’re between three and six weeks old. They have their permanent canines by the time they’re two months old and can eat kibble. Their mother stops caring for them at this time, and this is usually when a breeder sells them. The lifespan of this cute ferret is between six and 10 years. It is estimated that there are at least 5 million pet ferrets in the United States alone. The sable ferret is the most popular.",
        "score": 0.7059578
    },
    {
        "Name": "Common Yellowthroat",
        "Genus": "Geothlypis",
        "Diet": "Insectivore that eats insects, spiders, larvae, invertebrates",
        "Behavior": "They usually live in pairs flocks and can be characterized as solitary.Their aggression level is medium.",
        "Features": "Black mask rimmed in white above",
        "Fun_Fact": "The Common Yellowthroat stays close to the ground and uses stealth to survive!",
        "Text": "The Common Yellowthroat stays close to the ground and uses stealth to survive! The Common Yellowthroat is a cute little bird with a black mask and a bright yellow bib. It makes its home in North America, with some members of the species wintering in Central America and the Caribbean. Most often found in marshes, wetlands, or pine forests, this secretive bird makes use stealthy tricks to avoid predators. They just might evoke thoughts of Mission: Impossible as they dart into a thicket, sneak silently through the dense vegetation to their hidden nest, then leave the cover from an entirely different location. Listen closely and you are likely to hear the bird’s song. Males sing up to thousands of times per day! The Common Yellowthroat is found throughout much of North America, Central America and the Caribbean. It resides year-round in southern portions of the United States and much of Mexico. Throughout the rest of its range, it is migratory. Some of these warblers migrate long distances, from northern Canada all the way to Central America. Others migrate along much shorter routes. These birds can be found almost anywhere that there is thick and abundant vegetation. They are typically seen in marshes and wetlands, particularly in areas that have lots of thick cover near the ground for them to forage and make their nests. Common Yellowthroats also inhabit grasslands, prairies and forests. They prefer open pine forests, but they can be found in other forested areas, especially during their migration. These birds make their nests on the ground or in low, dense vegetation like grasses, reeds, hedgerows, and thickets. Because they tend to live in and around wetlands and marshes, they will often build a little bit off the ground in areas prone to flooding. Very occasionally, they will build their nests in plants that are growing out of the water. Sometimes they build their nests with a roof, much like the Ovenbird which was named for its nest that looks much like an outdoor oven. The scientific name of the Common Yellowthroat is Geothlypis trichas . The word geothlypis comes from Greek roots meaning, essentially, ground bird. It is the name of the genus within the Parulidae family of New World warblers that contains yellowthroats. The Common Yellowthroat was described by Linnaeus in 1766 and was among the first birds of the New World officially described by scientists. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . In Spanish, this species is known as Mascarita común, and in French its name is Paruline masque. Both names are indicative of the bird’s masked appearance. There are currently 14 subspecies of Common Yellowthroats. These include the first, nominal subspecies, Geothlypis trichas trichas , named in 1766 and the latest addition in 1947. Although, as ornithologist A.J. van Rossem noted in 1941, there is much overlap in appearance between the subspecies, and they can be difficult to distinguish in the field. Common Yellowthroats are small birds with round bellies and round heads. They are roughly the size of a small sparrow, weighing only about 0.3 ounces, or 9 to 10 grams. They are approximately 4.3 to 5.1 inches long. Their tails average about 1.9 inches in length, and their wingspan ranges from 5.9 to 7.5 inches. The most striking features of the male Common Yellowthroat are its black mask, which is rimmed in white above, and the bright yellow plumage on its underside. This bird has olive-brown upper parts, a bright yellow throat, and bright yellow under its tail. Its tail is relatively short and often cocked upright. It has black eyes, pinkish legs and feet, and a long, pointy black bill similar to that of a flycatcher . The species is sexually dimorphic. Female Common Yellowthrowats do not have the mask that males wear, and they are more brownish on their upper parts. Their underparts are yellow, but the intensity of the color varies among subspecies and geographic location. Juvenile females are mostly brownish, with yellow under the tail. Juvenile males look similar to adults, but with just a hint of the mask they will eventually sport. Common Yellowthroats are stealthy birds by nature. They live and make their nests in areas of dense cover, and then use sneaky tricks to avoid predators. Entering a thicket from one spot, they quietly flit unseen within the vegetation all the way to their nest, and then leave again from a completely different area. They also tend to dart out from a perch to catch prey on the wing, quickly flying back to cover. Some birders insist the secretive birds can be found more easily by listening for their song. The high-pitched “wichety-wichety-wichety” call of the Common Yellowthroat is easy to recognize, and they sing a lot. Individual males have been recorded singing thousands of songs per day . They tend to stay close to the ground, not high in trees. They may be seen flitting up and down a single stalk of tall grass, a thin branch, or a slender reed. These birds form socially monogamous pairs during breeding season, and even though the females may mate with more than one male, their mates can be quite aggressive in defending their territory. However, they are usually solitary during the winter. Common Yellowthroats often forage with mixed flocks of similar species during their migration. Common Yellowthroats are insectivores. Their diet consists of insects and larvae they can catch on the ground and on the surfaces of plants, as well as those they can catch in the air. These birds are light and quick. Flitting along tiny branches or stems, they can snatch prey from almost any surface with speed and accuracy. They eat small insects like bugs, ants, termites, beetles and flies, as well as caterpillars and other larvae. Small grasshoppers and crickets make tasty meals for these warblers. They also eat spiders or other small invertebrates they find on plants or on the ground. In the air, these birds dart out and catch their prey quickly. Then they retreat just as fast to the cover of dense vegetation. Slow moving moths and butterflies do not stand a chance against these swift birds. The warblers also eat damselflies, dragonflies, and even prey on bees and wasps. These birds reach sexual maturity at about one year of age. Males perform mating displays, flying up from cover while singing a high-pitched song, then dropping back down again. Females select a mate and the birds form pairs, but not strictly monogamous ones, as females often engage in extrapair mating with other males. Research shows that female Common Yellowthroats choose males as their mate or their extrapair partner based on plumage ornamentation . These features include the male’s mask and the size and intensity of color of his yellow bib. Females build their cup-shaped nests on the ground or in low, dense vegetation. They make the nests from grass, sedges, and leaves, with softer materials on the inside. Then they lay an average of three to six eggs and have one to two broods per year. The female incubates the eggs for 12 days, during which time the male guards the territory and sometimes delivers food. Chicks fledge after 10 to 12 days. According to research, Common Yellowthroat pairs feed and care for their offspring for a long time . This is especially true with regard to the second brood of the season. The parents and offspring may stay together all the way through migration. The birds migrate south in the fall, usually from September through October, and they return again in the spring. Common Yellowthroats are vulnerable to birds of prey such as hawks, falcons, and even the diminutive Loggerhead Shrike. Nest predators are also a significant danger to these birds that nest so near the forest floor. Chicks and eggs can easily fall prey to animals such as snakes . Small mammals such as mice, chipmunks , raccoons , opossums, and skunks are also serious threats to these ground-nesting birds. The Common Yellowthroat lives approximately 10 years in the wild. The oldest recorded individual lived to an age of 11 years, 6 months. This bird is listed as a species of least concern by the IUCN Red List of Threatened Species . It has a population of approximately 77 million mature individuals, but its numbers are decreasing. Habitat degradation is one of the primary concerns. Predation and nest parasitism by the Brown-headed Cowbird are also threats.",
        "score": 0.7037922
    },
    {
        "Name": "Wryneck",
        "Genus": "Jynx",
        "Diet": "Insectivore that eats ants, beetles, larvae, spiders, moths , and woodlice and especially likes insects",
        "Behavior": "They can be characterized as semi-social.",
        "Features": "Camouflage plumage",
        "Fun_Fact": "They feign death by making their bodies limp and closing their eyes.",
        "Text": "“When threatened, they twist their head like a snake and hiss.” The wryneck is an unusual bird from the woodpecker family. It has an impressive range throughout three continents, including Africa, Europe, and Asia. They live in forests and woodlands, but you can also find them in suburban parks and gardens during the breeding season. However, climate change has affected one species’ numbers and limited their reproduction ability . Discover everything there is to know about this curious bird , including where they live, what they eat, and how they behave. The wryneck lives in at least 100 countries across three continents: Africa , Europe, and Asia. You can find them in the United Kingdom , India, China, Nigeria, Italy, and many more places. They inhabit temperate regions in Europe and Asia during the warmer months and migrate to tropical areas in Africa and Asia during the winter. The red-necked wryneck is a resident in its environment, which includes Sub-saharan Africa ( South Africa , Cameroon, Congo, etc.). In the summer, you can find them in parks, gardens, orchards, open country, deciduous woodlands, and coniferous forests . They live in savannas, secondary woodlands, and woodland edges in their African habitats. You can also find some in Japanese and Southern Chinese coastal areas. The nesting site varies by availability and includes preexisting tree trunk holes, wall crevices, nesting boxes, and bank holes. Their goal is to find a spot in a safe, secure area away from predators. They will eject owners from their holes and burrows when necessary and take up residence. They don’t use any nesting material. The wryneck ( Jynx) is from the Piciformes order, which includes nine families of large arboreal birds. Woodpeckers, wrynecks, piculets, and sapsuckers belong to the Picidae family, and most species live in forest or woodland habitats. Their genus, Jynx , is Ancient Greek for “lynx,” a mythological nymph who used enchantments to cast spells. This genus contains two species: the Eurasian and red-throated (rufous-throated) wrynecks. Wrynecks are long, slim birds that measure around 6.5 inches and weigh between 0.92 and 1.76 ounces. Their wingspan is approximately 10.5 inches, and have long, pointed beaks, though not as long as other woodpeckers. They also have slender legs and backward-facing toes that allow them to cling to trees. Its coloring is a mottled brown with light brown, rufous (reddish-brown), and black bars and markings. The rufous-necked wryneck has a patch of reddish-brown fur on its chest near its neck. These birds are relatively social and form small groups during the winter and live in pairs during breeding. Their calls consist of harsh, repeated phrases similar to a lesser spotted woodpecker. They also produce staccato alarm calls and hissing noises when threatened. Wrynecks can turn their heads 180 degrees and use this feature for communicating threats, distress, or courtship. Rufous-necked wrynecks are nonmigratory and live in their African environments year-round. The Eurasian wryneck is primarily migratory, except for populations in Northwest Africa. Others breed across Europe and Northern Asia and winter in the tropical areas of Africa (Cameroon and the Central African Republic ) and Southern Asia (India and China). Wrynecks are insectivores who spend most of their time foraging in trees. Ants are their primary prey, but they also consume beetles , larvae, spiders, moths, and woodlice. Wrynecks hop along the ground in low shrubs or upper tree branches and forage for insects by quickly extending and retracting their tongue. They can also climb tree trunks at a diagonal angle by clinging with their feet and using their tail as a prop. The IUCN lists both wryneck species as LC or “least concern.” Due to their extensive range and large population sizes, they do not approach thresholds for “threatened” status. The Eurasian species has had a steady decline in population since the 1800s and 1900s. The main contributing factor to its ongoing decline is the effects of climate change. Heavy rainfall plagues their breeding season, leading to less successful reproduction. Other factors include habitat loss and pesticide use. The rufous-necked does not appear to have any significant threats. In fact, their numbers are on a steady incline. The wryneck’s predators include stoats, weasels , and birds of prey (hawks, eagles, and owls). Thankfully, this bird has a few tricks to keep them away. Its plumage blends with its environment, essentially camouflaging it from nearby intruders. If they become disturbed at their nest, they perform a snake-like head twist while hissing. This threat display mimics a snake and deters many predators. Other defenses include crouching in open areas and feigning death by hanging limp and closing their eyes. Wrynecks are most likely monogamous and mate for life, and the breeding season runs from April to June. Females lay between five to twelve dull white eggs; both sexes take turns incubating for approximately 12 days. Both parents feed the chicks, and they fledge the nest around 20 days old. Their young are sexually mature after one year and molt annually. They live an average of 3.5 years but can live up to five or ten. The global wryneck population is unknown, but Eurasian wrynecks account for at least three million to seven million mature individuals. However, that species has a decreasing population trend and has had a steady decline since the 19th century. Its downward trend is associated with climate change, the agricultural industry, and pesticides. The rufous-necked has an increasing population trend in South Africa due to the introduction of trees into grasslands .",
        "score": 0.6998037
    },
    {
        "Name": "Sable",
        "Genus": "Martes",
        "Diet": "Omnivore that eats molluscs, hares, rodents, musk deer",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Luxurious fur",
        "Fun_Fact": "Their fur has been considered a luxury item since the Middle Ages",
        "Text": "Sable Fur Has Long Been Cherished for Its Texture and Color With their smooth, finely tinted coats, sables have long been objects of desire — or, at least, their fur has. The Sable is a forest-dwelling animal that sports a lush, silky coat and spends most of its time alone. Today, sables are animals that are commercially farmed, but large populations still exist in Russian and Mongolian forests. Smaller communities can also be found in other pockets throughout Asia . The scientific name for the sable is Martes zibellina. It’s a faux Latin combination derived from the Old French word “martre,” meaning “sable martin,” and zibellina, which comes from the Italian name for the animal, zibellino. Colloquially, the word “sable” has Slavic roots and entered Western European vocabularies during the medieval fur trade. Germans adopted the term “zobel,” the Dutch used “sabel,” and the Spanish “cibelina.” In Medieval Latin, the language used by the Catholic Church in the Middle Ages, created the word “sabellum” to describe the animal. The martes genus, to which the sable belongs to, first evolved around 7 million years ago, during the Miocene era. The use of its fur has been highly prized since the early Middle Ages and was revered as an item of great wealth. Famous leaders in history said to have prized the sable’s fur were Ghengis Khan, King Henry VIII, and Emporer Charles V. These animals are between 13 and 22 inches long from head to backside. Their tails tack on an additional 5.1 to 7.1 inches. They usually tip the scales between two and four pounds. And typically, males are larger than females. Sable fur is unique in that it’s smooth in all directions. When you brush it against and with the grain, it feels the same. However, the texture changes slightly with the seasons. Winter pelage is longer and lusher than summer fur. Coloring is geographically dependent, but all species are some shade of brown or black. Several populations also sport lighter patches around their throats. Genetic cousins to pine martens, these animals are similar looking, except their hair is silkier, their heads and ears are shorter, and their tales are proportionally shorter. Depending on food availability, their home territories are between 1.5 and 11.6 square miles. Most of the year, they’re crepuscular hunters — meaning they’re most active at dawn and dusk. However, during mating season, sables are out and about during the day as well. For the most part, Sables are solitary animals and only convene for breeding and child-rearing. The Sable is a species of marten that belongs to the genus martes , of which there are 8 different species. The marten is a weasel-like animal that, in addition to the sable, is made up of the following species: Forest-dwelling residents of Russia and Mongolia , these animals are most plentiful in the Ural and Altai Mountains. Smaller populations also exist in parts of China and the Korean Peninsula . As great climbers, they prefer habitats filled with spruce, pine, larch, cedar, and birch. Typically they burrow near riverbanks and deep in thick woods. Sables build lodges around tree roots, which serve as structural reinforcement. Inside, they carpet their dens with grass and shed fur. These animals are omnivores whose diets change seasonally. Because of their relatively small size, they are prey for larger carnivores. These animals fall prey to wolves , foxes , wolverines , tigers , eagles , lynxes , and large owls. In the summer, sables primarily feast on hares , eggs, and other small mammals. During winters, they incorporate wild berries and rodents into their nutrition rotation. Sometimes, they stalk wolf and bear tracks in search of leftovers. And occasionally, they’ll eat fish caught with their front paws. Currently, the International Union for the Conservation of Nature categorizes sables under Least Concern . The populations remain stable, and some are even growing. June through mid-August is the sable breeding season. To win over mates, males rumble like cats — often violently. When pairs form, they couple for eight straight hours! However, females don’t become engorged immediately. Instead, it takes eight months for implantation to occur. As such, their gestation periods are 245 to 298 days, but embryonic development only lasts 25 to 30 days. These animals give birth in hollowed trees. To prepare for the event and ensure newborns’ comfort — they build nests of moss, leaves, and dry grass. Litters can range in size from one to seven cubs, but two or three is the norm. Babies are born with closed eyes and weigh between .88 and 1.23 ounces. Typically, they’re about 3.9 to 4.7 inches long. After about a month, pups’ eyes open, and they leave the nest shortly after that. At two years old, they reach reproductive maturity and start having cubs of their own. During the baby’s early days, mothers nurture and suckle the young, while fathers defend the nest and forage food. How long do these animals live? In the wild, the average individual makes it to 18. In captivity, sables’ lifespans are about 22 years. Pine martens and sables can and do interbreed in the wild. Their offspring are called “kidus.” Smaller than full sables, the hybrids also have coarser hair, and almost all are sterile. However, there is one known instance of a female kidu successfully mating with a pine marten . Sable subspecies is a hotly debated topic. One school of thought insists only seven exist. Others believe there could be 17 or as many as 30. By the 20th century, these animals were nearly extinct from excessive hunting and poaching. However, commercial farming supplanted wild hunting, and sables experienced a resurgence. Their growth was aided by a Russian reintroduction initiative that lasted from 1940 to 1965. In terms of population numbers, researchers estimate that over 2 million individuals are thriving in the wild. According to some accounts, their numbers are rising, not declining.",
        "score": 0.69905734
    },
    {
        "Name": "Russian Blue",
        "Genus": "Felis",
        "Diet": "Carnivore with no preference",
        "Behavior": "Their temperament can be characterized as independent, easy-going and loyal.",
        "Fun_Fact": "The Russian blue cat is also known as the Archangel blue cat, and is thought to have originated from the port of Arkhangelsk in Russia.",
        "Text": "Like many other breeds, the Russian Blue was brought to England as a curiosity by far-ranging British seamen. From these small beginnings in the 1860s, the breed disseminated all over the western world but never in any large numbers. Despite its many sterling qualities, Russian Blues have one character trait that kept them from becoming more widespread. They are notoriously reserved towards strangers and disruptions in their normal routine. This made them very poor raw material for the chaotic cat show venues that popularized various types of felines. Being nervous and skittish in such a public space discouraged many breeders from taking to the Russian Blue as a potential breeding or cross-breeding candidate. See all of our expert product reviews . They ended up missing a lot since the Russian Blue has many unique qualities in its mix of attributes. The most interesting of these is the eye color. Kittens have yellow eyes. As they reach adolescence, this yellow color becomes constricted by a ring of green, which gradually takes over until the cat’s eyes are fully green at maturity. As with other British-centric cat breeds , the Russian Blue was badly depleted by World War II and only recovered very slowly thereafter. Breeders at first crossed it with some of its Siamese and European cousins, then later worked hard to breed these same introduced characteristics back out so that the breed could revert closer to its original mix of specifications. The result is that modern Russian Blues are not entirely pure with regards to their progenitors from the White Sea in far northern Russia but very close. There are three types of Russian blue cats that came about as the breed was exported and then developed in some central locations. The types are: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The origin of the Russian blue cat is unknown as it was a naturally occurring breed, but evidence points to it originating in Russia. While some believe these cats descended from the pets of Russian czars, others think they lived in the wild and were hunted for their beautifully colored, thick fur coats. In the 1860s, Russian sailors are said to have carried these cats aboard their ships as pets, especially in the port city of Arkhangelsk. Russian Blue cats received the nickname “Archangel Blues” after the name of that Russian city, which translates to “Archangel.” It’s accepted that these sailors helped to spread this unique breed throughout Europe. See all of our expert product reviews . Russian blues were in the U.K. by 1875, appearing at the Crystal Palace in London, and earning the admiration of many. By 1912, they were recognized as a breed in the United States, where they had also been exported to and made a lasting impression. Russian Blue cats are homebodies. They are not at all fond of new experiences and people. It is common for them to hide when strangers come to call, allegedly as a survival reflex from the distant ages when they were hunted for their luxuriously thick fur coats. They are also very fastidious and do not like anything except the most pristine cat box to do their business in. They are also well known for being friendly to their family group but having definite preferences towards an individual to whom they show special favor. A very intelligent member of the feline family, Russian Blues love to play fetch and are both inquisitive and dexterous enough to get into things. This is balanced, however, by their ability to grasp that they are not wanted on some surfaces, and they will refrain from violating those boundaries once they understand what they are. They are excellent cats when it comes to being left home alone, where they will simply sack out. They will quietly wait for everyone to come home rather than tearing things up out of sheer boredom or manic worry over being abandoned. Boundaries are a two-way street to a Russian Blue. They will not do things you do not want them to do, but the things you do for them are expected to be done in a timely and routine manner. If dinner is late, they will let you hear about it. They love to talk and will communicate their needs and desires to you. Russian Blues are also noted for the permanent smile inherent in the way in which their jawline is drawn. Although not a personality trait, it matches their affectionate and loving disposition toward those they are familiar with. Thanks to their thick fur, Russian Blues appear larger and beefier than they actually are. They are svelte, medium-sized males weighing around 10-12 pounds and females at 7-10 pounds. A Russian Blue can be had as a rescue cat for a very affordable price, but the breed’s rarity can reduce the number of them available for adoption. With regard to the price of a purebred kitten, the neutered pet price can start at around $400, while the price of a pedigreed kitten can start at around $800. The most notable feature of this breed’s exceptional adult cat is its eyes’ incredibly green color, which is more of a shamrock green than a cat’s eye green. For those kittens likely to produce this particular trait, the price can go up to $2500 and beyond. Russian Blue kittens exhibit several distinctive features that set them off from their parents and other breeds. Adult Russian Blues are a short-haired breed that has no striping of any sort on it. Yet their kittens may sometimes have some dark striping on their coats which fades away as they age. The kitten has very distinctive yellow eyes, which is an easy way to distinguish this breed from other similarly-colored cats. As they grow older, they acquire a green rim around the yellow center. This eventually bleeds over until the entire eye is green. Due to their very cautious nature and their excellent health, this is an extremely long-lived cat . The normal longevity range is up in the 15-20 year range. Even 25 years is not particularly uncommon for a well-cared-for member of the breed. The Russian Blue is a cat with a solid color coat. This ranges anywhere from a darker grey to a more desirable light grey or silver color. Although a short-haired breed, the coat of a Russian Blue is of exceptionally fine quality and thickness. It is a hallmark of the breed that one can trace patterns in their fur which will remain until taken away by grooming it back out again. There are no other colors than grey or silver for the cat. It may show some tabby-style ghost markings as a kitten but these will fade away in adulthood, leaving a coat with no stripes visible at all.",
        "score": 0.6961426
    },
    {
        "Name": "Ferruginous Hawk",
        "Genus": "Buteo",
        "Diet": "Carnivore that eats rodents, rabbits, hares, gophers, reptiles, amphibians, small birds, and insects",
        "Features": "Rust-colored plumage",
        "Fun_Fact": "The ferruginous hawk comes in both light and dark morphs",
        "Text": "The ferruginous hawk is among the top predators, soaring majestically with its wings outstretched over the open plains of western North America. The name of the hawk is derived from the Latin word ferrum for iron. This refers to the rusted iron color of the hawk’s feathers. Their unique color pattern, their large size, and their feathered legs help to identify them. The ferruginous hawk can be found in a large, unbroken stretch of territory between southwestern Canada , the western United States , and northern Mexico . It prefers to hunt near open plains such as dry prairies, sagebrush, and deserts, where it can easily get the drop on unsuspecting prey. The ferruginous hawk prefers to take up residence in the tall heights of trees, cliffs, dirt piles, and even manmade structures like power poles and windmills. The nest is built out of sticks and other random materials like wires and plastic. The scientific name of the ferruginous hawk is Buteo regalis . This is a Latin term that roughly means royal buzzard or hawk. It is closely related to the red-tailed hawk and the rough-legged hawk, among many other species. The ferruginous hawk is the largest of all North American hawks. With its large body, big head, and broad wings, it’s sometimes even mistaken for an eagle . This species has a height of about 22 to 27 inches and a weight of up to 4.5 pounds. The female is generally larger than the male, but their plumage pattern is almost completely identical. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . This species comes in two different variations: light and dark morphs. The light morph has a pale grey head, a white breast with reddish-brown markings, and rust-colored wings with black fringes. The dark morph, by contrast, has a greater prevalence of dark brown and black colors covering the head and wings. One potential way to identify this species is by the presence of feathers on the legs. The only other “booted” hawk in North America is the rough-legged hawk. Like most birds of prey, the ferruginous hawk is not a social species. Instead, it will form close pair bonds for most of its life in order to share many responsibilities with its partners. Together they will construct and maintain the nest and raise the young. While this hawk usually prefers to hunt prey alone, it is sometimes seen engaging in cooperative hunting with its mate. Its vocalizations mostly consist of a sharp, piercing alarm call that almost sounds like a gull. The call resembles a kree or a kaah noise. The ferruginous hawk migrates south for the winter between the United States, Canada, and Mexico. The middle part of their range consists of states like Colorado, New Mexico, and Arizona, where they stay all year-round. To the north of this lies their main breeding range. To the south is their main wintering range. As a carnivorous species, the ferruginous hawk has many different strategies and angles of attack. Flight obviously gives it the perfect vantage point to swoop down and capture prey, but it will also hunt from a perch or pursue prey on the ground. This hawk will sometimes even lie in wait for its prey to emerge from its burrow or hole. The excellent eyesight (one of the best in the animal kingdom) allows them to identify even small prey from long distances in the air. Once they’ve caught their prey, the hawk will either swallow it whole or tear it apart with the beak. The ferruginous hawk consumes mice , squirrels , rabbits , hares , gophers , reptiles , amphibians , small birds , and even insects . The ferruginous hawk is currently classified as a species of least concern by the IUCN Red List. The greatest threat is probably the disturbance of their nesting sites from agriculture and overgrazing of the land. This forces them to compete even harder with other birds of prey for territory and resources. Despite being protected by law, they are also sometimes hunted indiscriminately. While a adult ferruginous hawk has very few natural predators, the golden eagle will sometimes kill the hawk in territorial disputes or prey on it for food. Bobcats and coyotes are also a problem, particularly for juveniles. These birds engage in fanciful courtship flights to attract a mate. As they arch back their wings and clasp their talons together, they perform a kind of aerial cartwheel with each other to create a bond. Once the hawk has found a suitable partner, it will tend to mate for the rest of its life. This lifelong monogamous mating strategy has a few advantages. It allows them to invest enormous time and share all the responsibility of raising the young. Copulation usually occurs once the nest is finally constructed, but the timing is highly dependent on the amount of food available. If resources are scarce, then a couple may not choose to nest at all. Once they’ve copulated, the female can produce up to eight eggs at a time. After a month-long incubation period, the juveniles emerge with a fluffy down, relatively helpless and undeveloped, and make chirping calls. The parents will need to sit on them for the first week to help them maintain a proper body temperature. By around five or six weeks, the juvenile chicks have fully-fledged and are ready to begin flying for the first time. After two months, most of them have learned how to hunt on their own and must leave the nest. After two years, ferruginous hawks are ready to begin breeding on their own. They can live up to 20 years in the wild, but most seem to die within the first five years. It’s not quite known how many of these birds exist in the wild, but they probably number in the tens of thousands. This is actually a marked increase from the low of the 1970s and 1980s. Numbers currently appear to be stable or even increasing. However, some local populations may still be in decline and require special conservation efforts to save them.",
        "score": 0.6947193
    },
    {
        "Name": "King Eider",
        "Genus": "Somateria",
        "Diet": "Omnivore that eats mollusks, insects, sea urchins, starfish, algae",
        "Behavior": "They can be characterized as social.",
        "Features": "Bulging orange forehead",
        "Fun_Fact": "The species name, spectabilis, is Latin for “showy” or “remarkable,” referencing the attractiveness of the adult male’s plumage.",
        "Text": "The king eider ( Somateria spectabilis) is a large sea duck inhabiting Arctic tundra habitats over three continents. These ducks are highly social and vocal birds who spend their days diving underwater for mollusks and other marine creatures. Due to their preferred environment, this species faces several threats, including oil spills and shifting habitats. Find out everything there is to know about the king eider, including where it lives, what it eats, and how it behaves. King eiders live in North America, Europe, and Asia in over 25 countries, including Canada, Greenland, Russia, Norway, and the United States. They breed in Arctic tundra habitats in Canada, Alaska, Greenland, and Russia and winter in Sub-Arctic marine areas near the Bering Sea, Norway, Scotland, and Eastern Canada. In the United States, you can find them in winter along the Northeastern coast, as far north as Maine and as south as Virginia. Their nesting site is on raised, dry ground near a water source. The nest itself consists of a shallow depression in the earth, which females line with down and plant material. The king eider (Somateria spectabilis) belongs to the Anseriformes orders in the Anatidae family, which includes ducks, geese, and swans . The Somateria genus encompasses the eiders, large sea ducks that breed in colder regions of the northern hemisphere. The genus name is Greek for “wooly body” and refers to its famous thick, soft down. The specific name, spectabilis, is Latin for “showy” or “remarkable,” referencing the attractiveness of the adult male’s plumage. The king eider is monotypic, meaning there are no recognized subspecies. The king eider is a large sea duck, measuring 20 to 28 inches and weighing 3.4 to 3.6 pounds, with a 34- to 40-inch wingspan. They have stocky builds with short, thick necks and short, heavy bills. Males have a large plate above their bill, creating a bulge in their forehead. Females have a slight slope. Adult males have a light bluish-grey head, pale green cheeks, primarily black bodies, orange forehead plates outlined in black, and red bills. Females are rusty brown with intricate black patterns and black bills. Juvenile males are dark brown with white chests and orange bills. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . This species is highly social, breeding with multiple partners and traveling and foraging with large flocks. However, breeding males are more solitary as they defend their nesting areas. Like other ducks, king eiders are relatively vocal birds. Their alarm calls sound like low quacks, and they give dove-like calls when courting. Their other vocalizations include grunting, croaking, growling, and murmuring. These birds are strong fliers, reaching speeds up to 40 mph! King eiders are short to medium-distance migrants. They breed on the Arctic coast of Alaska, Canada, Greenland, and Russia. And they spend their winters in sub-arctic marine areas like the Bering Sea, Scotland, Norway, Eastern Canada, and the Northeastern United States. King eiders are omnivores who eat marine animals and aquatic plants, spending much of their time diving for food at sea. Their diet changes seasonally, but they primarily eat mollusks. They also consume crustaceans, insects, sea urchins, starfish, algae, sea snails, mussels, scallops, clams, spider crabs, and many other species. King eiders also eat invasive species like zebra mussels in the Great Lakes. They forage for food at sea by diving underwater, more than 150 feet below the surface. They may feed alone or in large flocks, all diving simultaneously. The IUCN lists the king eider as LC or “least concern.” Due to its extensive range and substantial population, this species does not meet the “threatened” status thresholds. However, they still face several hazards. Their biggest threats include hunting, oil spills, and habitat shifting from climate change. Most waterfowl mortality occurs within the first two weeks of life when their young are susceptible to weather conditions, predation, and food availability. King eider predators include Arctic foxes, minks, ravens, gulls, and skuas. Female king eiders use their mottled brown coloring to blend in with their environments and camouflage their eggs. Males and females may also perform threat displays toward their species or other birds. King eiders form seasonal pair bonds before the spring migration to the breeding grounds. Their courtship displays include soft calls, preening, wing flapping, and posturing. Males may mate with multiple females. Females lay an average of four to five olive-colored eggs and incubate them alone for 22 to 24 days. The young fledge the nest shortly after hatching, but their mother tends to them, along with other females and their broods. King eiders become sexually mature around two to three years and live an average of nine years. However, they can live up to 24 years. The global king eider population is estimated to number 800,000 to 900,000 mature individuals. Their overall population trend is decreasing, but not at a rapid enough rate to threaten their species. North America has seen a slight, insignificant increase in its numbers over the last 40 years.",
        "score": 0.69370914
    },
    {
        "Name": "Anole Lizard",
        "Genus": "Anolis",
        "Diet": "Omnivore that eats insects",
        "Features": "On most species, the brightly colored dewlap on the neck of the males",
        "Fun_Fact": "There are just under 400 species, several of which change color.",
        "Text": "The name Anole Lizard refers to one of over 400 species of mostly color-changing lizards located primarily in South and Central America. One of the most charming residents of the North American garden is the little green anole lizard. Curious and occasionally friendly, these bright green reptiles can be seen darting across deck rails and rearing their heads above flower pots. They hunt for moths among begonias and take flies for a snack with lightning-quick precision. There is a single species, the Green Anole, Anolis carolinensis , native to North America , which is sometimes called the American Chameleon. Though many anole lizards can exhibit color adaptations to their environment, the anole lizard differs from true Chameleons in many ways, not least in their very limited ability for color change. In most species, the male and female differ, most commonly because the males have a brightly colored dewlap on the necks, but males and females may also be characterized by size and sometimes nose length. Another species, the Brown Anole ( A. sagrei ), can be found in parts of the United States , but is considered an invasive species and has a negative effect on local ecosystems. A few other species, including the Knight Anole ( A. equestris ) are also found in Florida but are introduced species and not native to the area. Anoles come from the family Dactyloidae under the Class Reptilia. Because there are over 400 species, it would be impossible to list all their scientific names here. Collectively, they are called Anolis. Some of the subspecies are: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The size and color of each anole lizard species will differ depending on habitat, climate, and diet. Depending on where they live and how they hunt, they may have physical adaptations such as large hind legs for jumping large distances for prey, or short stubby legs if they live higher up in trees and creep up slowly on prey to avoid detection by their predators when hunting. They come in many colors, though the most common colors are a range of greens and browns, with yellow and sometimes blue variations. Most male anole lizards have a dewlap, which is a piece of erectile tissue on the neck, which can be collapsed and extended into a semi-oval shape. The dewlaps of the male can be almost any color, and usually, the color differs greatly from the lizard’s body. Anoles are mostly solitary. They may live near each other but are not generally found in groups. Males aggressively defend their territory during sexual maturity, otherwise, they are typically docile and tolerate humans to varying degrees. Various behavioral adaptations occur depending on the environment in which they live. Ancestors of the green anole lizard hail from Cuba, and long ago spread across the southeastern United States. These little green lizards are now sold in pet stores and have recently become the subjects of several evolutionary scientific studies. The evolution of animal species is often portrayed as a process that takes place over thousands of years – and that is often the case. But sometimes, as they say, needs must. The North American green anole offers an example of evolution at warp speed. It was a case of evolve or die. The green anole lizard is the only anole species native to the United States, and for most of their history, they have lived on or around the base of trees where insects abound. Someone brought brown anoles into the country in the 1950s, and those highly invasive lizards quickly began to drive the green anoles from the forest floor to higher branches. Rather than die out, the green anoles forged a new life in the trees and on higher ground. They became expert climbers and found new places to hunt. Amazingly, over a span of a mere 20 generations and 15 years, the green anoles evolved larger toe pads covered with more sticky scales to make climbing easier. According to scientists, this is a perfect example of “character displacement,” an evolutionary process that allows two closely related species to diverge and take advantage of separate niches. Other studies have proven that the resilient little lizards have evolved to tolerate colder temperatures after surviving extreme cold snaps in some states – while city anoles evolved stickier feet to make climbing up buildings easier. As a species, green anoles have learned to go with the flow to survive. Most anole lizard species live in or near trees, though some live near the base and some prefer the smaller limbs near the top. Their hunting styles will differ depending on their locations. Anole lizards may be found in bushes, reeds, low limbs, tree trunks, and forest canopies. They are found in many ecosystems, including on farms, in residential yards, in rainforests, dry forests, arid scrub, grasslands, and in riverside vegetation. Almost all anoles are insectivores, though some will also consume some vegetation and nectar. Anoles are hunters who feed primarily on insects , spiders, and other invertebrates , but may also consume nectar, tree sap, and occasionally rotted fruit. Larger species may consume smaller or baby lizards, snakes , and eggs. One threat to anoles is other anoles. For instance, when they share a habitat, Brown Anoles will eat Green Anoles and their eggs. They are also prey for larger reptiles and snakes, as well as many predatory birds and a few small mammals . Their color-changing abilities afford them some protection from predators, but they are vulnerable during mating when they increase their movements and show off brighter colors. Typically, when males reach sexual maturity, they will hunt for a mate by flexing their dewlap and sometimes doing what looks like push-ups. These pushups are also used as a show of strength to discourage other males from entering the mating territory. Both males and females are polyamorous, mating with multiple partners over their lifespans. Male anoles defend a singular territory so that they can have exclusive access to females that enter into or live within that territory. However, the females wander outside the territories and mate with other males also. When a mate is found, the female will lay one or two eggs after copulation, often every day through the mating season. A baby will hatch at about 0.75 inches in size. A baby anole will reach sexual maturity at about 18 months and have a lifespan of two (wild) to seven years (captive). Populations vary widely between species with Green Anoles being estimated at around 100,000 specimens or more and the Blue Anole so rare that it may be headed for extinction.",
        "score": 0.69351596
    },
    {
        "Name": "Golden Masked Owl",
        "Genus": "Tyto",
        "Diet": "Carnivore that eats rodents, insects, birds, rabbits",
        "Features": "Heart-shaped, bright white face",
        "Fun_Fact": "While flying high above this owl can hear a mouse moving in the tall grass of field!",
        "Text": "“Golden masked owls have long legs and strong talons allowing them to scoop up rodents from the ground” The golden masked owl is known for its whitish/yellow heart-shaped face and large dark eyes. This owl is a carnivore eating small rodents, birds, insects, rabbits, and sometimes other owls. The feathers on its wings are designed for moving silently through the air. These birds live in the tropical climate of the island New Britain, Papua New Guinea. • This owl lives an average of 4 years in the wild • It has 2 to 3 eggs per clutch • This owl doesn’t hoot, it screeches • It is a solitary bird • It starts hunting for prey at dusk This owl’s scientific name is Tyto aurantia. The word Tyto is Greek meaning owl and the word aurantia is Latin for orange or tawny. This refers to the orangish feathers of the golden masked owl. This bird is also called a Bismarck masked owl, a New Britain barn owl , or a New Britain masked owl. It belongs to the Tytonidae family and is in the Aves class. There are more than 16 species of owl in the Tytonidae family. Other owls in the Tytonidae family include the Australian masked owl, the Tasmanian masked owl, and the Sulawesi masked owl. Golden masked owls are members of the genus Tyto. Which makes them related to barn owls, grass owls, other masked owls, and sooty owls. The genus contains 17 such species including: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Fossil evidence of the ancestors of this breed can be found dating from the Miocene, the Pliocene, and the Pleistocene. Regions discoveries have been made in include Central Europe, China, Cuba, and Italy. The Tyto robusta dating back to the Late Miocene or Early Pliocene, 5.5 million years ago in Italy is one such example. This ancient species of barn owl has been found to have a skeleton which is about 60% larger than those of its modern descendant. The Tyto gigantea was also found during the same period in the same location as Tyto robusta, i.e., in modern-day Garagano, a region which juts into the Adriatic from Italy’s eastern coast. It is believed to have been the same size as the Eurasian eagle-owl, if not larger. This owl has orangish/brown feathers on its back and on the top of its head. Its face is heart-shaped with yellow and white feathers. The bill of this owl is flat, it has long legs and powerful talons. There are white feathers running down its chest. The two dark eyes on its heart-shaped face are constantly searching its surroundings. This owl has no ear tufts on its head like other owls such as the Great Horned owl . A golden masked owl has ears hidden on the sides of its head. One ear is higher on its head than the other. Its left ear is able to hear sounds occurring on the ground below it while its right ear hears sounds in the air. This makes it easy to keep track of the sounds happening all around! An adult golden masked owl can be from 10.6 to 12.9 inches tall. A 10-inch-tall golden masked owl is the same height as 2/3 of a bowling pin. Fully grown this owl weighs from 0.9 to 1.7 pounds. As an example, an owl that weighs 1 pound is equal to the weight of two hamsters from the pet shop. Normally, female golden masked owls are larger than males. The masked owl is the largest of the owls in the Tyto genus. The coloration of a golden masked owl’s feathers blends in with the branches in its forest habitat. This is one of its main defenses against predators. Plus, the design of the feathers on its wings allows it to fly silently. Its wings have serrated edges or edges that look like the teeth of a comb. This design breaks up the air flowing over its wings and creates silent flight. As a bonus, this little owl can fly at speeds up to 20mph! Normally, the New Britain barn owl is a solitary animal, but it sometimes pairs with another owl. During breeding season, owls may gather in a group of seven or more. This group is called a parliament. They are shy creatures that like to stay hidden in their habitat. It’s a myth that owls can turn their heads all the way around. All the way around would be 360 degrees. Owls, including the golden masked owl, have extra vertebrae in their neck allowing them to turn their head 270 degrees. An owl’s eyes are fixed in place, so the ability to turn their head 270 degrees helps them take in their surroundings. This owl lives on the island of New Britain, Papua New Guinea. This is an island near the continent of Australia. These owls live in a tropical climate in lowland and coniferous forests. This owl lives near the equator and doesn’t migrate. What do golden masked owls eat? This bird is a carnivore. Its diet mostly consists of rodents . But it also eats birds , insects , rabbits , amphibians , bandicoots , and smaller owls. This owl may eat as many as four small rodents per night. Like most owls, the golden masked owl has excellent hearing. It can hear the rustle of a small rodent in a field or on the forest floor. Its wings are silent when it flies allowing it to sneak up on its prey to capture it. Eagles , hawks, and other owls are all predators of these owls. Many of these predators are bigger and stronger than this owl making it vulnerable to attacks. Loss of habitat due to deforestation is another threat to this owl. These owls make their nests in hollow trees. The conservation status of this owl is: Vulnerable . Its population is thought to be decreasing. This is unfortunate because the golden masked owl plays an important part in the ecosystem. It helps to control the rodent population and serves as food for bigger birds. The breeding season of this owl lasts throughout the year. These owls stay with the same mate year after year. In other words, they are monogamous. The pair make a nest on soft mulch inside a hollow tree. Making a nest in a hollow tree helps to provide protection for the young. The female lays 2 to 3 eggs and sits on them while the male goes out to hunt for food to feed the female. The gestation period is 32 days. Baby owls are called owlets or nestlings. Owlets weigh a little less than one ounce. They are born blind and without feathers, but quickly begin to grow a fine, pure white layer of down. Their eyes open at around 10 days old. As they grow, their feathers start to take on the orange/tawny, white and yellow coloration of adult golden masked owls. Their mother brings them small rodents and other prey that she breaks into pieces for her owlets to swallow. After these owlets have all of their feathers, they continue to be fed by their mother and father owl for about a month longer. Then, they are pushed out of the nest to live independently. They are with their parents for about 80 days in total. These owls have an average lifespan of 4 years. They are vulnerable to Psittacosis, a common respiratory illness. There are an estimated 2,500 to 9,999 individual golden masked owls in Papua New Guinea. These owls stay in hiding making it challenging to determine an exact population number. Their conservation status is Vulnerable, and this owl’s population is thought to be decreasing.",
        "score": 0.692809
    },
    {
        "Name": "Cinnamon Ferret",
        "Genus": "Mustela",
        "Diet": "Carnivore that eats mice, small rabbits, birds’ eggs",
        "Behavior": "They can be characterized as social.",
        "Features": "Long, slender body",
        "Fun_Fact": "A ferret’s heartrate is 200 to 250 beats a minute.",
        "Text": "“The average heart rate of a cinnamon ferret is 225 beats a minute” A cinnamon ferret gets its name from the brownish/red colors of its fur. Despite being popular as pets, the cinnamon ferret is a rare find in a pet shop. These slender mammals grow to a length of 12 to 16 inches. They have a lifespan of 7 to 10 years. See all of our expert product reviews . Mustela furo is the scientific name of domesticated ferrets. The cinnamon ferret is one of several domesticated ferrets named for the colors of its coat. Mustela is a Latin word meaning mouse and the word furo translates to a thief. Mouse thief refers to this animal’s habit of hunting small rodents . This pet ferret belongs to the Mustelidae family and the class Mammalia. Other domesticated ferrets known by their colors include: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . This pet ferret has a fur coat with a combination of colors including reddish/brown and white or cream. It has a small pink nose, whiskers, rounded ears, and brown eyes. They are well-known for their long, fluffy tails. These ferrets weigh two to five pounds. However, the heaviest type of ferret is the bulldog ferret at up to four pounds. Cinnamon ferrets measure twelve to sixteen inches in size. Picture seven and a half golf tees lined up end to end on the ground and you’re looking at the length of a sixteen-inch cinnamon ferret. See all of our expert product reviews . A cinnamon panda ferret has fur colors very similar to the cinnamon ferret, but with dark circles around its eyes and more white fur on its head. A champagne ferret also shares some color similarities with a cinnamon ferret. A champagne ferret has a combination of light brown and cream-colored fur. In fact, some ferret enthusiasts believe the cinnamon ferret is really just a champagne ferret with a few color variations. However, take a close look and you’ll find the fur of a cinnamon ferret definitely has a reddish tone. This is a subtle difference, but helpful in proper identification. Weasels look a lot like ferrets and belong to the same family. But there are differences between these two mammals that make identification easy. For one, weasels are much smaller in size. Weasels can be six to eight and a half inches long and weigh around seven ounces. Also, weasels have longer tails than ferrets. Ferrets are fast and can wiggle into narrow spaces. These are two solid defenses it has against owls , coyotes , and other predators in the wild. They also have sharp teeth to defend themselves. Cinnamon ferrets are social animals. A large group of ferrets is called a business. Anyone interested in a pet ferret may want to consider buying a pair of them or even more than two. One ferret can get lonely even if it gets a lot of attention from its owner. It’s best to have a male ferret neutered before putting it into an enclosure with a female. This prevents the addition of baby ferrets! Cinnamon ferrets are playful and social with people as well as other ferrets. While they are usually friendly, even a cute ferret can become aggressive when threatened by the family dog or cat. They have sharp teeth that can injure other pets in a household. Also, keep in mind wild ferrets hunt mice and other small rodents. This is a natural instinct for a pet ferret as well. So, it’s best to keep gerbils and other small pets away from a pet ferret. Though they are not nocturnal, cinnamon ferrets are active in the evening and early morning. This means they are diurnal animals. Ferrets monitor their surroundings in the semi-dark using their excellent peripheral vision. Peripheral vision is essential in helping wild ferrets stay alert to predators in their habitat. Domesticated ferrets like the cinnamon ferret are commonly kept as pets in the United States . Wild ferrets like the black-footed ferret live in a semi-arid climate in the western central section of North America . Their range stretches from Canada into the U.S. Wild ferrets live in a grassland, plains, or scrubland habitat. They don’t migrate. Wild ferrets live in underground tunnels, so don’t be surprised if you see your pet ferret digging and burrowing. Anyone with a pet ferret or two should certainly supply them with toy tunnels and plenty of bedding to dig in and throw around. All ferrets are carnivores. They have a short digestive tract and need to eat several times a day to stay healthy. A pet ferret eats food containing animal protein and fat. Some pet owners feed them a diet featuring lean meats and eggs. Fortunately, there are quality foods designed to fulfill the nutritional needs of pet ferrets. These are available at pet shops and online. Wild ferrets capture mice , rabbits , and other rodents . They also have bird eggs in their diet. Wild ferrets are very fast and strong so capturing a rabbit or mouse is not a big challenge. Well, if someone is caring for a pet cinnamon ferret hopefully this never becomes a concern! However, it’s a good idea to keep a pet ferret away from large dogs or cats that may mistake it for prey. Some of the predators of wild ferrets include coyotes, hawks , and owls. These animals are all active at about the same time as wild ferrets, making them vulnerable to attack. While pet ferrets are common in the United States, the black-footed ferret is listed as Endangered with a decreasing population. This is linked to a decreasing population of prairie dogs . Prairie dogs are part of the diet of wild ferrets. Unfortunately, these prairie dogs are routinely killed as pests by farmers. So, a decrease in prairie dogs has led to a falling population of black-footed ferrets. The mating season of ferrets happens from March to August. Female ferrets have an average of two litters each year. After mating, the male leaves the care of the young to the female. The gestation period for this mammal is 42 days. The female gives live birth to three to seven babies. One of the most intriguing facts about this animal is its babies are born without hair as well as blind, and deaf. They nurse for at least the first three weeks of life. At four to five weeks old, the ferret babies also called kits , open their eyes and ears. They are on their way to having a full coat of fur like an adult ferret. Kits are weaned somewhere between three and six weeks of age. They are able to live independently at six weeks old. A young ferret in the wild eats mice, rabbits, moles , and other small rodents. Alternatively, a pet like a cinnamon ferret can eat commercial ferret food that contains all of the vitamins, calcium, and other nutrients it needs to stay healthy. Like other pet ferrets, cinnamon ferrets are prone to various dental diseases as well as ferret lymphoma, a form of cancer. They can also develop blockages in their digestive system. Fortunately, there are small animal veterinarians who are knowledgeable about ferrets and their health issues. Cinnamon ferrets have a lifespan of seven to ten years. These ferrets are rare, and their exact population is unknown. If you walk into a local pet shop in search of a cute ferret with cinnamon fur, you probably won’t find one. A ferret breeder is more likely to have cinnamon ferrets available. Keep in mind cinnamon ferrets are usually sold at a higher cost simply because they are so rare.",
        "score": 0.6902051
    },
    {
        "Name": "Arctic Hare",
        "Genus": "Lepus",
        "Diet": "Herbivore that enjoys grass and especially likes willow, flowers",
        "Text": "Arctic hares can run up to 40 miles per hour! The arctic hare is the largest of all North American hares. It has long claws on all four feet, but these on its hind legs are especially long, to allow it to dig into packed ice and snow when it runs and to make a hole for shelter. It is also capable of hopping on its rear legs the way a kangaroo does, moving at speeds of as much as 30 miles per hour (48.3 km/h) as it hops. When running with all four feet on the ground they can reach 40 miles per hour (64.4 km/h). Brown or blue-gray in the summer, arctic hares turn white in the winter to help camouflage them in the snow. In the northernmost parts of their range, they are white all year. You can check out more incredible facts about Arctic hares . See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The scientific name for the arctic hare is Lepus arcticus . The word “ Lepus ” comes from the Latin word for hare, while “ arcticus ” refers to the natural habitat of these hares, the arctic. It is also sometimes called the “polar rabbit.” The arctic hare family contains four subspecies: There isn’t a lot of information regarding how arctic hares evolved, however, it is speculated that they traveled to North America and the Canadian region sometime when the ice sheet expanded during a glacial period on Earth millions of years ago. However, the arctic hare was historically important to Native Americans who hunted them for food and for their fur to make clothing. This type of hunting continues today. There may also be a close relation to the European Hare which is found in Asia and Europe. Science believes at one point in time, the arctic hare and the Euripian Hare may have been the same species. Arctic hares, along with other members of the hare family, are often confused with rabbits , but the two species, while related, are different animals. Hares typically have longer ears and longer hind feet than rabbits. The tail of a hare is longer as well. In the case of the arctic hare, its ears are actually shorter than other types of hares, which helps it to conserve heat in the cold climate in which it lives. In much of its range, the arctic hare is brownish-gray or bluish, but its upper coat turns white as winter approaches, though the fur on its belly remains slightly darker. This change helps to hide it from predators during different seasons. Arctic hares living in the far north are usually white all year since their environment is most often snowy. The very tips of their ears are always black. An arctic hare is about 17 to 25 inches (43 to 70 cm) long and weighs between 6.5 and 11 pounds (3 to 5 kg). This is about the same size as a cat. A large arctic hare, however, can get quite a bit bigger and weigh as much as 17 pounds (7 kg), about the same size as a small dog such as the Lhasa Apso or miniature schnauzer. The average arctic hare stands about as high as an adult human’s knees, though its ears will usually reach a bit higher than that. Though arctic hares are often solitary and live alone much of the time, they also will sometimes gather together in groups of anywhere from six to several hundred animals, huddling together for warmth in the harsh cold of the arctic winter. Such groups are referred to by several different names, including a down, band, husk, or warren. Hares are typically very shy, a necessary survival technique since they are hunted by many different predators. Though they will attempt to outrun a predator if necessary, they may choose to sit still so that predators won’t notice them. Arctic hares can also sit tall on their hind legs, scanning 360 degrees of their surroundings for predators, and hiding if they spot one. Arctic hares live in the very northern parts of the North American continent. They range across much of Northern Canada , Northern Greenland, the Canadian Arctic Islands, Newfoundland, and Labrador. They thrive in the treeless tundra found in these areas and are not deterred by the bitter cold found in these places for much of the year. Their bodies are made to withstand the low temperatures of the Arctic. These hares have short ears to help them to conserve heat. They also have thick fur, compact bodies, small noses, and a high percentage of body fat that aids them in surviving in very low temperatures. Arctic hares are considered omnivores, as their diet normally consists exclusively of plants but with other food sources mixed in from time to time. Their normal food includes moss, lichen, and woody plants of all sorts. Depending on the season, they will also consume berries, buds, roots, leaves, and bark. In addition to plants, arctic hares have been observed eating fish and the stomach contents of dead animals such as reindeer . Since the arctic tundra can be an extremely harsh environment, this dietary adaptation benefits the hare by promoting survival through opportunistic eating. With the longest and straightest incisors in the hare family, arctic hares are also able to grab plants growing in awkward locations, such as between rocks, allowing them to find food where other animals might starve. In winter they will also dig down into the snow to find food. The arctic hare is an important food item for almost every predator that exists in the northern part of the North American continent. Without them, many meat-eating animals could not survive. Some of the arctic hare’s predators include the arctic fox , the red fox, the gray wolf, the ermine, snowy owls, and the Canada lynx. Humans are also traditional predators of this animal. Many people who live in the Arctic hare’s territory depend on hunting them for food and for their fur, which people make into the clothing of various sorts. These hares are sometimes the only food available for Native Americans living in the far north. The harsh weather can also pose a threat to the arctic hare, as it can be difficult to survive the bitter cold winter weather. This is especially true if the hare’s food sources are buried under deep snow. Hares can huddle together for warmth, but if they can’t find food they will end up starving to death Arctic hares mate in April or May. Although these hares often band together in large groups for feeding and for warmth, during breeding season they separate from one another and set up individual territories. During this time the males, called bucks, may spar over females, known as does, with the male literally placing his paws over the female’s back and engaging in a sort of boxing match with other males as he claims his mate. Eventually, each animal has its own place, though it is not unusual for one male to have more than a single female to breed within his territory. At this point, each of the females establishes a nest, typically in a sheltered depression next to a rock or behind a bush. She will line this spot with a layer of grass and then add a covering of her own hair to make the nest soft and warm. The female gives birth to a single litter of two to eight babies once per year, generally anywhere from late in the month of May through July, though in the northernmost parts of the hare’s territory, the babies may be born a bit later. Unlike rabbit babies, which are born naked and blind, arctic hare babies are born with a complete fur coat and their eyes open. They can hop within a few minutes of being born. This helps them to escape predators from a very early age. The mother stays with her babies, called leverets, constantly for the first couple of days, but then the young are left to themselves more and more often as their mother ventures out in search of food. The leverets begin to leave the nest when they are about two to three weeks old, but they’ll return when it’s time to nurse. The babies become independent quickly, and by the time they are eight to nine weeks old, they are fully weaned and on their own. They are able to breed and have babies of their own the following summer. It’s uncertain as to how long arctic hares can live, as it’s never been accurately measured. They are thought to have a lifespan of about five years in the wild. They don’t do as well if they are raised in captivity, living only about eighteen months when kept by humans. Nobody knows why they don’t live as long in captivity, as such conditions often help animals by providing a plentiful food supply and a lack of predators, but it’s probable that the stress of being kept in artificial conditions shortens their natural lifespan. Arctic hares are not considered to be endangered and are listed as “ Least Concern ” (LC) by the International Union for Conservation of Nature (IUCN), an organization that tracks the population status of all animals. While there is no exact count regarding the numbers of arctic hares living in the wild, their population exists in large numbers across the North American arctic and seems to be stable. There is no reason to think that these animals are in danger of extinction at any time in the foreseeable future.",
        "score": 0.68931526
    },
    {
        "Name": "Tawny Frogmouth",
        "Genus": "Podargus",
        "Diet": "Carnivore that eats frogs, reptiles, small mammals, small birds, insects, spiders, worms , snails, scorpions, centipedes, millipedes, other invertebrates and especially likes nocturnal such as moths and beetles",
        "Behavior": "They usually live in pairs. Their temperament can be characterized as still.Their aggression level is low.",
        "Features": "Streaky gray feathers, excellent for camouflage",
        "Fun_Fact": "The tawny frogmouth is a master of camouflage that can hide in plain sight!",
        "Text": "The tawny frogmouth is a master of camouflage that can hide in plain sight! What superpower would you choose, silent flight or invisibility? Night vision or super hearing? The tawny frogmouth says, “All of the above, please!” This master of camouflage hides in plain sight during the day and hunts at night, gobbling up creatures that its human neighbors consider to be pests. It doesn’t fly around searching for a meal. Instead, it conserves energy, sitting and waiting on a branch until an unsuspecting morsel gets close. Then it pounces and grabs its prey in its powerful beak, or makes a quick and silent flight, catching it in midair. This stealthy bird might look like an owl, or a dead branch, but it is neither. It is, however, the “most instagrammable bird” in the world. Tawny frogmouths are found throughout most of Australia, including the island state of Tasmania. They live in just about every sort of habitat except for dry and treeless desert regions and dense rainforests. Scientists believe that Australian frogmouths diverged from other known genera at least 30 million years ago , meaning the modern frogmouth species have a long history on the continent. The tawny frogmouth lives in woodlands, primarily eucalyptus and acacia, in scrublands, heathlands, and savannas. It also lives in parks, gardens and other urban areas including backyards. It spends most of its time in trees, particularly mature trees with dead or rough branches. People are more likely to hear tawny frogmouths than see them. They call loudly at night with a low and almost continuous, “oom-oom-oom.” However, you could be very close to one of these stealthy birds in broad daylight and never see it. They are so cleverly camouflaged and able to sit so very still, they practically disappear. One look at the tawny frogmouth will tell you where it got part of its name. The wide, frog-like mouth is common to this and other frogmouth species. The scientific name of this bird is Podargus strigoides. Strigoides is derived from the Latin word for owl. That makes sense because this bird looks a lot like an owl. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Podargus, the name of the bird’s genus, means “gouty.” The frogmouths in this genus were so named because of their feet, which are much more adapted to sitting than walking. They walk with a painful-looking gait like someone suffering from a case of gout. That’s okay, though, because they don’t spend much time on the ground. There are three subspecies of tawny frogmouths. The subspecies P. s. phalaenoides lives primarily in northern Australia , P. s. brachypterus lives west of the Great Dividing Ridge, and P. s. strigoides lives east of the Great Dividing Ridge and in Tasmania. Sometimes the tawny frogmouth is mistakenly called a “mopoke,” the nickname for the Southern Boobook owl. Although they share some similarities, the frogmouth is not an owl. These birds vary in size and appearance based on the subspecies. The P.s. strigoides subspecies is the largest of the three. They can be anywhere between 13 and 21 inches in length and range from a little over 6 ounces to approximately 24 ounces in weight. Their wingspan averages between 2 and 3 feet. The feathers of these birds are mostly gray, with white streaks and light barring. Some females are a bit more chestnut or rufous colored. The best way to describe their coloration would be the appearance of old tree bark, because tawny frogmouths can blend in almost seamlessly with the limbs of mature trees. The birds have big, yellow eyes and wide curved beaks. The insides of their mouths are bright yellow, or yellow-green, and they present a gaping mouth display to frighten or distract other birds or predators. Their legs are short, and their feet are weak, especially as compared to the powerful talons of owls. These birds do resemble owls closely enough that many people get confused, but it bears repeating, they are not owls. They are members of the nightjar family and are closely related to nighthawks and whip-poor-wills. This bird is mainly nocturnal or crepuscular, meaning it is most active at night or in the twilight hours of dusk and dawn. It hunts at night using a sneaky sit and wait approach, waiting and watching for prey to come near, then pouncing down upon it or chasing it through the air. During the day, it spends much of its time sleeping, but usually with one or both eyes slightly open to watch out for predators. When it is awake during the day, the bird spends time with its mate, grooming each other, taking turns guarding their territory, or working together to raise their chicks. This silent sitting approach works well for the tawny frogmouth, thanks to its amazing camouflage. If the bird senses a threat, it takes stealth to another level. It stretches its body out, tightens its feathers and holds a pose, completely still, so that it looks just like a dead branch. Predators are often fooled, as evidenced by the bird’s long lifespan in the wild. In the winter, tawny frogmouths use a few techniques to survive the cold. They huddle together to conserve heat. They also position themselves on branches in direct sunlight to absorb as much heat as possible. On especially cold nights, when food is scarce, they enter a state of torpor for a period of a few hours between dusk and dawn. During torpor, they reduce their metabolism and temperature significantly to reduce their energy consumption before arising to hunt again, usually close to daybreak. The tawny frogmouth hunts mainly at night and in the twilight hours. Although people often mistake this nocturnal bird for an owl, its hunting style differs significantly. Instead of flying through the air and snatching prey with its feet, the tawny frogmouth uses its large beak exclusively for catching food. Sometimes it flies and catches nocturnal insects like moths in midair. Other times it sits and waits patiently in a tree until an unsuspecting creature comes close, and then it pounces down and grabs it with its beak. Humans appreciate this bird for eating large quantities of prey that are considered pests, especially the swarming Christmas beetles that strip eucalyptus trees. They eat all sorts of insects , including moths , cockroaches and beetles . They also devour spiders , centipedes , millipedes , scorpions , slugs , snails and other invertebrates. Tawny frogmouths are also known to eat small rodents , lizards , frogs and even other birds . These birds form monogamous pairs that live together for many years. When they are not hunting, they spend most of their time together, leaning against each other, roosting side by side and grooming one another. They stay together in the same territory for years. Both the males and females work together to build a nest of twigs and leaves about 3 to 10 meters above the ground. It is not a sturdy nest, but more of a loose pile of material in the fork of a tree. The nests often fall apart, and younger chicks in a brood are prone to falling to the ground. Pairs usually have only one brood per year, with one to three eggs. Breeding takes place in the Australian spring, usually from August through October. Both the male and female incubate the eggs, with the male sitting on the nest during the day. Incubation lasts about a month. Juveniles are lighter colored than their parents and easier to see, so the parents hide them underneath their own bodies to protect them from predators. Nest predation is still a constant threat, and although both parents feed and guard their young, nestling mortality is high. Fledglings leave the nest after about 27 to 32 days, but they stay close to their parents for some time before dispersing, usually during their first summer. They reach sexual maturity at about 12 months of age and begin the search for a mate of their own. Tawny frogmouths are susceptible to predators as adults and in the nest. The most dangerous time for an adult is when it flies to the ground to catch prey. Domestic cats are the bird’s primary predator, but dogs , foxes , falcons and pythons are also deadly foes. Pythons and other snakes also prey on juveniles and eggs in the nest. So do ravens , currawongs, and butcherbirds. The lace monitor lizard , a fearsome reptile more than six feet long, is also known to climb trees and attack tawny frogmouth nests. The tawny frogmouth’s main defense against predators is camouflage. If they can avoid detection by staying very still, or by hiding their nestlings under their own bodies, they will. Otherwise, they will use defensive displays, such as opening their mouths wide to flash the bright yellow insides, erecting spiky-looking feathers around their heads, and clacking loudly. They are also not above spraying foul-smelling feces to confuse reptilian predators. This bird lives as long as 14 years in the wild, and some individuals have survived more than 30 years in captivity. Although its population is undetermined, it is considered stable and the species is listed as least concern by the IUCN Red List. Besides predators, three factors are considered the greatest threats to tawny frogmouths. Pesticides are a particular danger, especially those used on rodents, because the poisons consumed by prey end up ingested by the predator, too. Fires are another threat affecting this bird, mainly because it is so staunchly territorial. Individuals stick to the same territory for many years, and they have a hard time picking up and relocating even when disaster strikes. Finally, cars are perhaps the greatest threat to the tawny frogmouth. When the urban dwelling birds hunt at night, chasing a moth or other prey, they often fly low across roads. Car strikes are common and end the lives of many birds. A 2021 research study on bird photography and social media found that the tawny frogmouth is the world’s “ most instagrammable bird .” This study referenced 20,000 photos of birds on the Instagram platform and compared their numbers of likes relative to their level of exposure. Just a few years earlier it had been dubbed “the world’s most unfortunate-looking bird.” Some people think the bird is irresistibly adorable, while others think it is just plain ugly. But love it or hate it, the tawny frogmouth is definitely something to see.",
        "score": 0.6886871
    },
    {
        "Name": "Coton De Tulear",
        "Genus": "Canis",
        "Diet": "Omnivore with no preference",
        "Origin": "Madagascar",
        "Fun_Fact": "The soft coat of the Coton de Tulear is the result of a singular genetic mutation early in the breed's development.",
        "Text": "The cottony soft texture of their coat is thought to be the result of a single genetic mutation during the early years of the breed’s development. If you are looking for a happy, charming dog , the Coton de Tulear may be the perfect choice for you. Small and sweet, this breed gets along well with children and other pets, is a people-pleaser, and does well with apartment living, as long as he gets some exercise each day. See all of our expert product reviews . Developing on the island of Madagascar , the Coton de Tulear was brought to America in 1973. Because of Madagascar’s history of piracy, it is thought that these dogs may have developed for companionship or to hunt rats aboard pirate ships. Regardless of how they developed, they have a long history of providing human companionship, and it shows in their agreeable, highly trainable nature. The breed is most often white, although they can have markings, such as white and gray, white and yellow, and they can even be tri-colored. Their long life span and loving personality make them wonderful companions. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Coton de Tulear is a rather rare breed that originated in Madagascar around the 16th century and was almost immediately considered a royal dog when they became the favorite pets of the tribal monarchy. Known as the Royal Dog of Madagascar and the official dog of Madagascar, they were popular among the wealthy and there are many legends and folklore associated with their history, especially with how they came to be on the island of Madagascar. They are thought to be descended from the Cotons from Reunion Island and it is said that the ancestor of the Coton de Tulear is the now-extinct Bichon Tenerife, which was possibly brought to the islands by sailors or even pirates. The Coton de Tulear’s winning personality makes it a popular choice for crossbreeding. Some of the more popular crosses include crossing with a Bichon Frise , with the resulting puppies known as Biton, with a Lhasa Apso for Lhasa-Coton, with a Maltese for Cotonese, and with Poodles for Poo-Ton puppies. The Coton de Tulear comes in three accepted colors – white, black and white and tri-color. See all of our expert product reviews . The Coton de Tulear is a small dog, but never frail. They are sturdy and athletic. His proportions should create a rectangle, a too-long back or too-short legs are considered faults. Females mature to a height between 9 and 10 inches, while males mature to between 10 and 11 inches. Females mature to between 8 and 13 pounds, while males mature to between 9 and 15 pounds. While the breed is generally hearty, there are a few health issues they are prone to. Skin allergies can lead to issues with their ears or bacterial infections of their skin. They may also develop issues with their eyes, such as progressive retinal atrophy , and joint issues such as hip dysplasia and luxating patella . It would be difficult to find a breed more loving and loyal than the Coton de Tulear. Their kind, gentle nature allows them to make fast friends with all family members , including children and other pets. They are eager to please, making training simple as long as you remain positive. Their kind personality doesn’t respond well to harsh, negative training. If you want others to enjoy your pup as much as you, socialize with your pup from an early age. Without this socialization, your pup may become shy and cautious around strangers. The breed’s forgiving nature and love for humans make them a great choice for adoption. Regardless of the previous situation, most pups will develop a strong bond with their new family with just a little time and patience. The Coton de Tulear is a low-maintenance pup as long as you commit to regular grooming. Their people-oriented temperament allows them to fit in easily with your household. Plan to feed your pup three meals a day until at least three months old. This helps keep blood sugar levels even and prevents hypoglycemia. Your veterinarian may recommend a low protein or low phosphorus diet for your dog to prevent his kidneys and liver from working too hard. Our recommendation at A-Z Animals for the best dog food for Coton de Tulear dogs is Merrick Classic Healthy Grains Small Breed Recipe Dry Dog Food. This turkey and chicken blend offers glucosamine and chondroitin to help sustain strong, healthy joints. Plus, there’s prebiotic fiber, probiotics, and amino acids such as omega-3 and omega-6 fatty acids. All this comes together to cultivate a robust immune system. That way, the occasional skin or ear infection won’t be a big deal. Follow this link to find Merrick Lil Plates Small Breed Dog Food on Chewy and Amazon. Plan on spending a few minutes each day brushing your pup. The Coton de Tulear doesn’t leave hair around the house, making them a great choice for those with allergies, however, loose hair gets trapped in the coat. Without frequent brushing, it is easy for the pup to mat up. The breed is easy to train as long as you show patience. Your pup will sense frustration, which will cause him to shut down and slow the learning process. In addition to regular obedience training, this breed is quick to learn tricks and relishes performing for its family. The breed enjoys activity but doesn’t require a huge amount of exercise like many larger breeds. Some time spent playing in the yard or on regular walks provides the activity he needs. He will be active in the house, eager to follow you from room to room, keeping you entertained. Coton de Tulears generally have between two and five puppies in their litters. The small litter size, as well as the small gene pool, drive up the price of the breed. You may find that puppies or young dogs are more affordable from a rescue. The Coton de Tulear gets along well with children and is always ready to play. Because the breed is small, it is important to teach your children how to play with the pup gently so he isn’t injured or scared. With care, your children and pup will become best friends. Dog breeds most similar to this breed are the Maltese , Havanese , Bichon Frise , and Bolognese . At first glance, the Coton de Tulear and Maltese may appear similar, but several features separate the two breeds. The Maltese are smaller, maturing to between seven and nine inches in height and less than seven pounds. While the Maltese have a coat that often reaches the ground, the Coton de Tulear’s coat, while long, is not long enough to reach the ground. While the Coton de Tulear is a member of the non-sporting family, the Maltese belong in the Toy family. While there aren’t any famous Coton de Tulears, the breed is loved by celebrities. Famous owners include Barbra Streisand, Jane Fonda, and the late Carrie Fisher. The most common color for this specific breed is white. This makes the following names most popular:",
        "score": 0.68815607
    },
    {
        "Name": "Vicuna",
        "Genus": "Lama",
        "Diet": "Herbivore with no preference",
        "Behavior": "They usually live in herds.",
        "Features": "The exceptionally long neck",
        "Fun_Fact": "Vicuñas have some of the softest wool in the entire animal kingdom",
        "Text": "“ The vicuña produces some of the finest wool in the world. “ A member of the camel family, the vicuña is perhaps lesser known than its close llama and alpaca relatives, but their fur has been used to make clothing for thousands of years. In the wild, this wool helps the animal survive in the frigid climates of the Andean Mountains. Following the fall of the Incan Empire, they were hunted unscrupulously for their fur and almost driven to extinction. Today they are protected by Peruvian laws from excessive hunting; only certain companies are allowed to make sweaters, scarves, suits, coats, and other clothing from their fur. This article will cover some interesting facts about the identification, size, habitat, and diet of the vicuña. Evidence brought forward through palaeontological studies originally proposed that the vicuña came from Hemiauchenia , which was a genus of laminoid camelids that evolved in North America about 10 million years ago, during the Miocene era. It was thought that they evolved as early as two million years ago although it is now believed that they most likely evolved from the guanaco at the beginning of the Holocene era, which was 11,650 years ago. The scientific name of the vicuña is Lama vicugna . Vicugna is simply another way of writing the Spanish word vicuña. This in turn was borrowed from the indigenous Quechua word wik’uña, which refers to the colors of the vicuña. As a member of the family Camelidae, they share a close relationship with wild guanacos, domesticated llamas and alpacas , and more distantly, other camels. The vicuña was previously part of the genus vicugna , and is only one of two wild South American camelids that live in high alpine areas of the Andes Mountains. The other is the Guanaco. There are two recognized subspecies of the vicuña in the wild that are currently accepted, due to their sizes being significantly different. Those are: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The vicuña is characterized by an exceptionally long neck, slender legs, big rabbit -like ears, and a stout body. The thick wool coat, which is longer around the neck to confer protection from the cold, comes in white and brown colors. White is found around the stomach and inner legs, whereas brown and tan colors exist around the back, neck, head, and outer legs. However, the coloration is much more limited compared with llamas and alpacas, which come in a much wider range. Measuring anywhere between three and six feet long, this animal is considered to be the smallest member of the entire camel family. It is about the same size as a small scooter. The identification between males and females can be a little tricky because they look so similar to each other, but the male does tend to be larger. As a highly social species, vicuñas generally form three different kinds of groups. Family groups, which consist of around five to 15 females and their offspring, are led by a single male who defends his territory from intruders. Juvenile males form small bachelor groups shortly after they become independent. They will remain in this group until they are old or strong enough to establish their own territory. Older males who are unable to maintain their own families tend to form the third group, the solitary herds. Vicuñas can communicate with each other through a series of vocalizations, the most important of which is the alarm call. While it’s true that any member of the herd can make an alarm call, it’s usually done by the dominant male, who tends to be on high alert throughout the day. When he makes the call, the rest of the herd will begin running away while the male brings up the rear. As very shy and skittish creatures, they are quick to flee from danger. Their long ears appear to grant them exceptional hearing to locate predators, while their eyes have a very wide field of view. As diurnal animals, they spend the majority of their day grazing for food throughout their territory and then sleep at night. They require a lot of space to move around in, sometimes as much as eight acres per animal. They mark the boundaries of their territory with large communal dung heaps. One of the other interesting facts is that they have the ability to spit just like llamas and alpacas. This might be done to clear the air passageways of obstructions. The vicuña is entirely native to the Andean region of South America . Their native range spans the semi-arid grasslands of Peru with smaller populations in Argentina , Chile , and Bolivia . They were later introduced to Ecuador as well. They live at exceptionally high altitudes up to nearly 16,000 feet. The local Andean people harvested the fur of the vicuña for many centuries without hunting and killing them (except to occasionally obtain their meat). After the fall of the Incan Empire, however, the Spanish colonists hunted the animal almost to the point of extinction. Today the species is protected by federal laws, and it generally has few threats in the wild besides its natural predators. Habitat loss is generally not a concern because it lives at a high elevation where few people reside. However, because of the cost of its fur, illegal poaching can still be a problem. The puma is considered to be the main predator of the vicuña. It is estimated to be responsible for more than 90% of all adult deaths and half of all calf deaths. They are also at risk of falling prey to Andean condors, Andean foxes , and domestic dogs . The vicuña’s first impulse is to run away and hide, but if it is feeling particularly bold, then it may stand its ground and charge. These animals mostly rely on the safety of the herd for protection. The diet of the vicuña consists of grasses and shrubs that grow along the ground. Their specially adapted multi-chamber stomach allows them to digest tough grassy material in order to extract as many nutrients as possible. Their diet appears to be supplemented with minerals from licking stones and rocks and drinking saltwater. There is some evidence to suggest that the vicuña can mate throughout the year, but their main reproductive season tends to occur between February and April. The male will mate with any females who live in his territory. He will also sometimes enter other territories and attempt to herd females back to his own. However, the males are very vigilant about defending their territory from any intruding rivals. Vicuñas will mate with the female lying on the ground and the male standing on top of her. After a gestation period lasting about 11 months, the female will give birth to a single baby at a time. Even though the mother will stay with her baby for the next six to 10 months, until it’s weaned from her milk, she will sometimes leave it alone to fend for itself, especially if the mother is suddenly startled. If they become separated, then the calf will make many loud calls to help the mother with identification. The mother and baby will remain within the male’s territory for safety while they graze for food, but the father provides little direct support. Instead, his main contribution is to defend the territory and provide a warning when a predator is near. Females will generally reach sexual maturity after about a year into their lifespan, but males may take up to three years to do the same. As mentioned previously, the males will leave for a bachelor group after a year, while the females will seek out a family herd. The normal lifespan of this species is anywhere between 15 and 20 years in the wild. Many of them will die in the first year of life from predators, starvation, and disease. The weight of the newborn seems to affect the survival rate after the first year. According to the IUCN Red List , the vicuña is considered to be a species of least concern . There are an estimated 350,000 mature individuals remaining in the wild (with an unknown number of calves and juveniles). Back in the middle of the 20th century, when there were perhaps only 6,000 individuals remaining, Peru created several reserves to protect them and then reintroduced them to regions where they had disappeared. Numbers are only considered to have recovered a moderate amount compared to the previous height, however.",
        "score": 0.6880324
    },
    {
        "Name": "Ocelot",
        "Genus": "Leopardus",
        "Diet": "Carnivore that eats rodents, lizards, deer",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Rosettes, spots and stripes on fur",
        "Fun_Fact": "Also known as the Painted Leopard!",
        "Text": "The Ocelot is a medium-sized small cat that is native to the jungles of South America. The Ocelot is also known as the Painted Leopard due to the beautifully distinctive markings on its fur as it displays dark rosettes, along with spots and stripes. Similar in coloration to the much smaller but closely related Margay, the Ocelot is an animal that was nearly driven to extinction in the 20th century as they were commonly hunted for their fur. Today, however, national protection throughout much of their natural range has meant that the Ocelot population has been able to recover somewhat. The Ocelot is a strong and agile animal that can not only climb and run well but they are also good swimmers as they are not afraid of water like numerous other cat species. The Ocelot is an animal with short and thick, velvety fur that is usually tawny-yellow to reddish-grey in color and marked with black chain-like rosettes on its back and sides. There are dark spots on their legs and stripes on their head and face which are distinctive to the individual. They have a long tail that is generally marked with dark rings and large paws in relation to their body size. Like all feline species (with the exception of Cheetahs) the Ocelot can retract its claws into protective pockets that prevent them from becoming blunt whilst the Ocelot is walking about. Males tend to be substantially larger than females and can grow up to a meter in length with a tail half their body size on top of that. The Ocelot has sharply pointed front teeth which are used for biting down on its prey and blade-like teeth in each cheek that are used for tearing up food. The Ocelot is found throughout the South American tropics but is most common in the dense jungles of the Amazon Basin. They are, however, fairly widespread and inhabit a variety of different habitats from southern Texas to northern Argentina. The Ocelot is an incredibly adaptable animal that can be found in a variety of habitats including tropical forests, grasslands, mangrove forests, and marshes providing that there is plenty of dense vegetation. Although the Ocelot is usually found below 1,200 meters above sea level, they are also known to inhabit the high slopes of the Andes Mountains and have been found at heights up to 3,800 meters. As strong swimmers, they are also sometimes found in seasonally flooded forests and have been reported as living close to Human settlements. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Ocelot is a solitary animal that occupies a home range that can be up to 30 square kilometers depending on the surrounding environment. Males tend to patrol territories that are often double the size of the females’, and that overlap the home ranges of a number of females (with which the male has breeding rights). The Ocelot is a nocturnal animal that spends its days sleeping either in thick vegetation or on a high and leafy branch. They have excellent sight, touch, and hearing which all help them when hunting at night, and they communicate with one another using soft meows which turn into loud yowls when looking for a mate. The Ocelot is an incredibly secretive animal that is very rare in some parts of its natural range and one that relies heavily on dense vegetation, only venturing into open areas during the night. You can check out incredible facts about ocelots . In the heart of the tropics, Ocelots are known to breed all year round but at the most northern and southern ends of its natural range, the breeding season tends to occur towards the end of the summer. After mating, the female Ocelot will find a crevice in the rocks, a hollow tree, or will nest in a dense and thorny thicket in order for her to have some privacy and protection whilst she is preparing to give birth. After about 85 days in the womb, the female Ocelot will give birth to up to 3 kittens, which are born without the ability to see and have a thin, dark coat of fur as opposed to their recognizable stripes and spots. Within about one month, the Ocelot kittens will be able to see their surroundings and their fur will have become thicker and more vibrant. Although Ocelot kittens are fully grown by the time they are a year old and are capable of becoming independent, they will often be tolerated in their mother’s home range for a couple of years before they leave to establish a territory of their own. The Ocelot is a carnivore, meaning they that hunt for food under the shade of night and they do so by stalking their prey primarily on the forest floor from the safety of dense foliage. Although small rodents make up a large portion of their diet, they are known to hunt a variety of small animals including rabbits, birds, fish, crabs, lizards and snakes, and will even hunt small deer on occasion. The Ocelot is also known to eat monkeys , turtles, armadillos, and anteaters. Ocelots have been known to cause problems by killing domestic birds when their typical food sources are unavailable. However, the Ocelot happily preys upon numerous different invasive species, so they are nevertheless a vital part of their local ecosystems and their diverse taste also helps them to more easily adapt to changing habitats. Not only is the Ocelot an important predator in its environment but they are also preyed upon by a number of large carnivores. Other felines including Jaguars and Pumas prey on the smaller Ocelot, along with Birds of Prey such as the Harpy Eagle and the world’s biggest snake, the Anaconda. The unique and distinctive fur of the Ocelot though actually provides it with some camouflage in the dense vegetation surrounding it but it is also this fur that has led to enormous population declines throughout much of its historical range. Hunted for their fur (known as pelts) particularly from the 1960s to the 1980s, the Ocelot nearly became extinct in the wild along with the fact that they were also captured and kept as exotic pets. Since the Ocelot became a protected species though in many countries, numbers have risen but they are now threatened by deforestation of their habitats. In a similar way to many other species of smaller wildcats, the Ocelot has been kept as a pet by many people throughout history. The most famous of these was the abstract artist Salvador Dali who was known to travel frequently with his domesticated Ocelot. It was even thought that Mr. Dali actually took his pet Ocelot on an ocean liner! The Ocelot is also thought to have been worshipped by ancient Peruvian cultures (in a similar way to the Ancient Egyptians worshipping cats), and these cultures would often depict the beautiful Ocelot in their artwork. The Ocelot is thought to be active for at least 12 hours a day and can travel distances of up to seven miles in that time, with males generally covering twice the distance of their female counterparts. The Ocelot was seen as a sacred animal by ancient cultures but its beautifully patterned and soft fur quickly attracted the attention of hunters. Ocelot population numbers were severely depleted throughout their natural range particularly during the 1960s and 1970s when they were thought to be so extensively hunted, that up to 200,000 skins were being traded each year and were selling for around 40,000 US dollars. Despite being wild and dominant predators, the Ocelot has also been captured to sell into the exotic pet trade which fortunately ceased after the Ocelot was listed on the Endangered Species List. Despite the fact that the Ocelot is now protected in most countries throughout its natural range and numbers have increased, populations particularly in certain areas are being severely affected by growing Human activity, primarily from deforestation and growing settlements. Today, the Ocelot is listed by the IUCN as being a species that is of Least Concern of becoming extinct in their natural environment in the near future. Although some populations are small and unstable, the Ocelot is widespread but the general population trend is now decreasing. This is mainly due to habitat loss as vast areas particularity in the Amazon, are subject to drastic deforestation and no longer provide the dense cover and adequate food supply that the Ocelot needs to survive. Taxonomists initially believed ocelots to be divided into up to 9 different subspecies. These included: But today only the Leopardus pardalis pardalis and Leopardus pardalis mitis are generally recognized as distinct subgroups of ocelots, the former being critically endangered and native to Arizona and Mexico, while the latter is much more populous and inhabits much of South America and some islands of the Caribbean.",
        "score": 0.68780386
    },
    {
        "Name": "Alaskan Klee Kai",
        "Genus": "Canis",
        "Diet": "Omnivore with no preference",
        "Origin": "Alaska",
        "Features": "Contrasting colored facial mask with a well-defined nose bar down the center of the muzzle, and goggles around the eyes",
        "Fun_Fact": "Alaskan Klee Kais love to communicate with their families. In addition to barking, they make other vocalizations, such as yodeling and howling.",
        "Text": "The Alaskan Klee Kai’s popularity is growing, and small litter size and its recent addition to the American Kennel Club mean you may wait a while to find a puppy. With an appearance similar to his larger ancestors, the Siberian and Alaskan Huskies , the Alaskan Klee Kai is an active companion for those who can provide the level of exercise these pups require. The breed comes in three varieties, divided by size. They are intelligent, hardy, and can be stubborn and typically aloof with those they don’t know. The coat color and appearance of the Alaskan Klee Kai are similar to that of a Husky. Their main color is either gray, black, or red with contrasting white color inside the ears, on the lower face, chest, abdomen, and feet. See all of our expert product reviews . The Alaskan Klee Kai is divided into three categories by size: toy, miniature, and standard. The only difference between them is their adult height. Other specifications, such as temperament and coat markings, are identical. The small size of the breed, which is around 700 dogs, means that there are not many mixes available. Some people have crossed the dog with the Havanese . The resulting offspring are known as Hava Klee (also styled as Havaklee or HavaKlee). The Hava Klee often inherits the blue eyes, facial features and temperament of the Alaskan Klee Kai. This rare breed will likely do well in small spaces but is very active and high-energy so will need to play and interact with people regularly. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Some commonly believed facts about this dog are not true. It is not simply a miniature Husky , but its own distinct breed, developed as companions, while Huskies are a working breed. See all of our expert product reviews . The Alaskan Klee Kai, which translates as “small dog” in the indigenous Athabaskan dialect, was developed in Wasilla, Alaska in the 1970s and 1980s by Linda Spurlin and her family in response to those who loved the Siberian Husky but wanted a more compact breed. To avoid creating unhealthy dogs that could have resulted from breeding extra-small huskies, the Spurlins bred the Alaskan Klee Kai by combining the Alaskan Husky with the Siberian Husky , American Eskimo Dog , and Schipperkes . Although the breed is established and recognized by the American Kennel Club in 2020, it is still considered rare. The Alaskan Klee Kai is divided into toy, miniature, and standard. Their size and weight determine which class they are grouped in. One of the facts that have prevented many genetic conditions in the breed is their lack of popularity. Since it is not a highly popular breed, it has been saved from some of the over-breeding damage that has affected other breeds. However, the small gene pool of the Alaskan Klee Kai makes it very important to get your pup from a reputable breeder or rescue. Some health conditions that the Alaskan Klee Kai is prone to include the following: Cautious or even aloof around strangers, the breed is attentive and loving with his family. He can be nervous around small children, so spending time on socialization is important. The Alaskan Klee Kai’s alert nature makes him an excellent watchdog. The Alaskan Klee Kai is an attractive, personable dog, which makes it a popular choice for those looking for a companion. It is important to keep in mind that the breed needs regular exercise, can be stubborn and requires socialization to prevent shyness. While they are a great pet for many people, they aren’t always the best choice for a first-time dog owner. Plan to feed your pup at least twice a day. The amount you feed is determined by the adult size of your pup— standard pups will eat more than toy-sized pups. Regardless of how much and how often you feed, be sure your pup has access to clean, fresh water as well. Alaskan Klee Kai dogs are high-energy and they can be susceptible to some health complications. So be sure to choose dog food that supports your Alaskan Klee Kai dog’s health from the inside out. One good course of action is selecting a well-rounded organic dog food. Since thyroid issues can be a concern with the Alaskan Klee Kai, Purina Beyond Organic High Protein Dry Dog Food & Wet Dog Food cuts out a lot of the additives that can disrupt the delicate endocrine system. The top ingredient is free-range chicken, so you know your Alaskan Klee Kai is getting the necessary nutrients like protein, vitamins, and minerals. The balanced nutrition and absence of added growth hormones or antibiotics, artificial dyes, preservatives, flavors, or synthetic pesticides/fertilizers let you rest a little easier about your Alaskan Klee Kai’s immune and endocrine systems, heart, and liver. Try out Purina Beyond Organic High Protein dog food, available on Chewy and Amazon. The breed has a double coat. To minimize hair in the house and keep your Alaskan Klee Kai looking its best, plan on grooming a few times a week. These dogs will also experience significant shedding twice a year when they lose their undercoat. Plan on daily brushing for the week or two this happens each spring and fall. This breed is smart but can also be stubborn. The combination makes training a challenge for the inexperienced pet owner. Enrolling in a puppy training class as soon as possible or working with experienced training can ease frustration for both you and your dog. Patience and short, frequent training sessions typically yield the best results. Although the Alaskan Klee Kai isn’t a large breed, these dogs are active. A fenced yard that allows them to burn off energy while keeping them safe is important. Active play is necessary because when left alone in the yard for long periods their boredom may take on destructive tendencies. The litter size of the Alaskan Klee Kai is between one and five puppies. One of the facts that drive up prices on the breed is the scarcity of available pups. One option is searching for a dog available for adoption. Rescues are often home to young dogs who ended up not being a good fit for their initial family. Alaskan Klee Kais are good companions for families with children . Their high energy level and love of play make them a rewarding pet, particularly for those with a fenced yard. Due to the small number of Alaskan Klee Kais available each year, from either breeders or rescues, you may be curious about similar breeds. The American Eskimo Dog and Keeshond are both smaller dogs, bred for companionship, that have a similar appearance. Many people assume that the Alaskan Klee Kai is a miniature Siberian Husky, but that isn’t true. It is a distinctive breed, developed to be a companion dog. Some common traits shared by the two breeds include their tendency toward slow recalls, which means neither breed should be trusted off-lead, and their ability to escape from yards, kennels, and other types of confinement. Differences between the breed, along with size, include temperament and trainability. While the Siberian Husky is a friendly, sociable pup, Alaskan Klee Kais require frequent socialization from a young age and tend to be shy. The Alaskan Klee Kai is also more trainable than the independent and distractable Siberian Husky. Finally, the Siberian Husky’s average litter size is larger, at between 4 and 8 puppies. While there are not any specific dogs that have achieved fame, especially due to the rareness of the breed, there are some famous owners of Alaskan Klee Kais. Celebrity couple Jonas Brothers singer Joe Jonas and actor Sophie Turner used to own two Alaskan Klee Kais, the first named Porky Basquiat and the second, Waldo Picasso, who was killed in a car accident in 2019. The breed’s popularity grew following the TV appearance during the NFL draft in 2020 of an Alaskan Klee Kai called Nike owned by Bill Belichick, head coach of the New England Patriots football team. Popular names for the breed often refer to its cold-natured origin. Popular names include:",
        "score": 0.6868193
    },
    {
        "Name": "Uakari",
        "Genus": "Cacajao",
        "Diet": "Omnivore that eats fruits, leaves, insects",
        "Behavior": "They usually live in troops.",
        "Features": "Hairless face and forehead",
        "Fun_Fact": "Have a very short tail for their size!",
        "Text": "The Uakari is a species of small monkey, indigenous to the tropical rainforests of South America, where they are inclined to be found in the damp jungle close to the water. The Uakari is most renowned for its naked face which commonly ranges in color from pink to deep red. There are four distinct species of Uakari, all of which are very similar in appearance but differ somewhat in fur color and location. The name Uakari is actually pronounced “wakari”, with both the monkey’s common name and its scientific name believed to have derived from indigenous languages. Red (Bald) Uakari . Characterized by a bright crimson face and a very short tail. Narrowed to wooded habitats and forests near the water in the western Amazon Black-Headed Uakari. Black hair covers its body, with a red tail, limbs, and abdomen. Found in the Amazon Rainforest, most notably in Venezuela, Brazil, and Columbia. Ayres Black Uakari. Very little is known about this species as it has such little distribution and is not located in any of the protected areas. It was originally thought that this would be treated as a subspecies of the Black-headed Uakari, rather than a separate species. Neblina Uakari. The Neblina can be found in the northwest Amazon jungle of Brazil. The Uakari is a small-sized primate growing to an average of 45cm in length, and weighing around 3kg. The tail of the Uakari is very short relative to its body size, and particularly small compared to those of other South American monkey species. The fur that covers the Uakari’s body is long and coarse and tends to vary in color, from red to brown, to black, to white, depending on the species. The hairless face of the Uakari is their most distinctive feature and can be deep red in color in some individuals (although it generally ranges from pink to red, and can be paler or even black in some species). Their hands and feet are strong and agile with their opposable thumbs allowing the Uakari to hold onto fruits and tree branches. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Uakari is found inhabiting moist, tropical rainforest only in the Amazon River Basin, throughout Brazil and Peru , and in parts of southern Columbia. The separate species tend to be most easily characterized by their differing locations, and this is also true for the sub-species of the Bald Uakari. The White Uakari is found in north-western Brazil; the Golden Uakari on the Brazil-Peru border; the Red Uakari on the Brazil-Columbia border, with the Pale-Backed Red Uakari being found just a little further east. The Uakari is generally found in jungles that fringe freshwater sources such as streams, small rivers, and lakes. They prefer part-flooded forest that is flooded either permanently or on a seasonal basis though, to areas of rainforest that line large rivers. Unlike numerous other monkey species, the Uakari does not use its short tail to hang from the trees or to help it when jumping, although it is still useful for balance. They spend much of their time high in the canopy and jump from tree to tree just using their strong arms and legs. Like many primates, however, the Uakari is known to walk on all four limbs on its rare trips down to the forest floor. The Uakari lives in troops in their jungle environment that usually contain between 10 and 30 members (although they can be up to 100 strong), which are males, females, and their offspring. Although they spend much of their time together in the trees, when it comes to looking for food, the Uakari troop breaks up into smaller groups to forage. The Uakari tends to breed between the months of October and May when the females release an attractive scent to attract a mate. Once mated, the female Uakari gives birth to a single infant, after a gestation period that is still unknown, but she can do so every two years. The baby Uakari are incredibly small and vulnerable at birth, clinging to their mother for their first few months, and feeding only on her milk. They are weaned at an average age of four months old when they begin to forage with the troop for soft fruits and seed pods. The Uakari tends to live for about 20 years in the wild, but population growth rates are not particularly fast as the females can’t breed until they are three years old, and the males when they are six. Like many other primates, the Uakari has an omnivorous diet and therefore consumes a combination of both plant material and small animals. Despite this, the Uakari primarily eats fruit from the surrounding trees, along with leaves and Insects to supplement their diet. The Uakari gets the majority of its food from high up in the canopy but will forage on the forest floor for seeds, roots, and lizards when food is scarce in the trees. Due to its predominantly fruit-based diet, the Uakari plays a vital role in its native ecosystem through the spreading of seeds throughout the forest. Living high up in the forest canopy, and occupying these areas in sometimes quite large groups, the Uakari has few predators with the biggest threat being Birds Of Prey. Other tree-dwelling species such as Snakes and larger Monkeys also prey on the Uakari, and more particularly, their young. Humans are, however, the Uakari’s biggest threat as they have been hunted for food by the native people through much of their natural range. The rainforest habitat of the Uakari is also under threat due to high levels of logging for the timber industry throughout the Amazon Basin. Despite not having an incredibly long tail to clutch onto branches with, the strong hind legs of the Uakari enable them to be able to jump staggering distances. Jumping on their hind legs between branches, the Uakari can jump up to 20 meters from tree to tree. The colored, naked face of the Uakari is by far their most distinctive feature but the exact reason for this bright colouration is not really known. Theories range from mating reasons to being able to spot one another in the forest, but one thing is certain, which is the fact that the face of sick individuals becomes paler and so the skin color actually acts as an indication of the animal’s health. The faces of those Uakari kept in captivity, are also noticeably paler than they would have been in the wild. As long as native tribes have inhabited the jungle of the Amazon Basin, people and the Uakari have been known to one another. Until recently, the Uakari was seen by many indigenous people as a stable source of food, and they have been regularly hunted by them primarily using poison-tipped darts. Many were also captured by local people to be kept as domestic pets or even sold. The Uakari is now also under threat from Humans, mainly from deforestation either for commercial reasons or to expand already growing human settlements. Enormous stretches of the Amazon are still cut down on a daily basis, meaning that many of the native species (and people) lose their homes. Today, although the different Uakari species are all classified by the IUCN slightly differently, they are generally considered to be animals that are Vulnerable in their natural environment. Hunting by indigenous people and habitat loss to logging is thought to be the two main reasons for their ever-declining population numbers, as they are now found in smaller and more isolated pockets of their natural habitats.",
        "score": 0.68635046
    },
    {
        "Name": "Panther",
        "Genus": "Panthera",
        "Diet": "Carnivore that eats deer, tapir, wild boar",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Bright emerald green eyes",
        "Fun_Fact": "Prefers to hunt at night than during the day!",
        "Text": "The Panther (also commonly known as the Black Panther) is a large member of the Big Cat family, native to Asia, Africa and the Americas. The Panther is not a distinct species itself but is the general name used to refer to any black-colored feline of the Big Cat family, most notably Leopards and Jaguars. The Panther is an elusive and powerful animal that has adapted well to a variety of habitats around the world, and is known to be one of the strongest climbers of all felines. Although the Panther is not technically classified as a separate species, they are considered to be endangered by many due to the declining numbers of both Leopards and Jaguars throughout much of their natural ranges. The Panther tends to be dark brown to black in color and is otherwise identical to the feline species to which it belongs. The only real exception to this is the Florida Panther found in the southeast region of the USA, that is believed to be a subspecies of Cougar and is quite rarely dark brown in color and tends to have more of a speckled appearance. Like Leopards and Jaguars, Panthers also have spots. Though they are so dark they can be difficult (if not impossible) to see against the shiny coat of dark fur. Panthers are animals with small heads, strong jaws, and emerald green eyes and tend to have hind legs that are both larger and slightly longer than those at the front. Being a member of the Big Cat family, the Panther is not only one of the largest felines in the world but it is also able to roar which is something that felines outside of this group are not able to do. In terms of evolution, the story of the panther shares a few similarities with that of the puma. They include an ancestor which crossed the Bering Strait into North America. In the case of the panther, this forebear is believed to have been the Panthera gombaszoegensis , the earliest member of the Felidae family to have existed in Europe approximately two million years ago. As for the Panthera subfamily, scientists aren’t quite certain when it separated from the Felidae family, however, records show the event occurred about 12 million years ago at the most. Experts also believe that the large felines which live in the Americas at present are actually descendants of jaguars which lived in South America’s northern environs between 300,000 – 500,000 years ago. It is another parallel which can also be drawn between the puma’s own evolutionary history since its North American population was also replenished by those from South America. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . So what other member of the Panthera genus is the present day panther closely related to? Again scientists differ in this regard and some consider the jaguar to be more closely related to the lion ( Panthera leo ), while others believe the leopard ( Panthera pardus ) to be its closest living relative. As for the leopard, its evolutionary history begins 4.37 million years ago when it emerged from Panthera . Panthers are animals that are natively found on three of the world’s continents, with their location depending on whether or not it is a black Leopard or a Black Jaguar . There are 30 different subspecies of Leopard found across both Asia and sub-Saharan Africa , and with the once large natural range of the Jaguar stretching throughout Central and South America and even into parts of the USA, the Panther has become an incredibly adaptable animal that is found in a variety of different habitats. Although they are most commonly found in tropical and deciduous forests, the Panther can also be found inhabiting both marsh and swampland, along with grasslands and even more hostile areas such as deserts and mountains. Along with a number of the world’s largest felines, the Panther is becoming rarer in the wild primarily due to habitat loss in the form of deforestation. The Panther is an incredibly intelligent and agile animal that is very seldom seen by people in the wild as it is generally elusive. Its dark brown fur camouflages the Panther both into the surrounding forest and makes it almost invisible in the darkness of night. The Panther is a solitary animal that leads a nocturnal lifestyle, spending much of the daylight hours resting safely high in the trees. Like both the Leopard and the Jaguar, Panthers are incredible climbers and they not only rest in the trees but they are also able to keep a watchful eye out for prey without being spotted. The Panther is an incredibly powerful and fearless animal that is feared by many due to the fact that it is also very aggressive. The Panther is also rather territorial particularly in the case of males whose home ranges overlap those of a number of females. You can check out incredible facts about panthers . Although there are only two different species of Big Cat that are considered to be Panthers, Leopards and Jaguars are actually very closely related despite living in separate parts of the world. Black Leopards and Jaguars often occur in the same litter as spotted cubs with the female usually giving birth to between 2 and 4 cubs after a gestation period of around 3 months (it is a simple recessive gene that makes a cub black and one that is carried by both parents). Panther cubs are born blind and do not open their eyes until they are nearly two weeks old. They are incredibly vulnerable to predators, particularly when left by their mother who must hunt for their food. By the time they are a few months old Panther cubs begin to accompany her in search of prey and often won’t leave her until they are nearly 2 years old and have established a territory for themselves. The Panther is a carnivorous animal and one of the most feared and powerful predators throughout its natural environment. Hunting under the cover of night, the Panther’s dark fur makes it almost impossible to spot meaning that it can move through the jungle completely unseen. Although the majority of their hunting is actually done on the ground, they are also known to hunt from trees meaning that they can ambush their prey from above. The exact diet of the Panther is dependent on where in the world it lives although medium to large sized herbivores comprise the bulk of the diet of many large Cats. Animals including Deer, Warthogs, Wild Boar, Tapir and Antelope are all hunted by Panthers, along with smaller species like Birds and Rabbits when larger prey is scarce. The Jaguar is the largest feline in the Americas and so Panthers in the New World are the most dominant predators within their environments. Those found in Africa and Asia however are occasionally preyed upon by other large carnivores such as Lions and Hyenas, but the most common predator and biggest threat to all Panthers is people. Not only have these rare animals been hunted by them throughout much of their natural range but they have also been subjected to drastic habitat loss particularly in the form of deforestation for both growing Human settlements and to make way for agriculture. Population numbers of large Cats are declining all around the world and they are being pushed into smaller and smaller pockets of their native habitats, Panthers are becoming even rarer than they already were. Although technically only black Leopards and Jaguars are generally considered to be the only true Panthers by science, the term is also used to describe a number of other dark coated Cats by locals in their native habitats including Cougars, Tigers, Pumas, Lynxes and Bobcats . The Black Panther is seen to be one of the most intelligent and ferocious predators in America so the image of a Panther is widely used as a logo or as a mascot for sports teams. Some Panthers are actually able to swim, although not those that are Leopards, as Jaguars are known to have a real love of water. Not only do these individuals prefer flooded forests but they spend a remarkable amount of time swimming, playing and hunting in the cooling water. The world’s Big Cats have been hunted by people as both trophies and for their fur particularly over the past couple of centuries. This caused enormous declines in population numbers of both Leopards and Jaguars with them having actually completely disappeared from some areas of their historic range. Panthers have also been subjected to severe habitat degradation throughout much of Asia, Africa and America which means that these elusive predators are now even rarer. They are very rarely seen by people who are only really ever aware of a Panther’s presence by their tracks left on the ground and scratch marks on trees. They are in fact so sneaky that Panthers are often referred to as ‘the ghost of the forest’. Although the Panther is not considered to be a species itself by science, both Leopards and Jaguars are becoming increasingly vulnerable throughout much of their natural range and are listed as Threatened species by the IUCN. However, due to the fact that two gene carrying individuals must mate to produce a Black Panther and the chances of this are decreasing with habitat loss, many wildlife experts consider these animals to be endangered all around the world.",
        "score": 0.68619686
    }
]