[
  {
    "Name": "Baboon",
    "Text": "The Baboon is a medium to large-sized species of Old World Monkey that is found in a variety of different habitats throughout Africa and in parts of Arabia. There are five different species of Baboon which are the Olive Baboon, the Guinea Baboon, the Chacma Baboon, the Yellow Baboon, and the Hamadryas Baboon which differs most from the others wide its bright red face and cliff-dwelling lifestyle (the other four species are collectively known as Savanna Baboons). However, there is some debate over the classification of the different species due to the fact that some have been known to interbreed, indicating that they could be sub-species instead. Baboons are incredibly sociable and intelligent animals that are known to form close bonds with other members of the troop that often last for life. They are also incredibly adaptable animals but their population numbers are declining throughout their natural range primarily due to hunting and habitat loss. Here are the five different Baboon species: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Baboons are large and powerfully built monkeys that spend most of their time on the ground. They have large heads with long, dog-like muzzles and cheek pouches for storing food with a heavy brow ridge protecting their eyes. Males are often twice the size of females and have fearsomely sharp canines that help them to defend the troop from danger, but their exact size depends on the species with the Chacma Baboon being the largest while the Guinea Baboon being the smallest species. Baboons have wild-looking fur with a longer mane that extends over the shoulders and hairless patches on their faces and rumps which are padded with hard skin. Their color varies from olive-green to yellow, silver, and brown depending on the species. They also have a distinctive bend towards the base of their long tails. Baboons would have once been found throughout the African continent and today, although they are still widespread, their natural range continues to decrease. Baboons are found in a variety of habitats including savanna, scrub, rocky deserts, and rainforests providing there is an ample supply of water. The Hamadryas Baboon is found in the rocky deserts in the hills that line the coast of the Red Sea both in northeast Africa and in parts of the western Arabian peninsula. The Olive Baboon is the most widespread species with a range that extends from west to east across a wide range of habitats, whereas the Guinea Baboon is confined to a small region in the west. The Yellow Baboon is found in the east and the largest species, the Chacma Baboon is also found the furthest south, with a range that covers the southern tip of Africa. Baboons are incredibly sociable animals that live in large troops that can be very varied in size and can contain a few hundred members. Baboon troops consist of both males and females with their young and form very close bonds by feeding, sleeping, and grooming together. During the day they break into smaller bands of 4 or 5 females and young, which is led by a dominant male who attempts to keep other males away. The Hamadryas Baboon, however, lives in much smaller groups of around 12 females and a single alpha male. Baboons live together for protection and are constantly on the lookout for dangerous predators, particularly when they are out in the open. If a threat is spotted, they make loud barks and while the males run to attack, the females and young disappear up into the safety of the trees. Baboons communicate with one another in a variety of different ways including vocal calls, facial expressions, and even signals with their tails. Baboons breed all year round and while they don’t have a strict breeding season, there are peaks in mating and births at certain times of year (depending on the location). When a female is ready to mate, the dominant male of their sub-group will defend his right to mate with her fiercely but despite his efforts, female Baboons mate with numerous males in the group during their lives. After a gestation period that lasts for around 6 months, the female Baboon gives birth to a single infant that grabs onto her fur instantly and clings to her. When they are born, young Baboons are contrasting colors to their parents and are tolerated by the troop until they molt and grow their adult fur after about two months. Young females remain with their mothers and the two will often form very close bonds throughout their lives, whereas males are chased out of the troop and are forced to try and prove themselves to another group. The Baboon is an omnivorous animal that is known to eat a wide variety of both plant matter and small animals. Fruits, seeds, tough roots, and flowers all make up the bulk of their diet, along with insects, eggs, lizards, and rodents. However, their large size and power also mean that they sometimes hunt and kill larger prey such as young Gazelles. In areas where human settlements are encroaching on their natural habitats, Baboons are also known to raid crop fields which have led to them often being seen as pests. Baboons have very similar teeth to people with a series of large, flat molars which are perfect for grinding down vegetation and surplus food can be stored in their flexible cheek pouches to be saved for later. Due to their size and the fact that Baboons spend the majority of their lives on the ground, they are preyed upon by numerous predators throughout their natural range. Wildcats such as Lions , Leopards, and Cheetahs are the most common predators of the Baboon along with large Pythons, African Wild Dogs, and Birds of Prey that hunt the smaller and more vulnerable young. People, however, pose the biggest threat to Baboons as they are often hunted and killed for meat and are even shot by farmers who consider them pests, fearing for their crops. Their numbers though are being most affected by the loss of their once vast natural habitats, which are being subjected to deforestation for agriculture or land clearance for grazing and growing human settlements. Although Baboons retire into the safety of the trees to sleep at night, they spend nearly all of the rest of their lives on the ground and roam throughout their home ranges in search of food and water. They are known to walk many miles a day and only stop in the shade to get out of the midday sun and are capable of traveling more than four miles between dawn and dusk. Like many other primates, Baboons take part in social grooming by picking parasites, dead skin, and dirt from each other’s fur. This not only strengthens social bonds within the troop but also highlights the status of the individual, with the Baboon who is being groomed having a higher status in the troop than the one who is grooming them. In order for male outsiders to be accepted into the troop, they must form a relationship with one of the females until he is then accepted by the others. This process can take months but the pair are usually known to remain close-knit friends for life. Baboons have adapted remarkably well to the growing human populations throughout their natural range but the fact that they often raid crops has led to them being persecuted by farmers. They are also hunted and eaten as bushmeat in many areas of their native regions but it is their dwindling habitats that are causing the biggest problem for them. Vast areas of forest are cleared every day to make room for agriculture or to log the tropical timbers which means that Baboons have fewer areas where they can sleep safely in the trees. The grasslands are also dwindling in size as land is turned over to livestock for grazing or used for the expansion of growing settlements. Today, four species of Baboon are listed by the IUCN as species that are of Least Concern from becoming extinct in the wild in the near future. The Guinea Baboon is listed as a Near Threatened species. However, despite still being relatively widespread, population numbers are declining in all species due to hunting and habitat loss, with populations in certain areas rapidly becoming more and more isolated from one another. They are found throughout many of Africa’s national parks and reserves where they play a vital role in the upkeep of the eco-system.",
    "Similarity": 5
  },
  {
    "Name": "Orange Baboon Tarantula Obt",
    "Text": "The orange baboon tarantula is both orange and ornery. The orange baboon tarantula (OBT) is covered in bright orange bristles. Their faces resemble furry, orange baboons. OBT’s, as they are sometimes referred to, are known to have an ornery disposition and can act aggressively. They can grow to be similar in size to the Mexican Red Knee with a body around three inches and a leg span of five to six inches. These are Old World tarantulas and live in central and southern Africa . Orange baboon tarantulas are kept as pets but not recommended for beginners. The scientific name of the orange baboon tarantula is Pterinochilus murinus. They are commonly called OBTs for short which pet hobbyists sometime comically refer to as the “orange bitey thing” due to their aggressive nature. The latin word murinus means “grey-mouse-colored” and they are sometimes called another nickname Pterror (silent “P”), a play on their scientific name , Pterinochilus. The orange baboon tarantula is rightfully named due to its furry coat of orange hair. Some tarantulas have orange legs but this one is completely covered in orange bristles called setae. The other remarkable coloration is the bottom of their feet which are an iridescent blue-green. You can see these when the tarantula rears waving its front legs and pedipalps in a threat position. They have two larger black, beady eyes that are prominent beside its six smaller eyes. The females are a bit larger than the males with a body that is two to three inches and stout. Their leg span is five to six inches, which is about the length of a cell phone. They have eight segmented legs with lighter colored knee joints. Two appendages on the front of their body look like more legs but they are a tad shorter, these are the pedipalps. Their abdomens are oblong and have darker markings with the spinnerets at their end. The most remarkable behavior of the OBT is that they are quick to react with a threat pose. The threat pose is observed when a tarantula rears up and waves its front appendages and shows its fang. This aggressive stance sends a clear message to the predator to back off. If the orange baboon tarantula still feels threatened, it is quick to attack and bite. This is how it received its nickname “orange bitey thing”. Their bites are venomous and harmful to humans , so anyone who is bitten should seek immediate medical attention. In the wild, this defense mechanism serves them well. They may begin by retreating or fleeing before going into a threat pose, but they are considered more aggressive than other tarantulas. As a terrestrial and semi-arboreal animal they have to be aware of predators both on the ground and in the surrounding trees . As an Old World species they do not have urticating hairs to flick at an approaching threat. They spend their days in their burrows or in a large web tunnel that they make on the ground or in bushes/tree’s lower branches. At night they come out to try to find food such as insects , crickets, roaches, worms, small lizards or frogs. Orange baboon tarantulas are from central and southern Africa. There are populations spread out in many countries. Some of the countries they can be found in are Kenya, Zambia, Angola, Congo, Zimbabwe and Tanzania. They are both terrestrial and semi-arboreal making webbed tunnels on the ground and in trees, but they will also make burrows to hide in during the day. Sometimes they make their own burrows while other times the take over the burrow of an abandoned creature. They spin a webbed “door” to cover the entrance of their burrow as protection. The climate in Africa where they live is warm and very humid. In the wild, they adjust to the weather by staying hidden during the day and moving deeper into their burrow when needed to find cooler temperatures. In captivity, they should be kept in an enclosure that is 75°-78° with a higher humidity of 70-80%. Both terrestrial and arboreal surroundings should be available to this species when in captivity. The orange baboon tarantula has similar predators as other spider species. Predators include other spiders, lizards, snakes and birds. OBTs are not afraid to take on predators that are a little bigger than themselves. They can actually turn the tables and attack and kill animals bigger than themselves. Sometimes, they will not even give the threat pose, and instead, quickly bite their threatener, releasing their venom. During the day these tarantulas hide from predators in a deep burrow in the ground or safely in their webbed tunnels. At night they use the hairs on their legs to sense movement around them, warning them of trouble. The animals that eat orange baboon tarantulas are snakes, lizards, birds and larger spiders. Tarantula hawks are one of its biggest, and most vicious, predators. These creatures are actually not a hawks but are large, blue and orange wasps . They go after tarantulas by attacking and stinging them, which paralyzes the tarantula but doesn’t kill it. They then inject one egg into their abdomen and bury them alive. When the wasp larvae hatches it feeds on the still living tarantula. Orange baboon tarantulas eat insects, frogs , lizards, small birds, and small mice. They hunt at night by waiting just inside the entrance of their burrow. When they feel the movement of a prey passing by, they lurch at it and subdue it with their pedipalps using their fangs to stabilize it. They quickly inject it with venom and use their web to ball it up. OBTs use their straw-like mouth to suck up the liquefied prey. In captivity they are voracious eaters and aggressively attack food put in their enclosures. This behavior is one of the reason pet hobbyists enjoy watching this unique creature. Orange baboon tarantulas are not listed by the IUCN as a threatened animal. They have populations in many different countries in central and southern Africa so their population seems to be healthy. You might think that a grumpy, aggressive tarantula might have a hard time finding a mate; however, you see this aggressiveness in both males and females. This might make it seem even harder! But they tend to put their differences aside for the sake of procreating because they continue to reproduce. Like other tarantula species, the females do have a tendency to eat the males right after mating, so there is still that! Female orange baboon tarantulas lay around 50-100 eggs. She forms an eggs sac that she hides in her burrow until the eggs are ready to hatch. The mother turns the sack periodically, assisting in fertilization. Can you imagine 100 grumpy baby spiders all running around? Well, they don’t stick around for long and will depart to find a new home of their own shortly after hatching. The life span of the orange baboon tarantula is quite different between males and females. Males only live to be three to four years old, and females live 12-15 years. If males don’t get eaten by their mate, that is! Due to the range and habitat of the orange baboon tarantulas, it remains uncertain what their exact population is. They are not listed by the International Union for Conservation of Nature (IUCN), which means they are not considered threatened, and they have recorded populations in many countries in central and south Africa .",
    "Similarity": 1
  },
  {
    "Name": "Dinopithecus",
    "Text": "The Dinopithecus is an extinct genus, the name of which means “terrible ape”. They were a large primate closely related to the baboon. They lived in South Africa and Ethiopia from the Pliocene to the Pleistocene Epochs. Because they were only found in certain areas, it is believed they lived in specific habitats. One of the largest known baboons in the history of the world, Dinopithecus was approximately twice the size of the largest baboons alive today. Males are estimated to have been 1.5 meters (5 feet) tall at the shoulder. Females were smaller than that, at 1.2 meters (4 feet). The Dinopithecus males tended to weigh around 46 kilograms (about 100 pounds), while the females weighed 29 kilograms (about 63 pounds) on average. Despite knowledge of Dinopithecus, currently, only partial remains have been found. Because of this, its appearance can only be approximated. Details on what Dinopithecus ate are largely unknown. It is believed that they had a much more varied diet than current baboons, possibly due to climate changes at the time. Studies on the shape of their teeth indicate Dinopithecus probably had a coarse diet, primarily consisting of underground storage organs, fruits, and other savanna resources. Dinopithecus are believed to have been omnivorous creatures. If so, they highly likely supplemented their diet of plants with meat; however, it is unknown what specifically. Dinopithecus lived in South Africa and Ethiopia during the Pliocene and the Pleistocene Epochs. They were most commonly found in the Ethiopian area of the Matabaietu Formation. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . They also likely lived around water holes, as they weren’t suited to travel long distances for water. A home near water is essential for any baboon as it can ensure safety. It’s possible that the Dinopithecus, like the hamadryas baboon, lived near cliff faces but occasionally would find shelter in trees. Like the yellow baboon, they may have inhabited savannas and light forests. In a study by Caroline M. Bettridge and Robin Dunbar, it was found that due to their size, they would have to have lived in very specific climates to ensure they could get enough food to survive. Generally, fossils of the Dinopithecus are rarely seen outside of the small caves where they are found in South Africa. Exact predators of the Dinopithecus are unknown. The best candidates for what could have been their primary predators are large, sabre-toothed cats, such as Dinofelis and Machairdodus. In addition to prehistoric big cats, relatives of the modern crocodile – like Crocodylus thorbjarnarsoni – also could have been great predators of this large primate. Crocodylus thorbjarnarsoni are known for having grown to very large sizes with powerful bites and armored skin. With such features, they easily would have been capable of killing a Dinopithecus. The Dinopithecus fossils are known to be broken and incomplete, forcing paleontologists to make common guesses on how this genus lived. Fossils from the early Pleistocene age have been found in several sites in South Africa. It is known from having been found in caves in the country, such as Swartkrans and Sterkfontein The Dinopithecus are thought to have gone extinct during the Pleistocene Epoch, which took place between 2,580,000 and 11,700 years ago. Climate changes caused the size of Dinopithecus to become its downfall. Food became more scarce as climate changed, and the Dinopithecus required large quantities of food to stay healthy.",
    "Similarity": 3
  },
  {
    "Name": "Dinofelis",
    "Text": "The dinofelis is a genus of saber-toothed cats that belonged to either the Smilodontini or Meailurini tribe. These extinct creatures inhabited parts of Europe, Africa, Asia, and North America between 5 to 1.2 million years ago. They existed during the early Pliocene and Pleistocene Periods. Dinofelis were around the same size and build as a modern leopard or lion. This large cat is part of groups either as a large or small dinofelis species. The appearance of the various species would differ. Some species only reached 3 feet long, while others grew to 5 feet long and weighed up to 250 pounds. Dinofelis had a medium-sized build and had prominent saber teeth protruding from their powerful jaws. They were likely found in forest-like habitats due to their build and size and had spotted or striped coats. Fossils and reconstructed pictures of the dinofelis indicate that they were very powerful cats. They weighed slightly more than the modern big cats and had less prominent teeth than actual saber-toothed cats. Paleontologists also refer to the cat as a “false saber-tooth” because of their distant relation to actual Smilodon (saber-toothed cats). Their large weight and robust build did not make it the fastest runner. It is likely that they were ambush hunters instead. Some depictions of the dinofelis show that it has a medium-length, fluffy coat lined with stripes, a small tail, and a head, along with a muscular and well-built body. Their canines stick out of their mouth. They lack the deep ribcage seen in fast big cats such as cheetahs. The dinofelis was a carnivore and ambush hunter. They preyed on herbivorous animals that ate grass and vegetation as their main diet and rarely attacked other predatory animals. Climbing into trees, they would wait for unsuspecting prey to fall within their view from the tree. They would then leap onto the prey and make it their next meal. The dinofelis likely preyed on many different grass-feeding species, like baboons and antelope. They seemed to have eaten both primates and hominids and attacked our human ancestors as a source of food. Dinofelis ate animals and hominids such as mammoth calves, mastodons, giraffids, zebras , and Homo habilis. Fossils of both baboons and dinofelis are found in a natural trap in South Africa. This indicates to paleontologists felt they were lured in by trapped prey. There is also evidence that the dinofelis hunted Australopithecus africanus and extinct hominids. It is known due to fossils found with the same shaped canine indentations in the skull. The larger species would prefer large prey to hunt and eat. Smaller species went for small prey like baboons. The robust forelimbs of the dinofelis showed that their strong muscle structure allowed them to wrestle with their prey. They did not risk dental injuries to inflict a wound. Dinofelis lived around 5 to 1.2 million years ago, during the early Pliocene and Pleistocene Periods. Fossils indicate their geological location is in parts of Africa (most notably South Africa), Asia, Europe, and North America. They lived in forest environments with dense vegetation. It is also possible that they inhabited wetlands and riverine bush habitats, but forestry habitats were a preference. Hunting would be easier for the dinofelis in dense plant growth with trees. This allowed them to ambush their prey effectively rather than hunting in wide open lands. The dinofelis is known to live a solitary life and hunt at night, much like our modern-day leopards. It is possible that the dinofelis was able to adapt to a mixed environment, and it is possible that some species could adapt to live and hunt and open environments such as dry bushvelds in Africa. However, this is species dependent. Dinofelis was a predator itself that hunted during the night and early mornings and evenings. Some species of dinofelis were also found deceased in places where their prey was trapped, making it possible the dinofelis felt the lure of trapped animals and couldn’t escape. It is unclear what predators the dinofelis would have faced during its period, but other predatory animals or large mammoths may have been able to kill the dinofelis. The first fossil discoveries were in 1924 by Otto Zdansky. The name of this prehistoric big cat translates to “terrible cat” because the belief is it ate our human ancestors. The fossils from this genus varied according to the species. Some species had a large conical upper canine which set it aside from other species and it had not yet been reported in North Africa. The features of the fossil found resembled the Siwalik species better than other African ones. Fossils have been found in South Africa where they found fossils alongside baboons. Two specimens examined by Serge Legendre and Claudia Roth for their body mass weighed around 190 pounds and the other one was 69 pounds, which showed the difference in the different dinofelis species sizes. Fossilized canine teeth were more flattened and longer than our modern big cats, but much smaller than true saber-toothed cats. Carbon isotope ratios in specimens from Swartkrans showed that the dinofelis preferred to hunt grazing animals like herbivores or omnivores. Although the carbon isotope ratio proved little in terms that the dinofelis ate hominids, fossil evidence showed that some dinofelis may have attacked them. The dinofelis went extinct 5 to 1.2 million years ago. They only lived during the early Pliocene and Pleistocene Periods and went extinct shortly after. It is believed that the dinofelis went extinct due to sudden habitat changes and climate change. They seemed to go extinct before the Pleistocene extinction. A possible theory for the dinofelis extinction of an entire genus is due to the cycles of the ice age waning and waxing that caused habitat and climate changes. However, certain experts are wondering how none of the species in the dinofelis genus could have adapted and were all wiped out completely. Instead, there is a possibility that the dinofelis couldn’t compete with other carnivores that had more advantages. If the dinofelis were outcompeted by new evolving species, it is understandable how they would die off due to the environmental and equilibrium changes. The development of other carnivorous cats outcompeted the dinofelis in its own habitat. A mixture of environmental changes, climate change, human interference, and even major faunal changes that occurred during the time of the dinofelis extinction could be contributors. The dinofelis mainly resembles a large wild cat, much like the ones we see today. They also share similarities with other prehistoric wildcats.",
    "Similarity": 1
  },
  {
    "Name": "Monkey",
    "Text": "Monkeys are primates that comprise a wide range of species throughout much of the tropical world. Despite their raw variety, most of them face threats from human development, capture, and hunting. Though all monkeys have many similar characteristics and a close relationship to humans, an early evolutionary shift created two major groups today: “old” and “new” world monkeys. Though they don’t walk on two legs, monkeys are closely related to humans–only great apes, such as chimpanzees , are more related. Monkeys are some of the most popular animals in the world. Most research suggests that monkeys evolved from prosimians during the Oligocene Epoch. Additionally, apes then evolved from catarrhines in Africa during the Miocene Epoch. With that said, scientists decided that apes should be divided into the lesser apes and the greater apes. Studies also suggest that the ancestors of monkeys originated in Africa and the first known group is thought to have reached South America 40 million years ago. This happened when the land masses were closer together and made migration easier than it is today. As of today, the oldest known monkey skeleton is Canaanimico amazonensis . The skeleton has been dated to 26.5 million years ago. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Monkeys fall under two scientific names: simiiformes catarrhini and simiiformes platyrrhini . Simiiformes, from which the word “simian” is derived, come from the Latin “simia” for ape or monkey. Catarrhini comes from the Latin for “hook-nosed,” likely a reference to the closer, downward-pointed nostrils of these monkeys. This is in contrast to Platyrrhini, which comes from the Latin word for “broad-nosed,” a reference to the more flattened nostrils of this class of monkeys. Can travel more than four miles a day! Found in tropical forest edges! Found throughout the South-East Asian jungles! They forage on plants and fruits and act as seed dispersers, helping their environment. Has an elegant white moustache! Has distinctive V shape on head! Native to the eastern rainforests of Brazil! Spends 80% of it's time resting! Has cheek pouches for storing food! Distinctively coloured noses and rumps! The fastest species of primate in the world! Only found in one area of Brazil! Natively found on the island of Borneo! The smallest species of monkey in the world ! Red hair on hands on feet! Belongs to the only family of primates in the world with full prehensile tails! Lives in groups of up to 500 individuals! These tiny yet intelligent monkeys often give birth to fraternal twins. One of the world's most intelligent monkeys! Has a long, strong prehensile tail! Monkeys are something of a cousin to apes. Great apes-including chimpanzees, gorillas , and orangutans–have larger brains and no tails. There exist over 250 species of monkeys, including macaques , tamarinds, and marmosets. Monkeys come in a wide range of sizes, colors, and behaviors. These range from the pygmy marmoset, which is less than six inches tall and weighs about as much as a deck of playing cards, to the colorful-nosed mandrill, which can weigh over 100 pounds and top out at over three feet long. Overall, monkeys fall into two broad categories of appearance. Old World monkeys , or simiiformes catarrhini , mostly have more forward-facing noses, similar to humans. Virtually all catarrhini have tails, though none of them are prehensile, meaning they cannot use them to grab objects such as tree branches. The baboon is one example of an old-world group of monkeys, with long snouts and gray, brown, or tan fur that gets long around the chest and head. The tail of the baboon is approximately five inches long. New World monkeys , simiiformes platyrrhini , have flatter noses with nostrils that face more to the sides. They are also the only type of monkeys that feature prehensile tails, meaning they can use their tails to grab objects and hang from trees. One common example of a platyrrhini is the spider monkey, which has a pink face poking out of noticeably long black fur. Many monkeys avoid traveling on the ground, moving by way of what scientists call “brachiation.” Brachiation means moving around by swinging from one branch to another. Many monkeys, such as the spider monkey , have adapted long arms relative to their body for this purpose. This, in addition to their prehensile tail, allows them to reach far for the next branch. Brachiation isn’t slow, either–some gibbons can move through the branches as fast as 34 miles per hour, the same speed as a racehorse. Check out the most beautiful monkeys in the world and the ugliest monkeys in the world . Also, find out if monkeys can actually swim . Monkeys are found throughout the world, mostly in tropical areas. Catarrhini is found in Africa and Asia, while platyrrhinic mostly call Central and South America home. Most monkeys live in tropical areas, particularly in forests. Monkeys do, however, vary in the types of environments in which they thrive. Baboons, for example, live in places that are arider, or dry, in the southern countries of Africa, where it can also get cooler. The Japanese macaque, covered in thick white-ish hair, is one of the northernmost surviving monkeys, living where there can be snow for months in parts of northern Japan. Some of them do so by relaxing in hot mountain springs. Meanwhile, the golden-headed lion tamarin lives in a low area of Brazil, where there’s lots of rain and the average temperature is over 80 degrees Fahrenheit. The lion tamarin also spends its life in the trees, specifically between 10 and 30 feet off the ground, while a baboon will usually only go to high places, such as cliffs, to sleep and get away from predators. Most monkeys are omnivores, which means they eat a combination of meat and plants. Because of their size, the majority of monkeys get their “meat” from insects or grubs. Larger monkeys will also eat larger prey, such as lizards , or steal bird eggs. Fruit, nuts, and seeds also form a large part of most monkeys’ diets. It is a common conception that monkeys eat bananas, but you can find out if monkeys really eat bananas in this article . The amount of meat or plants eaten by a monkey depends on their environment as well as the time of the year. Monkeys might feast on grubs during those insects’ breeding times or eat lots of fruit while it is ripe, then resort to more dependable food for the rest of the year. The squirrel monkey , for example, gets three-quarters of its nutrition from insects, but will mostly eat plants and fruits, particularly from the Attalea maripa palms, during the rainy season. For a complete list of the food monkeys eats, check out our “ What Do Monkeys Eat ” page. Monkeys across the world face dangers from other animals as well as humans. In Africa particularly, larger predators such as lions will attempt to hunt monkeys. However, the biggest threat to most monkeys comes from humans. Humans threaten monkeys through hunting and development. Farmers and loggers can damage a species of monkey’s ecosystem, even when humans clear out a small area. The clearing of trees for crops or lumber can disrupt the ways in which the monkey searches for food for example. In addition, some regions allow monkeys to be hunted for food or captured for sale as pets. Much like humans, monkeys give live birth to one or two babies at a time and live long lives compared to other mammals. Though smaller monkeys can have life spans more like a household pet–around 15 years, on average, for many tamarinds–larger monkeys can live as long as 35 years in the wild . Monkeys live even longer in captivity, including one bornean gibbon that made it to 60 years old. Monkeys grow to maturity within a few years, overall. Like humans, it can take about a year for a fertile female to mate and give live birth to a baby monkey . These timelines are typically shorter for smaller, more rodent-sized monkeys. Like humans, monkeys often have a near-monthly cycle where they can get pregnant. Despite this, most monkey species have a mating season that revolves around food availability. Most monkey species will give birth to a new baby approximately once every year. Monkey mothers will typically nurse and care for a newborn monkey for at least a few months until the baby monkey becomes more independent. During this time, the baby monkey might cling to the mother exclusively, preventing the mother from having another baby. Many monkey species form family groups with many adult females and an “alpha” male with whom most of the females mate. Non-alpha males born into these groups might separate from the group in adulthood to form their own family group. As the alpha male grows older or dies, another male may take over as the alpha. The number of monkeys around the world varies dramatically by species. Some are relatively abundant–such as the Bornean gibbon, of which there are hundreds of thousands estimated worldwide–while the Hainan black-crested gibbon is one of the rarest monkeys, with less than 30 alive in the world. Regardless of population, almost every monkey in the world is on the decline and is classified as “endangered” by conservation groups. The black-crested gibbon, specifically, is listed as “critically endangered” by the International Union for the Conservation of Nature (IUCN). Other IUCN critically-endangered monkeys include the gray-headed lemur, the blond capuchin, the Myanmar snub-nosed monkey, and the Sarawak surili. A few species of monkeys are defined as being only “vulnerable,” a category that is better than “endangered” under the IUCN rating. Vulnerable monkeys include the black-crowned dwarf marmoset and the Natuna Island surili. The gelada, a type of baboon found in Ethiopia, is one of the only monkeys to earn the IUCN “Least Concern” ranking.",
    "Similarity": 5
  },
  {
    "Name": "Nyala",
    "Text": "“The Nyala is one of the oldest antelopes in Africa.” Scientists believe that this shy member of the Bovidae family has been around for close to 6 million years and has been a separate species since the end of the Miocene era, which makes it only second to the lesser kudu when it comes to species longevity. Because of this, some believe it’s high time to put the nyala in its own genus, but for now, it remains a member of Tragelaphus . For even more information about this stunning antelope , read on: Here are some amazing facts about T. angasii : The scientific name of this antelope is Tragelaphus angasii. Tragelaphus comes from the Greek words trágos , which means “billy goat” and élaphos , which means “deer.” It was once placed in the genus, Nyala , but it currently remains in the genus Tragelaphus. The British zoologist John Edward Gray bestowed the name Angasii on this species, naming it after George Fife Angas, who was the father of the naturalist, George French Angas, who first described the animal in 1849. There are no subspecies, and the animal called the mountain nyala is only distantly related. A female nyala looks very much like a deer . She does not have horns and stands a little less than 3 feet tall at the shoulder. She has a reddish-brown coat, at least 10 white, vertical stripes along her sides, and a crest of dark hair that runs all the way down her back. The males begin life with the same colors as their mothers. Biologists believe this saves them from aggression from older bulls. As they grow their coats turn a dark, almost bluish-gray, and their stripes start to fade. Bulls also have spiraling horns that can grow as long as 2.6 feet and are tipped with yellow. The bull’s lower legs are also yellow. The ears of both sexes are large and call to mind the mule deer. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Along with the hair down the spine that they share with the females, male nyalas also have a fringe that begins in the middle of their chest and moves down their belly. Both males and females have white spots on their faces, throats, knees, and thighs, including a white chevron-shaped patch between the eyes. The tail is bushy, medium-long, and has a white underside. Identification of T. angasii and identification of the kudu can be a little tricky, for both antelopes live in southern Africa and both are members, for the time being, of the Tragelaphus genus. The greater kudu is Tragelaphus strepsiceros and the lesser kudu is Tragelaphus imberbis . Both nyalas and kudus have vertical stripes down their sides, white “V”s between their eyes and the males of both species have spiraling horns. One characteristic that helps in the identification of the kudu (Pronunciation: KOO doo) is that it is a much bigger antelope than the nyala. The greater kudu can be from 6.5 to 8.25 feet long, stand 5 feet tall at the shoulder and weigh between 260 and 690 pounds. Indeed, the greater kudu is one of the world’s tallest antelopes. Even the lesser kudu is taller than the nyala at 4 feet tall. The horns of the kudu are even larger in size than those of T. angasii or any other antelope and their spiraling is even more spectacular. The kudu’s horns can be 5.5 feet long. The color of the adult kudu male’s hide is also different than that of the T. angasii bull. The colors range from chestnut to blue-gray, but its stripes do not fade like the stripes of the nyala bull. Kudu males also have beards, which isn’t seen in T. angasii . Kudus are also herbivores, but they live in more locations and habitats than nyalas. They’re not only found in southern Africa but in eastern Africa, and they’ll live wherever there’s good cover. They’re also seasonal breeders in their southern range where nyalas can breed all year. Nyalas, especially females, live in loose groups that can range from two to 30 antelope, but old males are solitary. They are wary animals and graze and browse during the evening and at nighttime. During the day they hide in the bush to avoid the heat as well as predators. When they sense danger they give out a peculiar barking call, and they can also understand the alarm calls of other types of antelopes as well as baboons. They’re often seen around baboons because the primates toss down the leaves and fruit that the nyala like to eat. They are found in savannas that give them lots of coverage and are near fresh water and lush grass. These locations can be found in South Africa, Zimbabwe, Mozambique, southern Malawi, and Swaziland . They are also found in game reserves such as Kruger National Park . If the antelopes have territories, they overlap and are not well defended. Like most antelopes, the nyala are herbivores. Their diet is made up of a variety of plants, and they consume flowers, fruit, leaves, and twigs. When the grass is lush during the rainy season they eat grass, and though they can go a long time without water, they prefer to live near a freshwater source. Despite its magnificent looks, T. angasii isn’t a very big antelope. Indeed, lions tend to disdain it, and it is taken by prides of bachelors who don’t have females to hunt for them and find the nyala easy pickings. The antelope is just right for the leopard , for it is small enough to be cached in a tree. Other predators are wild dogs and hyenas . Baboons and birds of prey snatch babies, and of course, humans hunt the antelope for its meat and beautiful horns. Other threats to the antelope are poaching and habitat loss due to agriculture. They are also vulnerable to parasites such as nematodes, trematodes, lice, and disease-spreading ticks . They can also suffer from heart disease. T. angasii can breed all year, but breeding usually peaks in the spring. The female’s estrus cycle is a bit odd, for estrus lasts for 19 days and she’s only receptive for about six hours. Since she’ll be courted by a male for only two days, he needs to court her during the few hours that she’s ready. Bulls sometimes fight over females. Given the size and power of their corkscrew-shaped horns, they will occasionally fight to the death. Usually, the smaller of the two will give up and walk away. After mating, the cow is pregnant for about seven months and gives birth to a calf. The calf weighs about 11 pounds and is birthed in a hidden place that protects it from predators. It will stay there for about 18 days, and its mother comes back now and then to nurse it. Calves are weaned when they’re about seven months old, and male calves stay with their mother until she’s ready to have another baby. At that time the bull drives him away, but females tend to stay with their mothers even after they’ve had their own calves. Females are ready to breed when they’re about a year old and males are ready when they’re a year and a half, even though they are not really mature until they’re five years old. If they survive poachers and predators, a nyala can have a lifespan of about 19 years. There are an estimated 30,000 wild T. angasii in the world, and most of them live in protected areas. Their conservation status is least concern .",
    "Similarity": 1
  },
  {
    "Name": "Klipspringer",
    "Text": "Klipspringers are monogamous and mate for life. Klipspringers derived their names from the Afrikaans language, and their name is directly translated to “rock jumper.” This is due to their unique ability to navigate their rocky habitat by jumping from rock to rock. They are fiercely loyal animals and live in pairs and in small families. You will find them in Sub-Saharan Africa , where their preferred habitats include desert, rocky areas, savannah, and shrublands. The klipspringer’s scientific name is Oreotragus oreotragus , a small antelope genus. Its common name, klipspringer, is derived from the Afrikaans language meaning “rock jumper.” They belong to the family Bovidae, which includes animals like: In addition, they form part of the same class as humans, Mammalia . Characteristics of mammals include: Scientists have discovered 11 sub-species, namely: The klipspringer is a tiny antelope that stands at the height of 2 feet tall and weighs between 20-40 pounds. The males have hollowed-out horns, and depending on their location; females also have horns. In Southern Africa, females are born without horns; however, they develop horns to defend themselves from a significant amount of competition among klipspringer for resources in the eastern territories. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Its fur is bristle-like and thick, but the hairs are hollow and make a rustling noise when shaken. Their hair acts as insolation from the severe climate and protection from the harsh terrain. They come in various colors depending on their location, but grey, yellow, and brown are the most common. But, the klipspringer’s most prominent characteristic is its tiny hooves shaped like cylinders, making it appear to be standing on its tippy-toes. These dainty hooves are the size of a dime but provide the klipspringer with the agility it needs to navigate the rocky slopes. Klipspringers live in pairs or small family groups. They are very territorial, but otherwise, they are very shy animals. If threatened, they will give off a warning whistle through the nose, and flee to a safe location with their partners. To show affection when greeting, they rub against each other’s cheeks. Klipspringers can jump between 10-12 feet in the air and often stand on their hind legs to reach tall branches. The sub-species in Namibia have also been seen climbing in trees up to 17 feet 9 inches high. Klipspringers can be found scattered across Africa, with sub-species extending from Sudan all the way down to South Africa . They prefer rocky areas where they can quickly flee from predators by seemingly jumping from rock to rock. Klipspringers can survive at high altitudes (up to 15,000 ft), and they are even found on the slopes of Mount Kilimanjaro. They prefer hot or arid regions with sparse vegetation and koppies (rocky hills). They are primarily nocturnal and rest during the hottest time of the day. Klipspringers are herbivores and can survive on a wide selection of vegetation, and by consuming a large number of succulents, their need for water significantly decreases. Klipspringers primarily survive on succulents; however, they also eat flowers, fruit, shrubs, grass, seeds, and forbs. Klipspringers are preyed upon by various carnivores like leopards , baboons , spotted hyenas , eagles , caracals , and jackals . Klipspringers always need to be on the lookout because they have a lot of predators. They need to worry about big cats and hyenas from the ground and from above, the eagle. Their calves fall victim to baboons and snakes as well. Predators will have to ambush these stealthy antelopes because they usually have a lookout and flee before anything can get too close. Klipspringers are of least concern on the IUCN Redlist . Therefore, there are no plans in place to protect this timid species as yet. Just like the dik-dik , klipspringers live in monogamous pairs and mate for life. The female comes into sexual maturity between the age of 7 months to 1 year, and their gestation period lasts for about six months. Their mating season occurs every 16 months, usually between the months of August and September. They give live birth to 1 calf, which weighs around 2.2 pounds. The calves are born with their eyes open and start walking minutes after birth. The mother weans her calf when it reaches 4 to 5 months, and adolescent males will leave the group at six months old to find a new territory. Female calves mature to the age of 1 year before leaving their mothers. Adult males are fiercely protective of their young, but the females hide their calves in dense vegetation for the first three months of their lives to protect them from predators. Klipspringers have been known to live as long as 18 years in the wild. However, their average lifespan is usually around 15 years. The klipspringer is in no immediate danger and has a healthy population spread out over sub-Saharan Africa. According to the IUCN , their estimated population is over 40 000. The highest concentrations of klipspringers are seen predominately in Malawi, Ethiopia, and South Africa. As these nimble antelopes mainly live in protected areas, not much threatens their existence. However, the western subspecies, mainly in Nigeria , are decreasing in numbers. If you would like to see the klipspringer in person, there are four zoos in the United States where you can visit them. These zoos include:",
    "Similarity": 1
  },
  {
    "Name": "Boerboel",
    "Text": "Dutch farmers in South Africa first bred the Boerboel in the 17th century from a nameless ancestor similar to a Mastiff . Dutch South African farmers, called Boers, produced this dog with indigenous African wild dogs to create what we know today as the Boerboel. It’s suspected that Rhodesian Ridgebacks also had a hand in creating the breed. Farmers needed tough dogs who could work in hot climates and stand up to predators such as big cats, baboons, and hyenas. Boerboels are famously loyal and protective, and later, when diamond mining became more prominent in South Africa , miners used them to protect their territory. These large, confident dogs are well-muscled and exceedingly obedient, making them perfect as working guard dogs or loveable family pets. The Boerboel breed has a fascinating history that is rooted in South Africa’s colonial past. The settlers who moved to the area in the mid-1600s were primarily from Holland, Germany, and France, and they brought with them large guard dogs to protect their land from wild animals. These early dogs included bull and mastiff types, which were crossbred over time to create what we now know as the Boer Dog. With further refinement of this breed, the Boerboel emerged as a distinct type of dog that was specifically bred for life on a farm. In fact, it earned its name “farmer’s dog” because it was such an important part of daily life for these settlers. While other breeds may have been more suited for hunting or guarding livestock, the Boerboel excelled at both tasks. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . One thing that sets this breed apart is its agility and strength when facing off against dangerous wildlife like lions and baboons. Despite being fierce defenders of their territory, however, they are not snarly brutes constantly seeking out fights. Rather than relying solely on brute force to protect those they love, Boerboels are also sensitive enough to discern friends from foes and take cues from those around them. Another remarkable aspect of this breed is its versatility. While strong enough to compete in weight-pulling competitions alongside larger breeds like Mastiffs or Rottweilers, they are gentle enough to work as therapy animals for children or elderly people with disabilities. The Boerboel is a massive, muscly dog whose weight can clock between 150-200 pounds. As a giant breed, these dogs require special nutrition with plenty of protein, omega fats, and many calories to keep them happy and healthy. Boerboel puppies benefit significantly from giant breed puppy dog kibble or formula containing optimal calcium and minerals levels to facilitate healthy bone growth. A food brand with lots of meat as the primary ingredient should provide them with plenty of protein to help them grow. For growing Boerboel pups, we at A-Z-Animals recommend American Journey Large Breed Puppy . Once your Boerboel hits one year old, it’s time to switch to adult food. High-quality kibble with plenty of nutrients is essential for health. Protein is the main focus of these large dogs’ diets to fuel muscle mass and keep them energized. Omega fats are another crucial part of this breed’s diet, so kibbles with fish oils are also beneficial. One brand we recommend here is Blue Buffalo’s Wilderness Rocky Mountain Red Meat recipe for large breeds; it’s sure to sate the picky Boerboel’s stomach and meet his nutritional needs. Unfortunately, Boerboels are prone to weight gain and can put on a few unhealthy pounds if his diet isn’t kept in check. Keep an eye out for extra treats and snacks, and opt for a diet-friendly kibble to help monitor weight. The Boerboel female’s average high ranges from 22-25 inches tall, and males are capable of reaching about two inches taller. On average, males can weigh up to 200 pounds when fully grown, with females weighing about 180 pounds at most. While the Boerboel is typically a healthy dog breed, it’s important to source your pup from a responsible breeder who will scan for typical stock health conditions. These dogs are known to develop elbow and hip dysplasia, eyelid disorders such as ectropion and entropion, and heart disease. It’s advisable to look into the medical histories of your pup’s parents and to consider whether a potential health concern will fit into your lifestyle. In short, Boerboel’s can develop issues with: Boerboel dogs feature a lovely temperament and are affectionate with families and especially young kids. These dogs are calm, brilliant, and incredibly loyal and must be an integral part of their family to be at their happiest. Their natural guarding instinct makes socialization a necessity early on in their lives, and structured obedience training should start at puppyhood and continue into adulthood. New pet owners seeking guidance on taking care of Boerboels at any stage in their lives must consider a range of unique factors. Maintenance, regular exercise, and training all play a role in determining whether this breed fits into your lifestyle and family. These dogs are relatively low maintenance when it comes to their coats. A simple, subtle brushing will keep it glossy, and these dogs keep themselves regularly clean. Owners should take care to trim nails and clean ears periodically, and – as always – daily teeth brushing is a must. Unsurprisingly, the Boerboel has a protective and territorial disposition and is usually wary of strangers or newcomers to the house. Socialization early on in their lives can help reduce shyness or potential aggression. Boerboels may benefit from living with an experienced dog owner and trainer who will spend time playing, training, and exercising. Obedience training from an early stage will establish the owner as the pack’s Alpha and prevent a Boerboel puppy from thinking he owns the place. Boerboels are surprisingly agile for their size and muscle mass. Pups can also be energetic and benefit from regular exercise, preferably in a securely fenced front or backyard. This breed loves competition and can participate in agility, protection sports, obedience competitions, and working on farms. Mothers can produce anywhere between 7 to 10 pups in their litters. The babies arrive pretty large, particularly compared to other newborn dogs, but they still require attentive care. Avoid large groups or grabbing hands in the early days, as puppies can easily be frightened or traumatized. Puppies need socialization early on to prevent any potential development of aggression. Regular visits with new people, new situations, and new dogs will prevent anxiety and keep away other negative traits such as shyness or over-protectiveness. While the breed makes fantastic family pets and is exceedingly affectionate, they can be very protective of children from the same household. They may not show the same friendliness to child strangers and should be properly introduced to any newcomers. The Boerboel is closely related to several watchdog breeds, including the Bullmastiff, the Cane Corso , and Rottweilers.",
    "Similarity": 0
  },
  {
    "Name": "Mandrill",
    "Text": "“ The mandrill has a truly unique appearance that sets it apart from other primates. “ Although nearly weighing as much as an ape, the mandrill is actually a type of monkey, splitting its time between the ground and trees. Its bright facial colors and oddly shimmering fur are instant head turners for gawking tourists and zoo-goers alike. However, the spread of human civilization has threatened the survival of the species throughout its native habitat in Africa . The scientific name for the mandrill is Mandrillus sphinx . It is named after the ancient Greek mythological figure that had the head of a human and the body of an animal, perhaps reflecting its strange appearance. The mandrill is part of the family Cercopithecidae , which includes all Old World monkeys . As the name implies, the Old World monkeys live exclusively in Africa and Asia . This distinguishes them from the New World monkeys, which live in the Americas. The physical differences between them are subtle, but Old World monkeys lack a prehensile tail and have a more prominent nose. As a result of convergent evolution, which is when a species inhabits similar ecological areas and adapts similarly to the same selective pressures, the mandrill, as well as the drill, was originally classified as a forest baboon as they had many baboon-like traits. While the exact history of the mandrill is not well known due to a lack of fossil findings, the first monkey appears around 34 million years ago, during the Eocene era, which then led to the evolution of the Old World Monkey, in the Miocene era, 24 million years ago. The mandrill is only one of two living species in the genus Mandrillus sphinx . The other living species is the Mandrillus leucophaeus , commonly known as just the drill. Both of these species have similar social structures, habitats, and appearances, but the drill is also far less colorful than its vivacious sibling. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Unique in appearance, the mandrill is an animal that features a very long muzzle, a prominent brow, and a short, almost nonexistent tail. This is complemented by an elegant coat of dark green and gray fur with tufts of white hair on its stomach and a long, yellow beard. Combined with its long, muscular limbs, compact body, and enlarged head, the mandrill looks a bit unusual to the human eye, as if it was put together from various parts. But the species is actually quite adept and agile with a large range of movements and postures. Though normally walking on all four limbs, the mandrill can also sit or lay down on its rather thick rear end. It also has opposable thumbs and big toes for grasping objects and climbing trees. The animal spends part of its life above ground, jumping from branch to branch. The most recognizable aspect of the mandrill’s appearance is the exotic markings on certain parts of the body, including the bright red ridges of the nose and mouth, light blue cheeks, and colorful rear end. These markings actually serve an important social function. When incensed or worked up, some of the colors on the body will become more intense. A display of the rump may also demonstrate submissiveness or female mating availability. In sheer size, the mandrill is perhaps the largest of the Old World monkeys. The male of the species can weigh around 70 pounds and possibly more than 100 pounds while reaching a height of more than 30 inches. The mandrill size is about the same as a large dog. However, the female is significantly smaller than the male; it weighs only around 30 pounds. This extreme difference between the mandrill size in sexes is one of the largest among primates. Another important sexual distinction is that males tend to sport brighter colors. This has important implications for the mating behavior of the species, since brighter colors may signify dominance. The massive canine teeth are normally hidden from view, but when the mandrill opens its mouth, they become very apparent. Coloration is only one aspect of the mandrill’s vast array of communication strategies. Visual signals, body posture, scent markers, and vocalizations are used to convey all sorts of information for mating, playfulness, warnings, and other behavior. For example, the exposure of teeth is one of the most common signals. It is actually a sign of friendliness and joviality rather than an aggressive action. If the mandrill does become angered, then it will visibly slap the ground with its hands and stare with intensity at its target. Grooming is another common behavior that helps to reinforce bonds between members of the group. They will also use various vocal sounds such as grunts and howls to communicate mood, especially if they lose visual contact with each other. And the presence of a scent gland on the chest enables them to signal their presence by rubbing various chemicals on objects. Because social relations are such an important aspect of their behavior, mandrills seek safety in large numbers. A single group, known as a troop or horde, can consist of around 50 members, though some groups may join together for short periods of time. The largest group ever recorded was around 1,200. The horde has a distinct social hierarchy in which every member has a place. At the top of the hierarchy is a single dominant male who has exclusive breeding rights and the responsibility to defend the group from outside threats. The health and stability of the entire horde can often depend on the actions of the leader. Male and female mandrills exhibit very different relationships within and to the group. Males tend to wander away from the group after reaching full maturity and will sometimes form all-male bachelor groups. The females stay within the same group of their birth, which often allows them to form strong lifelong bonds with each other. Mandrill intelligence isn’t quite as well-explored by scientists as gorillas and chimpanzees , but observations in captivity and the wild have documented a variety of different tool uses, both to hunt for food and for grooming. Studies also suggest that they are capable of displaying decent long-term memory, facial recognition, and problem-solving. Mandrills primarily live in the forests of Western Africa, often adjacent to rivers, wetlands , or savannahs. The animal’s main range straddles the countries of Congo , Gabon , Cameroon , and Equatorial Guinea . Although primarily adapted for a terrestrial lifestyle, this species actually gathers together at night in the trees for safety and comfort. They have a tendency to switch between different trees every night within their range. According to the IUCN Red List, which classifies the conservation status of many species, mandrills are currently vulnerable to extinction. Exact population numbers are unknown, but habitat destruction from agriculture, industry, and human settlements appears to be the leading cause of their slow decline. Mandrill bushmeat, or the hunting of wildlife for food, is still an ongoing practice in 21st-century Africa as well. In order to prevent their extinction, conservation efforts are focused on the institution of anti-poaching and surveillance measures to prevent excessive hunting. Conservationists also need to work with local governments to halt the decline of natural habitats. Mandrills don’t yet need emergency measures to survive, but the downward trend in numbers is worrying. Mandrills are expert foragers that hunt both plants and small animals such as fungi, roots, seeds, fruit, insects , worms, amphibians, lizards , snakes , snails , eggs, and small mammals. Their diet is truly prolific and may include as many as a hundred different species. The mandrill sexes pursue different hunting strategies. Adult males tend to forage on the ground, whereas females and children tend to forage in the trees. The mandrills play an important ecological role by helping to disperse seeds around the local forest environment. Because of their large size, mandrills have few natural predators in the wild, except for leopards and, of course, humans, who have traditionally hunted them for food. Mandrills may be killed by accidental contact with venomous snakes too. The size of the group alone provides plenty of protection against danger, but if an individual is cornered, then the large canine teeth also provide a suitable defense. More recently, habitat loss has been another significant danger to their continued existence. Mandrills form a harem-type society in which a single male has exclusive mating rights with a group of females. In an interesting twist, the females actually choose which males they will breed with. One theory is that the females select the male with the brightest colors because the intensity of the colors is a direct reflection of the male’s testosterone level, which denotes its health and physical viability. This is an example of sexual selection in which one sex develops exaggerated features to convey information and help the opposite sex choose an appropriate mate. Another possibility is that male coloration becomes brighter only after being selected by females. Either way, male aggression does occur and sometimes turns deadly, but it’s not as pronounced as you might expect. The timing of the breeding season varies based on food supply, but it tends to occur every two years between the months of July and October. The female will carry the young for about six months from around January to March before finally giving birth. Only one mandrill is produced at a time, while twins have only been observed in captivity. For the first two months of its life, the young mandrill sports a black coat and pink skin, which will develop into its regular coat over the ensuing months and years. The mother provides the vast majority of the protection, feeding, and grooming, while the father contributes very little directly but may help indirectly by protecting the group. After achieving independence, the young mandrill must find food on its own and work its way through the ranks of the group hierarchy. A female mandrill will reach sexual maturity after a minimum of four years. Males, on the other hand, take a full nine years to reach sexual maturity. Mandrills typically live more than 20 years in the wild. The highest lifespan ever recorded was 46 years in captivity. Mandrills are a regular fixture at the San Diego Zoo . The first pair of mandrills, Peter and Suzy, arrived in 1923 but never reproduced with each other. The zoo later established a breeding program in 1938 and maintained a consistence presence of mandrills ever since, even welcoming a new child in 2016. Mandrills are also a regular sight at the Denver Zoo , the San Francisco Zoo , and the Columbus Zoo and Aquarium .",
    "Similarity": 5
  },
  {
    "Name": "Macaque",
    "Text": "Clever, social, and highly intelligent, the macaque is among the most common primates in the world. The macaque is a genus of more than 20 Old World monkeys (meaning monkeys that originated from the Eastern Hemisphere). These are naturally charismatic primates with very complex behaviors and social structures. Many species have learned to live near and around humans, resulting in frequent interactions. Some of the most well-known species include the lion -tailed macaque, the crab-eating macaque, and the rhesus monkey. The scientific name of the macaque genus is Macaca . This is the feminine form of macaco, meaning the Portuguese word for monkey. They belong to the family of Old World monkeys, along with baboons , doucs , and mandrills . There are 23 species in the macaque genus: the Barbary, lion-tailed, southern pig-tailed, northern pig-tailed, bonnet, assam, Tibetan, white-cheeked, arunachal, siberut, moor, booted, tonkean, Heck’s, gorontalo, Celebes crested, rhesus , Formosan, Japanese , crab-eating , stump-tailed, tocque, and Pagai Island macague. Humans and macaques share approximately 93% of their DNA with each other (compared to 98.8% with chimpanzees). Humans last shared a common ancestor with macaques some 25 million years ago. This is essentially when the primate lineage split off. One group led to modern monkeys, whereas the other group led to modern great apes like us. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The macaque is a medium-sized monkey, generally measuring up to 28 inches and 40 pounds in size, with a somewhat long, rounded muzzle and nostrils located on the upper surface. The males are generally a lot larger than females, but otherwise, it can be difficult to tell them apart. The fur is usually some shade of brown or even black and thins out around the facial area. The arms are nearly the same size as the legs, making it easier to climb in trees. Despite these similarities, each species has its own unique characteristics. The lion-tailed macaque, for instance, has a massive white mane of hair surrounding its face, whereas the Celebes crested macaque has a black crest of hair on the top of the head, almost like a mohawk (this species was the subject of the famous smiling monkey selfie photo ). The tail is another characteristic that varies widely; some species have exceptionally long tails, whereas in other species it’s entirely absent. The primary social unit of the macaque is the troop. Composed of several females, a few males, and their offspring (ultimately totaling a few dozen or even more than a hundred individuals), these troops are primarily defined by dominance hierarchies. The females generally form strong and long-lasting matrilineal hierarchies in which the dominance rankings are passed down from mother to daughter. The males also have a separate dominance ranking based mostly on strength, but it tends to shift more frequently as the males come and go from the troop. Young males in particular that don’t belong to any particular troop may form their own separate bachelor groups. The hierarchy is extremely important because higher-ranked members have better access to food sources and mates. Group cohesion is generally maintained through familiar activities such as grooming. Physical contact is also a good way to reduce stress after a bad encounter. Females are more likely to groom each other, but males will also groom females in the mating season. There are numerous ways macaques communicate their moods and intentions with each other. An open-mouthed glare with a loud bark or screech conveys threat or aggression. This may be accompanied by branch shaking, lunging, or slapping the ground. Tail-up may indicate alertness or sexual presentation. Grunts, coos, and whimpers are all part of their verbal repertoire as well. In short, their behavior is incredibly complex and interesting. As a relative of modern humans, it’s no surprise that macaques are some of the cleverest animals on the planet. There are reports that crab-eating macaques use stone tools to open up nuts and shells. They also wash their food in the water to clean it. Some macaques in popular tourist destinations will steal food right from the hands of people, or they’ll steal objects and barter for tasty treats. In the wild, macaques spend a good deal of their time in the trees, searching for food and looking out for predators, but they also are equally as comfortable on the ground. They are great climbers, good runners, and even quite adept at swimming. Macaques are highly adaptable animals that live in a variety of different habitats, including urban settings next to people. Most are primarily found in tropical rainforests, mountains, or plains throughout Asia , but a single species, the Barbary macaque, is located in North Africa as well. The highest concentration of macaques (with some seven species) is found on the Indonesian island of Sulawesi . Other species live in Taiwan , Japan , India , China , and Southeast Asia. These primates are facing enormous challenges from humans in the wild, including habitat loss and poaching. While they are capable of adapting to human-caused changes, many species cannot survive having their natural habitats fragmented and destroyed by farms, plantations, and towns. The macaque has only a few predators in the wild, including tigers , crocodiles , snakes , leopards , and birds of prey. They can run into the trees and even mob predators for protection. Macaques are primarily herbivores; their diet consists mostly of fruit, but also seeds, leaves, flowers, and tree bark. They will sometimes supplement this with insects , but this is uncommon. When living next to people, they can become a nuisance by raiding agricultural crops such as bananas, tomatoes, and mangos. They also like to receive free food from people in popular tourist destinations. There are reports that macaques will steal valuable objects from people (such as glasses, jewelry, or shoes) that they then barter for food. Sometimes they will only accept food with the highest nutritional value. Macaques are promiscuous breeders within their group. They generally mate with whomever they want throughout the year. Higher ranked females typically mate more often and give the baby better access to food. Every year or two the female will give birth to a single offspring after a gestation period lasting five to six months long. The young baby will begin to consume solid foods at about two weeks after birth, but it may take more than a year to wean the baby fully from the mother’s milk. They develop important social skills by playing with other infants in the troop. The juvenile still remains close to and dependent on its mother until the birth of a sibling. By 18 months, they will finally start to consume the same foods as an adult. Females generally stay with the troop of their birth; they reach sexual maturity after about three or four years. Males, on the other hand, leave their original troop to find a new one. Many young males end up in bachelor groups until they’re old enough to join a larger troop. They can take up to seven years to reach maturity. The average lifespan of a wild macaque is less than 15 years, partly due to disease and predation, but captive macaques can live more than 25 years old. As macaques start to reach old age, they develop many of the same health problems as humans, including arthritis, cataracts, diabetes, and obesity. Females generally start to go through menopause at 25 years of age. The maximum recorded lifespan was about 40 years old in captivity. According to the IUCN Red list , many macaques are threatened with extinction. For instance, the endangered lion-tailed macaque of India is thought to have only about 2,500 individuals remaining. It is ranked as one of the most threatened primates in the world. Only the Japanese macaque and the Rhesus monkey are classified as species of least concern . Conservation efforts have focused on maintaining their existing habitat in the wild. This usually involves working with local governments and individuals to make sure the macaques have enough space to roam and feed.",
    "Similarity": 5
  }
]
