[
  {
    "Name": "Barb",
    "Text": "Barbs are freshwater fish belonging to a family of 1,184 species. They are popular aquarium fish because of their brilliant colors of gold, orange, rosy, silver, and cherry, along with others. Also, they are available for an inexpensive price at pet shops. Though small in size, they’re aggressive predators of fish, crustaceans, and insects. • Breeding colors: The rosy barb is notable for changing colors during the breeding season to attract mates. Male rosy barbs change from silver to a combination of gold and red. It’s rare for a female rosy barb’s yellow and pink scales to change, but the color does become more intense. • Tough fish: Barb fish have an aggressive nature. They’re likely to eat smaller types of fish. This is why aquarium owners should only pair barbs with other barbs or larger types of fish. • High adaptability: These fish have the rare quality of being able to adapt to changes in their habitat. This includes changes in water temperature and pH level. The scientific name of the barb fish is Barbus barbus . The Latin word Barbus translates to beard. The word beard refers to the barbels or bristle structures on barb fish. Look very closely at the Zebra barb and the Denison barb, and you’ll find tiny barbels located near their mouth. These are used to sense and locate prey. They are in the Cyprinidae family and the class Actinopterygii. Just a few of the 1,184 species of barb fish: • Barbodes dunckeri • Puntius titteya • Sahyadria denosonii See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Cyprinidae family contains hundreds of species that vary in size and color. This is what makes them so popular with people looking to add dynamic fish to a freshwater aquarium without paying a high price. Some of the most notable and colorful examples of the barb family include: • Cherry barb: These fish live in the Kelani basin near Sri Lanka. Normally, they have brown or tan scales with red and orange tones. But, during the breeding season, males turn a brilliant cherry red. • Tiger barb: It’s named for both its color and behavior. It has silver scales featuring black stripes with orange highlights on its fins and mouth. Not only does it have a color pattern like a tiger, but this fish is also known to nip at the delicate fins of other fish! • Gold barb: The gold barb is also called a Chinese barb because it’s from the Red River basin in China . This three-inch fish adds a flash of orange or gold scales to its aquarium habitat. Gold barbs are one of the common types sold in pet stores. • Rosy barb: These fish are native to the northern part of India. Rosy barbs have glowing red scales and a forked tail. They’re a little bigger than most barbs at six inches. The different types of barbs can be orange, red, black, gold, striped, or even rosy. Some barbs are as small as two and a half inches, like the black ruby barb, while other types can measure 12 inches long. The longest is the Tinfoil barb at 13.7 inches. Alternatively, some of the most popular barbs, like the gold barb and the Tiger barb, are three inches in size. These small fish have tiny barbels or bristles near their mouth. Barbels are used in the wild to find prey in murky water. Barbs have an aggressive nature. Along with eating algae, they are excellent hunters. They go after smaller fish , worms , and crustaceans . It’s important for an aquarium owner to avoid putting smaller fish in the same tank as barbs. They are likely to eat the smaller fish! Birds and larger fish are predators of barb fish. Not surprisingly, it’s difficult for a brightly colored barb to blend in with its environment to escape. So, these animals rely on their quick swimming abilities to get away from threats. Also, barbs live in schools allowing most of them to escape when they encounter a predator. Barbs are freshwater fish. Different types of barbs are from different regions. For instance, the gold barb is native to rivers and streams around China, Vietnam, and Taiwan. Rosy barbs live in lakes and streams around India. Tiger barbs are found in Borneo and Malaysia . These fish can live in bodies of water three to 16 feet in depth. The IUCN Red List reports the barb fish as Least Concern , but with an unknown population. There are no conservation efforts in place for these fish. Barbs are omnivorous. They are notable for eating a variety of both plants and animals in their habitat. In the wild, barbs are eaten by larger fish, reptiles, and birds such as seagulls . They are also captured by humans for breeding and sale to aquarium enthusiasts. Despite these threats, they are listed as the Least Concern. They eat algae, smaller fish, insects, and crustaceans. They are aggressive hunters and may go after larger fish, but that’s rare. Usually, their prey is smaller. Barbs reach sexual maturity at six weeks old. In the spring, when the water is warm, a female barb releases 200 to 300 eggs into the water at one time. A male barb releases sperm and fertilizes the eggs. The eggs hatch in two to three days. Someone breeding barbs should know these fish are likely to eat the eggs. So, it’s a good idea to put the male and female into another aquarium right away. Barbs are too small to eat. Their colorful patterns and inexpensive price have made them popular with fish enthusiasts of all experience levels. They are hardy fish living up to five years.",
    "Similarity": 4
  },
  {
    "Name": "Flounder",
    "Text": "With its remarkably thin body, the flounder fish truly lives up to the name of flatfish. Lying almost motionless along the sandy ocean or seafloor, the flounder fish waits patiently for a tasty meal to come by so it can feed. Its entire lifestyle and physical appearance are oriented around the bottom-dwelling habitat. This is an incredible display of evolutionary ingenuity. But due to its popularity as a cuisine, some species of flounder are in danger of population depletion. The term flounder fish is not a true scientific name . This has often inspired quite a lot of confusion among people. Instead, it refers to many different species of flatfish that are part of four distinct families: Achiropsettidae, Pleuronectidae, Paralichthyidae, and Bothidae. All of these families are classified within the order Pleuronectiformes. However, not every member of this order is a flounder fish, because it also includes the dabs, brills, soles, and others. Together these creatures belong to the class of ray-finned fish known as the Actinopterygii. The flounder fish is generally divided into right-eyed and left-eyed families. The right-eyed family of Pleuronectidae contains some 100 different species. The left-eyed families of Bothidae and Paralichthyidae contain approximately 240 species. The fourth family, Achiropsettidae, has only a few species in it. Here are just a few examples of common flounder species: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Flatfish in the flounder family are the most asymmetric animals on the planet – and, believe it or not, they weren’t born that way. They start their lives as normal little fish with swim bladders and eyes on either side of their head before they transform into their strange Picasso fish adult form. In a snapshot of evolution, their eyes shift to the top, their swim bladders shrink and their fins become almost useless in a matter of weeks. They begin life as lively little fish before they sink to the bottom to “flounder around” on the bottom of the ocean floor. All of this strange morphology started about 65 million years ago – and within three million years their evolution was largely complete. Three million years, in evolutionary time, is a blink of an eye. Flatfish species are so dissimilar that it was almost impossible for scientists to track the degree of integration between different regions of the skull across the 65 million year history of flatfishes and their relatives without the creation of complex mathematical models. They found that in flatfishes, the evolution of asymmetry involved changes all across the skull. As the eye migrated – other changes occurred and it became additive. There is still no explanation for why flatfishes like flounders changed so rapidly and drastically, almost violently – and fish like stingrays just gradually went flat. Sometimes the weirdness of nature is the most amazing thing about it. The flounder has an unusually flat appearance that’s well-suited for its bottom-dwelling lifestyle. To see everything above it, the flounder has two big round eyes projected from small stalks on the same side of the head. These eyes also can move independently of each other. The typical flounder specimen measures somewhere between five and 25 inches in length (the larger ever recorded was some 37 inches) and up to 22 pounds in weight. This doesn’t quite capture its true size, however, since the flounder has a massive surface area thanks to its round or oval body. The flounder’s scales act as camouflage which makes it difficult for both predators and prey to detect it against the muddy or sandy ocean bottom. Some species can actively change their color to blend in with the seabed. This has the dual purpose of also signaling the emotional state of the fish. For instance, a pale color may be a sign that the creature feels threatened. The flounder comes in a huge range of different colors and patterns, depending on the composition of the sediment in which it resides. The slate of orange, brown, green, white, or tan colors is normal. The flounder dwells at the bottom of oceans and seas near docks, bridges, and coral reefs. Its main areas of occupancy include the tropical and temperate waters along the coasts of Europe, North America, Africa, and Asia. Some species also reside much farther north near the Arctic. It is estimated that some 30 million flounders are still alive across the entire world’s oceans, but pollution, habitat change, and overfishing in the 20th and 21st centuries have depleted some stocks. For many species of flounder, there is not enough data to fully estimate their conservation status. But when data is known, the vast majority of species appear to be in good health. The conservation tracker IUCN Red List believes that they are of least concern . However, the continued depletion of fish stocks may threaten many species in the future. In the United States, the National Oceanic and Atmospheric Administration is the main governmental body in charge of carefully managing flounder numbers. The administration uses scientific data to determine how much of the flounder population can be harvested for the following year, and then it allocates resources accordingly between commercial and recreational catches to ensure that enough stocks are present to repopulate the waters. The flounder fish is primarily a nocturnal carnivore that thrives on a diet of shrimp , crabs , and other fish . Smaller species may consume worms and plankton as well. The exact composition of the diet varies quite a bit by location and species. The flounder is an ambush predator that lies motionless on the ocean or sea floor, blending in with the environmental surroundings, and then quickly snaps up the unsuspecting prey with its sharp teeth. Because of its relatively large size, the flounder has only a few natural predators such as sharks, eels , and humans . Camouflage offers the best means of protection. When exposed, however, it is very vulnerable to larger predators due to the lack of other natural defenses. The flounder’s breeding season usually takes place during the warmer months. The female will release more than 100,000 (and sometimes millions of) eggs from her body, and the male will release his sperm to fertilize them. After a few weeks, the young fry will hatch from the eggs. The spawning is usually timed perfectly with the most productive and bountiful season of the year for food. At birth, the flounder fish looks like a typical fish. It is born with a standard symmetrical appearance with eyes located on both sides of its head and also swims around the ocean like a fish. After a few days of this, the flounder undergoes significant physical changes in which the body begins to flatten out, the swimming bladder (which provides buoyancy) disappears, and one eye begins to migrate to the other side of the fish. Once it has fully developed, the flounder tends to live some three to 10 years in the wild. Captured for both recreational and commercial purposes, the flounder is one of the most popular deep-sea fishes to eat around the world. It is commonly fried, broiled, or grilled, but it is cooked in so many different ways and served with so many different foods that the variety is truly staggering. The mild taste goes along well with all kinds of sauces, herbs, spices, vegetables, and cheeses.",
    "Similarity": 3
  },
  {
    "Name": "Guadalupe Bass",
    "Text": "The Guadalupe bass is a black bass species that is the official state fish of Texas . The Guadalupe bass is a black bass species native to Central Texas. It is closely related to the smallmouth bass and spotted bass and can be found in rivers, creeks, lakes, and reservoirs. The Guadalupe bass is the official state fish of Texas. This fish typically reaches around 12 inches long, with the occasional fish coming up to 17 inches. Guadalupe bass is relatively easy to catch and is popular among sports fishermen. They can be caught using various methods, including bait fishing, fly fishing, and spin casting. The Guadalupe bass gets its name from the Guadalupe River that runs through Texas, while its scientific name is known as Micropterus treculii . The word Micropterus comes from the Greek word mikros meaning small, and the Greek word pteron meaning wing. When you put it together, Micropterus refers to the specie’s small fin. Although this fish species doesn’t have a small fin, the reason it is named so is that an injured specimen that appeared to have a small separate fin was studied. On the other hand, treculii is named after the person that caught and discovered this fish, Trecul. The Guadalupe bass is olive-green in color, with dark vertical stripes running down its body. It has large eyes and a small mouth and can grow up to 17 inches long in some cases. This fish is strictly native to Central Texas and can be found in the state’s rivers, streams, and lakes. This fish is smaller than other basses, at only 1-3 pounds heavy, but it is still an impressive fish to many enthusiasts. This species of fish is closely related to the smallmouth bass ( Micropterus dolomieu ), but the two species have several key differences. The Guadalupe bass is generally smaller than the smallmouth, with adults reaching a length of around 12 inches. They are also darker in color, with a brown or green back and sides and a white belly. The most distinguishing feature of this fish is the dark vertical stripe that runs along its side, from just behind the gill plate down to the tail. The Guadalupe bass has undergone several changes over the years, most notably in its size and color – the fish has grown larger over time, and it has become darker in color. These changes are thought to be due to several factors, including changes in the environment and the introduction of new predators into the area. Despite these changes, the Guadalupe bass remains a widespread species in Texas. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Guadalupe bass is a predatory fish that feeds on other smaller fish, crustaceans, and insects. This fish is a very aggressive fish, and it is known for being a fierce predator. It will eat about anything that can fit into its mouth, including frogs, insects, and even small mammals in some cases. It is also known for being a very territorial fish and it will often fight with other bass species over territory. This bass is an excellent game fish and fishermen prize it for its strong fighting ability. Typically this fish inhabits streams and rivers with clear, cool water and rocky substrates. They are often found near undercut banks, submerged logs, or other structures that provide cover from predators. Due to their limited range and habitats vulnerable to degradation, this fish is considered a species of concern by the Texas Parks and Wildlife Department. However, they are still relatively abundant in many parts of their range. The Guadalupe bass feed primarily on crayfish . However, they are known to consume other small invertebrates and fish when available. Their diet consists mainly of freshwater shrimp, amphipods, isopods, and midge larvae. Invertebrates make up approximately 90% of their diet by volume. It is preyed on and eaten by various animals, including larger bass and birds. This fish primarily eats crayfish, shrimp, smaller fish, and insect larvae. This species is an important species for both recreational and commercial fisheries. The species has many potential predators, including other fish, birds, mammals, and reptiles. Other predators of the Guadalupe bass include the largemouth bass, smallmouth bass, and channel catfish . These fish are more significant in size than the Guadalupe bass and can easily prey on them. However, human activity poses the biggest threat to this population. Factors such as water pollution, habitat loss/degradation, and overfishing have all contributed to declines in the population. Another significant threat to the Guadalupe bass is hybridization with the smallmouth bass. Despite these threats, the Guadalupe bass remains one of the most popular sportfish in Texas. The Texas Parks and Wildlife Department (TPWD) has implemented several management strategies to conserve and rebuild the population. These include fishing gear/methods regulations, catch limits, size limits, seasonal closures, and stocking programs. This fish is an integral part of the ecosystem. Unfortunately, it faces many threats. The Guadalupe bass fish can spawn in late spring and early summer when water temperatures are between 60-80 degrees Fahrenheit. The female will lay between 400 and 9,000 eggs in a nest the male has constructed. Once the eggs have been laid, the male will chase away the female and guard the nest until the fry hatch and can swim on their own. There are several reasons why the nest is beneficial for the eggs. First, the nest provides shelter from predators and other dangers. Second, it helps to keep the eggs oxygenated and at a consistent temperature. Third, it gives the fry a place to hide when they first hatch. Overall, building a nest is an integral part of the reproduction process for male Guadalupe bass. By doing so, they are increasing the chances that their offspring will survive and thrive. When the eggs hatch, the babies are called fry. These fry are tiny and spend most of their time hiding in the vegetation. They will only come out to feed when it is safe. When they first start feeding, they eat small insects and other invertebrates. As they grow older and larger, they will begin to eat fish too. The fry grows quickly and can reach adulthood and sexual maturity within a year. Once they reach adulthood, they will start breeding themselves, and the cycle will continue. The average lifespan of this fish is about 6 years, although some individuals have been known to live up to 10 years. Several factors can contribute to their lifespan, including water temperature, food availability, and predation pressure. For instance, if the water temperature is too high or low, it can stress the fish and shorten their lifespan. Additionally, if there is not enough food available, the fish may not be able to get the nutrients they need and die prematurely. Lastly, if there is a lot of predation pressure from other animals, this fish may need more time to survive and reach their potential lifespan. Overall, the Guadalupe bass is a relatively short-lived species compared to other fish. However, many things can affect their lifespan, so it is essential to consider all these factors when determining how long a particular fish will live. Some threats to this fish species include, but are not limited to: According to the Texas Parks and Wildlife Department, the Guadalupe bass is one of the most popular sportfish in Texas. The estimated population numbers of these fish vary depending on which body of water they are found in. However, overall, it is estimated that there are between 2 million and 4 million adult Guadalupe bass in Texas waters. This information is vital because it helps us understand how this species is doing in terms of population numbers. It also helps us determine whether we must take measures to protect this species from becoming endangered or extinct.",
    "Similarity": 3
  },
  {
    "Name": "Orchid Dottyback",
    "Text": "This fish camouflages as its prey’s parents to trick it into becoming dinner. Orchid dottybacks are very popular aquarium pets because of the splash of color and activity they add to the environment. However, these bright purple fish are also crafty predators. They camouflage themselves in order to capture prey and manage to still look cute while doing it. The orchid dottyback belongs to the genus Pseudochromis and is classified as Pseudochromis fridmani . It is also a member of the famed dottyback family, Pseudochromidae . The generic name Pseudochromis is derived from two Greek words, pseudes meaning “false” and chromo meaning “color.” This is a nod to the abilities of the dottyback fish to mimic the appearance of its prey in order to increase the success of catching it. The specific name fridmani is to honor David Fridman, the man who collected the specimen in Israel. These fish are called dottybacks because of the colorful spots and patterns on their bodies. The orchid dottyback is also called Fridman’s dottyback or Fridman’s pseudochromis. Orchid dottybacks belong to the class of ray-finned fishes, Actinopterygii, which comprises over 50% of all vertebrate species alive. The earliest fossil record of an actinopterygian species was found to date back to the Late Silurian Period over 420 million years ago and belongs to Andreolepis hedei. Its remains have been discovered in Sweden, Estonia , and Russia . See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The dottyback order, Pseudochromidae, are distinguishable from other fish families by the spines in their dorsal fins which number three or less, and also by their partial lateral line organ. Dottybacks also possess special cells which enable them to camouflage themselves by changing their coloration. These cells are known as chromatophores and they contain pigment sacs. When the fish pulls on these sacs with the use of small radial muscles, they can expand and contract the pigment, thereby changing its color. They use this feature of theirs to hide from predators, and also to entrap other fish as prey by pretending to be one of them. The orchid dottyback is a beautiful vivid purple, saltwater fish. It is often mistaken for the purple dottyback fish ( Pseudochromis porphyreus ) which is also a bright purple color. However, the orchid dottyback can be identified by the black stripe that runs across its head and over its eyes. The orchid dottyback is a tiny fish, measuring from 2.7 to 3 inches long. The coolest thing about orchid dottybacks is that they have the power of mimicry. Just like other members of Pseudochromidae , the orchid can change its color due to the chromatophores it possesses. Chromatophores are skin cells that contain pigment and reflect light. This gives the fish the ability to steadily modify their coloration. Orchid dottybacks have no sexual dimorphism. They all look the same, especially at a young age. When they are mature, the females do tend to have bigger bellies and can be a bit stocky as opposed to the slenderer bodies of the males. The orchid dottyback is a small, unassuming fish, but beneath their flashy exterior exists a cunning master of diguise. Dottybacks are one of many species of the dottyback family Pseudochromidae that are known to mimic the appearance of their prey. Orchid dottybacks possess chromatophores, or pigmented cells on their scaly bodies that reflect light and allow them to manipulate their coloration. By doing this, they mimic the appearance of their main prey’s parents. Orchid dottybacks prey on juvenile damselfish by pretending to be their parents, and it works! Scientists who studied the behavior of these purple tricksters discovered that when the dottybacks mimicked the damselfish, they were three times as successful in catching their prey. Sometimes, they even travel with schools of damselfish for easy access to prey. The only downside to their neat trick is that, unlike some other camouflaging marine creatures like squids , the dottybacks cannot change their colors instantly. It usually takes them many days to do so. Fridman’s dottybacks also use their obscuring talents to hide from their predators by camouflaging as their background. It has been observed that dottybacks would usually rather disguise themselves as damselfish to hunt prey than disguise themselves as their background to hide from predators. It is clear where their priorities lie. Orchid dottybacks are great starter fish for beginner fish owners. They are a hardy species and feeding them isn’t an issue since they eat just about anything. However, these fish are very territorial and can get aggressive with their space. Adding new fish to an aquarium with existing dottybacks may lead to bullying, so dottybacks are best added later to an already occupied tank. Orchid dottybacks should be kept in a lidded tank as well because they are very active and love to jump. They can become quite accustomed to their owners and are known to follow their them around in the tank when they pass by. Orchid dottybacks are rapacious predators for their small size. In the wild, they mostly prey on other smaller fish, primarily juvenile damselfish. These purple fish have quite the appetite and can eat as many as 30 damselfish every day. Orchid dottybacks are very opportunistic eaters. In captivity, they will eat just about anything presented to them. They especially love meaty food items such as brine shrimp , frozen mysis shrimp, plankton, and live worms . They will also eat fish flakes. The orchid dottyback is native to the Red Sea. The Red Sea is reputable for its salty water which is perfect for the dottyback. It prefers tropical water and loves to make its home in coral reefs , holes, crevices, and regions with abundant rocks. This dottyback lives in fairly shallow waters of up to 196.9 feet in depth. The orchid dottyback is also very popular as aquarium pets. They used to be expensive to obtain from their native region, but the appearance of breeders and aquarists helped lower the cost for pet owners. The exact population of the orchid dottyback is unknown, but the species is listed as Least Concern on the IUCN Red List of Threatened Species . The orchid dottyback is a protogynous hermaphrodite. This means that they are born with the sexual organs of both female and male and can choose which one to become. These fish are initially born female. The larger fish within a group would become the male. The sexual dimorphism in the Pseudochromis fridmani species is low. It is almost impossible to tell the males and females apart. At times, mature females have full bellies, slimmer males, but this isn’t in stone. Orchid dottybacks mate several times. The process starts when the male performs a mating dance outside his shelter to convince the female to enter. When she eventually does, she will lay up to 1,000 eggs. The male dottyback watches over the eggs until they hatch into babies called fry. They repeat the spawning process each week. Orchid dottybacks can live five to seven years in captivity and possible even longer when taken care of properly. Orchid dottybacks are small fish and as such are prey to larger marine animals such as eels, triggers, and lionfish . They might also be prone to saltwater fish diseases such as dropsy, marine ich, black ich, and ammonia poisoning.",
    "Similarity": 5
  },
  {
    "Name": "Dunkleosteus",
    "Text": "Dunkleosteus is a genus of large, armored fish that lived during the Devonian Period. It is one of the earliest jawed fish to have ever lived. The fish is known for its enormous bite force and could close its mouth rapidly like modern, suction-feeding fish. Dunkleosteus lived in North America , Morocco , Belgium, and Poland about 382–358 million years ago. Dunkleosteus was named after David Dunkle, the paleontologist that first described the animal’s fossils. The name means “Dunkles Bone,” referencing the large bony plate that formed the jaws and head of the fish. Dunkleosteus is the largest placoderm ever discovered. It had a thick, tank-like, external armor covering its head, thorax, and jaw. Its armored exterior made it a powerful but relatively slow swimmer. Like other placoderms, Dunkleosteous didn’t have any teeth. Instead, it had two pairs of sharp, bony plates forming a beak-like structure. The armored jaw plates served as self-sharpening blades. It could bite straight through the bones of most animals, making it an apex predator in its time. It has been difficult to accurately determine the exact size of the Dunkleosteus because the fossil specimens found have mainly been the armored, frontal part of the animal. Of all the Dunkleosteus fossil specimens found so far, only about five percent have a significant portion (up to 25%) of their skeleton intact. However, scientists have made inferences about most of its body with varying size estimates based on different measurements. Some conservative estimates place the Dunkleosteus length at about 15 feet, while more generous ones claim it could have been as long as 19.6 feet. However, the most recent attempt to reconstruct this animal by comparing it with modern pelagic sharks in similar ecological niches turned up a massive estimate of 28.8 feet and a weight of about 4.4 tons (8,800 pounds) for the largest species. Dunkleosteus is the largest and one of the most powerful prehistoric fish to have ever lived. Experts also consider it one of the first apex predators on earth. It was large enough to feed on pretty much any animal that shared the same ecosystem. Size was not the only strength of this giant fish. Dunkleosteus had a unique linkage system that connected the skull and jaw muscles in a way that made it possible to open and close its jaws quickly. This way, the jaw produced a massive bite force enough to rip prey apart. The bite force has been estimated to be about 6,000 newtons and 7,400 newtons at the tip and blade edge, respectively. This was enough pressure to cut through and puncture dermal armor or cuticles of shelled animals, which suggests that they hunted free-swimming armored prey, like ammonites and other placoderms. Scientists have also found fossils of Dunkleosteus with fish bones and partially or semi-digested remains of other fishes. This suggests that they could not digest bones and other hard parts, and they probably regurgitated them instead. The jaws regularly sheared against each other, sharpening them. The jaws also went through a series of changes as the animal grew. The anterior fangs elongated as they grew from juveniles to adults. Their diet also changed from fishes, sharks, and other soft-bodied prey during the juvenile stage to thick-shelled ammonites, placoderms, and other large, armored prey as adults. Dunkleosteus lived and thrived in the marine environment during the Devonian, like puffer fish and blue whales do today. They are thought to live close to the bottom of the ocean. However, there are speculations that members of this genus tend to change habitat with age. Younger Dunkleosteus probably lived in shallow water while the adults ventured deep into the ocean. As seen with many modern sharks, Dunkleosteus may have experience internalized egg fertilization. Evidence found in other placoderms, including what looked like an umbilical cord, suggests that they were viviparous. Dunkleosteus was the apex predator in its native ecosystem and is considered among the first true apex predators on earth. Thus, the chances of them being threatened or preyed on by other animals were low. A study in 2016 found puncture marks and scrapes on a Dunkleosteus fossil armor made from bigger Dunkleosteus . This evidence suggests that they were cannibalistic, with bigger animals feeding on smaller ones. This might be why smaller Dunkleosteus lived in shallow waters, far from the ocean’s depth, which was dominated by larger ones. Fossils of Dunkleosteus have been found almost globally in Late Devonian rock units. However, the most famous specimens in the world are from the Cleveland Shale in northern Ohio. The remains of these animals were first discovered in 1867 by an amateur paleontologist Jay Terrell, and his son at the Sheffield Lake-town along the Lake Erie cliffs. He called the animal “Terrible Fish.” It was then rediscovered years later by paleontologist David Dunkle. The type species of this animal (also the largest species) was eventually called Dunkleosteus terrelli in honor of the first two people to discover it. A series of mass extinction events at the end of the Devonian Period wiped out most of the animals existing at the time, including the Dunkleosteus and other placoderms. Although they quickly diversified into several species after first appearing in the Devonian Period, their existence lasted only a short time. The Kellwasser and the Hangenberg events were two of the most prominent mass extinction events that closed out the Devonian Period. The latter event wiped out almost all vertebrates on land and in the sea, with the marine ecosystems taking major hits. At the end of this period, about 80% of all animal species on earth were extinct. By the time the Carboniferous Period began, Dunkleosteus and other placoderms no longer existed. Significant changes in the oceanic environment and oxygen depletion were probably responsible for the extinction events. The oxygen-depleted environment of the Late Devonian was more favorable for smaller-sized animals compared to giant fishes like the Dunkleosteus . Similar animals to the Dunkleosteus include:",
    "Similarity": 4
  },
  {
    "Name": "Uaru Cichlid",
    "Text": "The color of the Uaru cichlid changes during the spawning season . Uaru cichlid is a freshwater fish native to the Upper Orinoco and the Amazon basins in South America. The fish is popular for its unique triangular shape and coloring, unlike any other fish in the cichlid family. Although native to South America , you can find Uaru species in aquariums all over the world. The Uaru is a genus of small to medium-sized cichlid fish native to the blackwaters and whitewaters of South America. The name “ Uaru ” is the local Amazonian word for toad. The Uaru fishes have a number of nicknames. The native name of this fish is Waroo. People call them “triangle cichlids” in reference to the triangular shape of the adult and “chocolate cichlid” (a name it shares with Hypselecara temporalis, another species of cichlid fish) . The Uaru belongs to the order Cichliformes, which includes two families. The cichlid family is the largest in this order and one of the largest vertebrate families. There are more than 202 genera in this family, with about 1,700 species identified so far. The Uaru genus lives naturally in the wild in South America. Hobbyists also keep them as pets in aquariums all over the world. This genus has two main species: Uaru amphiacanthoides and Uaru fernandezyepezi . The Uaru has an oval disc-shaped body typically of cichlids. However, the row of the spine in the fish’s dorsal fin gives it a more triangular shape. This is why people call it the triangular cichlid. The Uaru has a long anal fin which is nearly as long as the rest of the fish’s body. The long anal fin makes it a powerful swimmer. Uaru species demonstrate different coloration depending on their age. Juvenile fish are often a bland color with a mottled pattern. This dull coloration is an important camouflage that helps to protect this fish. The color makes them look like dead leaves, so larger fishes ignore them. As the fish matures, the color turns from a subdued gray-brown to yellowish color. It may also have small brown blotches. The eyes of large mature fishes are typically bright yellow with black pupils. The fish typically has a large tear-shaped black mark running across the lower end of their body, as well as a smaller mark at the base of the tail. The mark can be distinct or subdued from one individual to the other. Uaru species have scaly bodies. However, the small size of these scales makes the fish’s body smooth and leathery. The small size of these scales gives their body a smooth and leathery appearance. In its natural habitat, the Uaru can grow to lengths of up to 12 inches, but it only grows to about 10 inches in a tank. Adult Uaru changes color just before spawning season. The color of their entire body becomes darker, with a bit of brown coloration along the edges. Their yellow eyes also become reddish, giving the fish a fiercer appearance. Uaru cichlid is native to South America. The two species in this genus have varying ranges and distributions. Uaru amphiacanthoides are found in the clear streams of the Amazon Basin in Northern Brazil and Guyana. Uaru fernandezyepezi, on the other hand, is found in the Orinoco Basin in Venezuela and Colombia . In the wild, this freshwater fish is mainly found in blackwaters and whitewaters. As a popular fish in the aquarium trade, this fish is also bred in captivity. It is best kept in a large, roomy aquarium with gravel or sand as a substrate . The tank is typically decorated with roots and bogwood. Since they’re raised in home and commercial aquariums, Uarus are not at risk of extinction. It is listed as a species of Least Concern on the IUCN red list, which means the population is relatively stable and not under threat. Fishes are the first vertebrates to have ever evolved. The ancestors of modern fishes first appeared about 530 million years ago during the Cambrian explosion . The earliest fishes were primitive filter-feeders. It wasn’t until the Late Ordovician that the first fishes with defined jaws appeared. They became more widespread during the Devonian, which is commonly referred to as the “age of fishes.” The ray-finned fishes (class Actinopterygii) evolved about 420 million years ago. They’re the dominant vertebrate group today. Within this group, the family Cichlidae is the biggest and most diverse. They arose within the order of Cichliformes about 100 to 80 million years ago. Cichlids are renowned for their rapid evolutionary radiation and diversity across different habitats. There are several instances of their lineage evolving the same traits and even reversion to ancestral traits within the family. The Uaru is an omnivore, which means it eats anything from small fish, shrimps , worms, and aquatic plants. Uarus don’t have a lot of natural enemies. They are mostly threatened by humans, who catch them for food. They are also preyed on by other bigger fishes within their ecosystem. In its natural habitat, the Uaru cichlid is an omnivore that eats crustaceans, insects , detritus, worms, fruits, and plants. In home aquariums, the fish is not a picky eater. It can be fed with frozen bloodworms, live earthworms , black worms, frozen brine shrimps, blanched lettuce, and peas. Both male and female Uaru cichlids appear very similar to one another. This makes it difficult to distinguish between them. They reach maturity between five and six months and then move in pairs to mate. During the breeding season, their appearance changes to a darker color with coppery red eyes. The female produces between 100 and 400 eggs and lays on a flat rock surface for the male to fertilize. The pair (male and female) take turns guarding the eggs against predators. Males eat non-viable eggs. However, in some cases, they may end up eating the entire clutch. The Uaru eggs hatch within five days and are then moving to a shallow nest by their parents, feeding them with secretions from their skin for a week. Once the fry starts swimming, they become independent of their parents. However, the fry still stays close to the parent. The average lifespan of the Uaru cichlid is between 8 and 10 years. Uaru fishes are native to South America, especially in the Amazon and Orinoco Rivers. They are not endangered and are relatively common in their native habitat. Natives consider them important food fish. It is mainly kept as a pet in other regions of the world. They are mostly sold in pet stores and can also be purchased online.",
    "Similarity": 4
  },
  {
    "Name": "Rock Bass",
    "Text": "The rock bass (Ambloplites rupestris) also known as the black or rock perch , is a type of freshwater fish that belongs to the sunfish family. It’s a medium-sized fish native to the lakes and ponds in North America, popular with anglers for fishing purposes. They are generally smaller than smallmouth bass and have a distinctive appearance, making them distinguishable amongst other popular angler fish. Rock bass belongs to the Centrarchidae family in the Ambloplites genus. The binomial or scientific name for rock bass is Ambloplites rupestris . Rock bass is easy to identify when you know what to look for. These fish have a characteristically large mouth set underneath their eyes, which are a deep red coloration. These fish are not very large compared to other types of bass, only growing around 6-10 inches in length. They can weigh up to 3 pounds, but one pound is common in smaller specimens. Their color is quite interesting, and these fish have predominantly yellowish-brown bodies with silver and black. Shades of black are seen throughout the tips of their anal fins, and black dotted striped line their body horizontally. A black dot is located near the fish’s gill plates. The dorsal fin is spiny and lacks a uniform shape. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Even though rock bass is part of the sunfish family, they do not have a flat body. Their body has a less compressed body that looks similar to a bluegill and largemouth bass. It is not uncommon for this fish to be misidentified as warmouth (Lepomis gulosus), but instead of having three spines on their anal fin, rock bass has around six instead. This fish relies on their body coloration for camouflage purposes, which enables them to change its color to black or silver to match its environment. This can make it difficult to identify them if they are changing their color. This type of camouflage helps to protect them from predators, but it can also change with age and stress. Rock bass is native to east-central North America, but they have been introduced into Atlantic river drainages. They are distributed throughout southeastern Canada from Ontario to Quebec, toward the Mississippi River Basin, and all the way to Missouri and Arkansas. This fish is plentiful in most parts of the Dakota river in the U.S. and the Great Lakes region along with Torch and Champlain lake. They have also entered the Savannah River basin and eastern parts of the U.S., such as New York, Tennessee, and Kentucky. You can also find rock bass in the southern parts of Florida, Alabama, and parts of Georgia in the Chattahoochee River basin. The population of rock bass is considered the “least concern” on the IUCN red list. They are not considered an invasive species. Fishing for rock bass as a sport is managed by some rules and regulations, and artificial water systems are used to manage and maintain populations of rock bass. This is a freshwater fish that inhabit various bodies of water. This includes lakes, river systems, reservoirs, shore banks, ponds, weed beds, streams, and spring holes. These fish prefer cooler waters with plenty of rocks, hence their name “rock bass.” The water should ideally be rich in vegetation and covered with a rocky bottom. The water should ideally have low turbidity, so rocks, wooden branches, and vegetation should be plentiful as hiding places. The bottom of the water system should be filled with rocks or sand. These fish do not typically inhabit waters with silt. Their ideal current is slow-moving, and they avoid river areas with fast-moving currents. The main predators of young rock bass include northern pike, larger bass species, muskies, and walleye. Adult rock bass is generally more protected when they have a larger size. They are carnivorous fish that prey on smaller fish. In some cases, they may eat their own fry if there is insufficient vegetation and rocks to keep the fry safe. The main times that adults can be seen preying on food items are during the early mornings and evenings, and they are diurnal. They will eat a variety of smaller fish, including minnows, amphibians, zooplankton, and yellow merch, along with small crustaceans and insects and their larvae. They will also readily eat a variety of baitfish from the surface. The average lifespan for rock bass is between 8-10 years in the wild. Certain specimens can live longer, but it is uncommon for rock bass to live for more than 12 years. They can reproduce once sexually mature at 2-3 years old. They are polyandrous, which means that they mate with multiple fish during the spawning season. Females can lay more than 5,000 eggs during a single spawn, which occurs around April till the beginning of June in warmer water. Spawning occurs around rock bass nests, typically created close to each other. Males are responsible for building the nest, and they can become quite territorial during this time in efforts to protect the nest. Once spawning has occurred, the male will fan the eggs and protect the fry shortly after hatching. Not all fry enter adulthood, as rock bass sometimes eat their young or are eaten by predators. Rock bass is considered to be game fish, and they are popular for fishing. This fish enjoys a variety of bait such as wax worms, nightcrawlers, minnows, and other types of baitfish. The best way to catch one is to use artificial lures or live bait. A micro fishing rod and a fishing reel with a smooth drag are a good choice for catching them. These fish do not spend much time in the middle of the lake and prefer to school around the bank or shoreline of the water in vegetation and structures where they feel secure. They can be used in cooking, and they are edible. These fish can be pan-fried or baked, but ensuring the internal temperature is right before consumption is important. The flesh of the bass is described as flaky and white.",
    "Similarity": 3
  },
  {
    "Name": "Discus",
    "Text": "The discus fish can change its colors slightly based on personal and environmental factors . Symphysodon, also known as discus, is a genus of brightly colored tropical fish (and a member of the cichlid family). These fish mainly reside in the long, sinewy waterways of the Amazon Basin. Because of their vivid colors and intricate markings, the discus is one of the most popular tropical aquarium fish in the world. They have undergone selective breeding in captivity for unique types of exotic markings and patterns, many of which don’t exist in the wild. While “Symphysodon” and “discus” are used interchangeably, discus is more commonly used to describe the genus. “Symphysodon” may be a combination of the Greek words “symphysis,” meaning “grown together,” and “odous,” meaning “teeth.” Discus belongs to the family of cichlids , one of the most diverse vertebrate families in the world. A genetic study of discus confirms that there are three distinct species under the genus. The blue discus and the red discus, mentioned below, seem to be the most closely related and are able to produce viable hybrids together. However, several other types of discus exist through selective breeding in captivity. The discus fish, also known as the Symphysodon aequifasciatus, is an ancient species of cichlid that has remained unchanged for millions of years. It is thought to have originated in the Amazon River basin and was first discovered by Europeans during their exploration of South America in the 16th century. Since then, discus fish have been selectively bred to develop different varieties with unique morphological features such as vibrant colors and longer fins. However, much about its evolutionary history still remains unknown. Scientists believe that this species may be closely related to other types of cichlids from Africa and Asia but are unsure how they are connected or when they diverged from each other. Further research is needed to understand more about the evolution of this fascinating species. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . For good reason, this fish has earned the name of discus with its relatively flat, rounded body. Large, prominent fins protrude dorsally and on the rear of the fish. As mentioned previously, the discus is classified according to coloration: blue, red, or green. However, there are multitudes of unique patterns. The fish also have remarkable Color-changing abilities based on age, mood, environmental conditions, and stress levels. Discus usually grow no larger than 6 inches and about half a pound in the wild. Reports indicate growth of around 8 or 9 inches in captivity. Except for breeding season, when the female’s abdomen is enlarged, it is very difficult to tell the sexes apart. Discus fish display several unique behaviors, including swimming in circles, displaying “courtship” behavior during mating season, and forming small groups with other discus fish known as “schools.” During courtship season, male discus will chase female discus around the water until they mate. This is often accompanied by vibrant colors and fin displays. In addition to these behaviors, discus also likes to interact with other fish. Discus are generally peaceful toward other species of water inhabitants but may become aggressive if they feel threatened or territorial. Discus fish are shy creatures who will often hide among plants or driftwood when startled by predators. Discus fish also communicate using sounds like grunts and clicks as well as visual cues such as flashing colors or movements of their fins. In the wild, discus fish are exclusively endemic to the tributaries and floodplains of the Amazon River Basin . They are especially prolific in slow-moving blackwater channels. Discus will often congregate around fallen trees near the shore because of the constant flooding occurring annually. Discus are not currently classified as threatened by the IUCN Red List . They are presumed to have stable and healthy populations. However, the threats to their natural habitat are probably the greatest potential problems discus populations face. Discus are an intermediate part of the food chain, serving as an important link between nutritious plants and animals at the bottom and the predators above it. The majority of discus’ diet consists of algae and other small plant material supplemented with small invertebrates such as worms and crustaceans. The main predators of these fish include turtles , birds , and larger species of fish . Discus are also known to act as cannibals to unrelated larvae of their own species. Based on scientific observations, it appears that the timing of discus mating season is highly influenced by changes in the flood levels of their local environment. They tend to spawn right as the water levels begin to rise as a way to take advantage of the abundant food and lower predator density. When ready to mate, a pair moves away from the rest of the group, perhaps to reduce the incidence of cannibalism. After copulating, the eggs usually hatch in about three or four days. As with many other cichlid species, discus parents invest some time and care into the development of their offspring, guarding and cleaning the eggs. However, unlike many other cichlids, the discus has a unique adaptation: they secrete a mucus-like substance through their skin for the larvae to feed on for the first few weeks of their lives. When one parent begins to tire of this process, the larvae will switch to another parent. At the end of this period, the larvae will have grown large enough to fend for themselves. The young discus will start to reproduce on their own after a year of age. The typical lifespan is some 10 to 15 years. But life is rough for young fish, and many of them fall prey to other animals before they can reach full size. The discus is rarely caught in the wild for its meat. It’s isolated, difficult to reach, and simply undesirable. However, the discus is often raised in artificial environments for the purpose of selling it on the pet market, where it has proven to be incredibly valuable. Discus fish are native to the Amazon River Basin. Their natural habitats have been greatly reduced due to deforestation and water pollution caused by human activities. As a result, their population has significantly declined over recent years. To help protect this species from extinction, conservation efforts have been taken in some countries, including Brazil and Peru. These include regulations on fishing and hunting as well as habitat protection measures. In addition to these efforts, captive breeding programs are being used to increase the population of discus fish in certain areas where they are threatened with extinction. Captive breeding involves raising wild-caught specimens in controlled environments until they can be reintroduced into their natural habitats. This helps ensure that healthy populations of discus fish will remain for future generations to enjoy.",
    "Similarity": 4
  },
  {
    "Name": "Lungfish",
    "Text": "The lungfish first evolved almost 400 million years ago. The modern lungfish is the product of an ancient lineage that dates back almost 400 million years. This “living fossil” is sometimes called primitive, but that does not mean its features are undeveloped, just that it has changed very little since first evolving. The most interesting characteristic of the lungfish is the presence of the internal lung, which serves multiple purposes. Like the swim bladder in other fish, the lung provides buoyancy while swimming, but it also absorbs oxygen and removes waste. The scientific name for the order is Dipnoi , a Latin term meaning roughly that it has two organs for breathing. The closest living relative of this creature is probably the ocean-based coelacanth , which was rediscovered in 1938. Both types of fish have changed little since evolving some 400 million years ago. There are currently six species currently alive today. The four African lungfish all occupy a single genus, while the South American and Australian species both occupy their own genera. This is a type of lobe-fished fish whose dominant characteristic is the presence of a complex bone and muscular structure in the fins. It comes in a variety of different colors, body shapes, and sizes. The marbled lungfish is the largest currently living member of this order. It reaches up to a length 7 feet and weighs almost 40 pounds, but even an average species grows to 4 feet and weighs up to 22 pounds. Most species have very poor vision (which can barely sense movement), but they compensate with their superior sense of touch, smell, and taste. Organs on the snout can also sense weak electrical fields. It has been suggested that the lungfish has changed very little over millions of years because of its stable environment and lack of real predators. This fish has a rather large and discontinuous range all over the tropical parts of the world. Four of the six species reside in Africa , while another species is endemic to Queensland, Australia. The only species in the Western Hemisphere resides in a small part of the Amazon basin near Paraguay . All of them are highly adapted for freshwater lakes, rivers, streams, and wetlands. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . This fish was quite common all over the world until about 200 million years ago, when their numbers began to decrease. Most of the remaining species alive today are in no danger of extinction. According to the IUCN Red List, the four African species are currently classified as least concern , while only the Queensland lungfish is endangered . The South American lungfish is not categorized, since little is known about it. This fish is an apex predator in its native freshwater habitat. Almost nothing else grows large enough to eat it. This creature’s diet consists of worms, crustaceans, insects , amphibians, plants, and even other lungfish. When opening its mouth, this animal sucks in prey and crushes them in its teeth. Although they will consume almost anything, some species can go years without eating. An adult has no known natural predators, but the juveniles may fall prey to fish and mammals. This creature’s reproductive strategies vary by region and genus. Both the South American and Queensland lungfishes are different from the African lungfishes and each other. The African lungfish spawns at the beginning of the rainy season at the end of winter. The larvae then emerge after about a week with bright red fan-like external gills to help them breath until their lungs are fully developed. The male protects the young in his nest until they are ready to gain their independence. The South American lungfish builds an even more elaborate nest consisting of a single vertical passage and a horizontal chamber at the bottom. The male, who guards the nest with his life, develops little tufts in the spawning season that release oxygen into the water to help the larvae breathe in their first few days of life before they can develop lungs. The Australian lungfish doesn’t create burrow at all. Instead, it lays the legs among plants. The larvae, like the adults, have internal gills to breathe on their own. Regardless of species, the lungfish is an especially long-lived fish. It is estimated that some species have a lifespan of 100 years. A Queensland lungfish named Granddad, which lived at the Shedd Aquarium in Chicago, was acquired in 1933 and was only euthanized in 2017 due to declining health. He was seen by more than 100 million guests in his lifetime. The lungfish is almost never used in human cuisine except as a local African delicacy where it’s particularly abundant.",
    "Similarity": 3
  },
  {
    "Name": "Anchovies",
    "Text": "Anchovies are small green forage fishes. These fishes are very common and high in nutrition and belong to the family Engraulidae . There are more than 100 species of anchovies – most of which are found in marine waters. However, some of these small fishes are also found in brackish waters. While some others can also exist in the fresh waters of South America. Anchovies are fish that are mostly distinguished by their large mouths. Their upper jaw extends behind their eyes. Besides that, a long, pig-like snout extends beyond the tips of their lower jaws. Anchovies are fish that belong to the kingdom Animalia and phylum Chordata. Their class is Actinopterygii, and they come from the order of Clupeiformes. These small fishes belong to the family Engraulidae. They also go by the scientific name Engraulidae. However, different anchovy species have different scientific names to go by. Engraulidae comes from the Greek word Engraulis, which means anchovy. However, the name possibly comes from the word γρυλίζω, meaning “to grumble.” As per sources, there are 144 different species around the world. These different species are distributed into 17 genres. The majority of these species differentiate as the result of the location that they are found in, though there are a few ways that they distinguish themselves. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Some of the common species include: Anchovies have been around for millions of years, and their evolution is believed to be closely linked to the evolution of other species in the same family, such as herrings and sardines. It is thought that anchovies evolved from a common ancestor that lived during the Miocene epoch, some 15 million years ago. Since then, they have adapted to inhabit many different environments across the world’s oceans and seas. Anchovies are now considered one of the most abundant fish species. Anchovy populations tend to fluctuate due to changes in ocean temperatures caused by climate change, making them vulnerable if not managed properly. Despite this vulnerability, anchovies remain one of our planet’s most important food sources due to their high nutritional value, which includes essential omega-3 fatty acids and protein content – meaning they are here to stay for generations more yet! Anchovies, as a result of curing, often have dark, reddish-grey flesh, while Sardines have white flesh. Sardines have a slightly protruding lower jaw, while the upper jaw of Anchovies extends till behind their eyes. Comparatively, sardines are about two inches longer than anchovies, though they are still incredibly similar. The main way that these two types of fish differ is in their taste. While anchovies tend to make any dish saltier. However, for individuals that want a meatier taste that is a little more mellow and subdued, then sardines may be the right choice. Sardines belong to the Clupeidae family, while anchovies belong to the Engraulidae family. These are small green fishes. They are slender and streamlined and resemble herrings a lot. Usually, they are categorized by large mouths. Their upper jaws extend behind their eyes, and a pointed pig-like snout extends beyond the lower jaw. They have a straight lateral line. These fishes have large scales that can be easily detached. An adult fish is about 5 to 6 inches in size. Even the heaviest of these fishes do not weigh more than a few ounces. These fish are found in several oceans around the world. They live in scattered spots throughout these oceans. However, they are mostly concentrated in temperate waters. They are very rare or are completely absent in areas with extreme temperatures. That is why it is difficult to find them in very cold or very warm waters. The European species is especially abundant in the Black Sea, Alboran Sea, and the Aegean Sea. These fish are usually found in saltwater. However, some of them can also exist in brackish waters. They are pelagic, meaning that they thrive best in open oceans. In brackish waters, they exist in estuaries and bays. According to a study, as of 2015, the estimated population is 20,700 metric tons. These fish, especially the bay anchovies, have bluefish, striped bass, and weakfish as predators. Apart from that, seabirds also feed on them, including the bay anchovy. Other predators of these fish include sharks, salmon, halibut, and other fishes. They, in turn, eat recently hatched fish as well as plankton. Anchovies are an important food source for many animals, including birds such as seagulls, penguins, and pelicans. Many marine mammals, such as dolphins, seals, and whales, rely on anchovies for food. Large predatory fish like tuna and mackerel and other smaller fish like sardines and herring all eat anchovies. Several types of reptiles, like sea turtles and crustaceans such as crabs and lobsters, also eat anchovies. Anchovies provide essential nutrients to all these creatures since they contain high levels of calcium, phosphorus, magnesium, potassium, sodium chloride (salt), iodine, trace elements/minerals needed for metabolism activities. Thus anchovies play a key role in maintaining the balance of life in oceans around the world. These fish feed majorly on plankton as well as recently hatched fish. Much like herring, the fish reproduce by spawning. Males and females gather in large groups and release their eggs and sperm into the water. The sperms are known to fertilize the eggs outside the bodies of the fish. The eggs, once fertilized, float in water columns until they hatch. The gestation period and the time that it usually takes for the babies to reach sexual maturity varies from species to species. They rarely live after four years of age. Most of these fish are caught by Deepwater trawlers. Once caught, most of these fishes are canned and salted. After, they are turned into a paste which is later used to make sauces. Crab paste is a common bait used to bring anchovies to the surface. Further, they are considered to be a magic ingredient in dishes. They have a savory and briny flavor. Usually, they are stir-fried in tomato sauce or shallow-fried in olive oil. People also love these small fishes as toppings on their pizza or butter them up in their toast as an easy snack idea . They are sometimes dried for eating purposes. Dried fish also make great snacks. The most recent population study of anchovies puts their population around 20,000 metric tons. Anchovies are classified as a ‘Least Concern’ species on the IUCN Red List, meaning they have healthy populations and their conservation status is considered low risk. However, there are still several threats to anchovy populations around the world. Overfishing of anchovies has been an issue for centuries, with some stocks becoming depleted due to unsustainable fishing practices. Anchovies can also be threatened by water pollution from agricultural runoff or oil spills, which contaminate their habitats and food sources. Additionally, climate change is causing ocean temperatures to rise in many areas, which affects fish reproduction cycles and migratory patterns. It is important that we continue to monitor anchovy populations so we can ensure sustainable fisheries management and protect these important fish from further harm or a decline in numbers. There are 144 species of anchovies spanning 17 genera.",
    "Similarity": 3
  }
]
