[
    {
        "Name": "Huntaway",
        "Genus": "Canis",
        "Diet": "Omnivore with no preference",
        "Origin": "New Zealand",
        "Fun_Fact": "Huntaways have a strong instinct for herding.",
        "Text": "Huntaways are known for their loud, deep, and sustained barking when they herd sheep. The Huntaway dog was first bred in New Zealand in the early 1900s. Farmers needed a sturdy, fast dog with a talent for keeping track of their herds of sheep. The combination of speed, agility, and stamina possessed by this canine has earned it the nickname, New Zealand’s sheepdog. They are categorized in the herding group. See all of our expert product reviews . This dog’s temperament is affectionate and protective. They are fond of children especially when running around, jumping, and playing games. A family searching for a smart, energy-filled dog with a loyal nature should give this breed a closer look. Sheep farmers in New Zealand soon found that a new herding companion was required to enable them to keep abreast of their flocks at all times. They were going to need an intelligent, energetic canine, with a loud bark, and the ability to work alone or as part of a team. It took combining several breeds: collies, English hounds, labradors, and Old English sheepdogs, and the rest as they say is history. By the 1900s, the huntaway came into being. A large, hardy canine, it came with a deep, bark which could carry for miles. It was also sufficiently robust to cover large distances and handle inclement weather, making it the perfect herding assistant for sheep farmers in a different new climate. See all of our expert product reviews . This breed is a sturdy, compact dog. A male can grow to a height of 26 inches and a female can be 24 inches tall at the shoulder. A male can be as heavy as 88 pounds while a female can weigh 77 pounds. Seven-week-old puppies weigh an average of five to six pounds. They are full-grown by the age of 18 months. This breed has a certain amount of health issues for potential owners to consider. Hip dysplasia is a health issue of this lively dog. This is when the hip joint has not formed correctly. A limping or hopping dog may be experiencing this condition. Unfortunately, bone cancer is another health issue faced by this breed. A visible lump, lameness, or pain are all potential signs of bone cancer in this dog. The treatment depends on the severity and specific type of bone cancer involved. Ear infections are also common in dogs with long ears and this breed is no exception. Mud or dusty debris can accumulate in this dog’s ears, leading to bacteria growth and infection. Regular cleaning is a good tactic to prevent infection. But, if this dog gets an ear issue, these infections can be treated by a vet. The most common health issues are: This dog is always alert to its surroundings. Alertness and agility are two of the most important traits in a dog bred to take charge of a large flock of sheep. Even if it’s not herding sheep, this dog notices the activities going on all around it. So, if a family member picks up a ball or a frisbee for a game, this canine will take note! Though they were bred for the hard work of herding sheep on a ranch or farm, these dogs are known for their affectionate behavior. They love to be praised and patted. This is a great quality for a family dog. Unlike a basset hound or a bulldog , a Huntaway has a lively personality. This dog would fit well into a family that likes to be traveling around and having fun! Caring for a Huntaway puppy or older dog is easier if you know more about the breed’s specific needs. Giving this pet the proper diet, exercise, healthcare, and grooming attention can help it to live a long and happy life in your family. The right diet gives your Huntaway the energy it needs to get through its active day. Huntaway puppies require a different diet than full-grown dogs. Huntaway puppy food: These puppies need DHA in their diet to support the healthy development of their eyesight and brain. Protein aids the development of muscles and bones. Paying special attention to healthy bone development is important in a breed vulnerable to bone cancer. Carbohydrates give these puppies the energy to support their running, jumping, and exploring activities. It’s best to serve these puppies four small meals each day to keep their energy up throughout their waking hours. Huntaway adult dog food: Protein in an adult dog’s diet contributes to the strong muscles and cartilage of this very active pooch. Calcium is an ingredient that adds even more strength to this dog’s bones. Maintaining the bone health of this dog may head off hip dysplasia. Fat in its diet gives it stamina and energy for the long periods of running characteristic of this dog. Vitamin A maintains this dog’s healthy eyesight. Adult dogs should be fed twice per day, once in the morning and once in the early evening so the food can be digested before sleep time. The A-Z Animals choice best dog food for Huntaways is Victor Purpose – Performance Dry Dog Food. Meet a combination of glucosamine and chondroitin sulfate that helps keep Huntaways’ joints mobile and pain-free, all in a formula specifically for active dogs. Its protein content is 26%, 81% of which derives from real, quality meat. There’s even supplemental vitamins, minerals, and other nutrients for complete immune system support. Here’s where to get Victor Purpose Performance Dog Food on Chewy and Amazon. How much does a Huntaway shed? These dogs are average shedders. Keep in mind they do increase shedding activity at the start of the summer season. A good grooming routine for this dog involves brushing its short, wavy coat once per week. At the beginning of the summer season when this dog sheds more than normal, a slicker brush can remove dead hair from its coat. They are prone to getting infections in their ears. This is common for many dogs that have long, furry ears. So, when grooming, take a moist, soft cloth and wipe the underside of each ear to remove excess wax and dirt. Ask a vet if there is a mild cleaning solution that would be appropriate to use on the dog’s ears. Cleaning a Huntaway’s ears gives you a chance to spot any potential infection right away so you can get treatment for it if necessary. Like most herding dogs, Huntaways are intelligent with alert senses. Consequently, the obedience training process is relatively simple with this breed. Daily exercise is at the top of the list of requirements for this dog. They are strong dogs with stamina so taking this pet to a nearby field or woods is a great way to just let it run off some energy! It’s a smart idea to make sure your Huntaway is fully trained before letting it off the leash to run in any environment. Come up with games that give this dog a task to complete. Like playing a game of tug-of-war with a rope bone or asking the dog to find a toy you’ve hidden somewhere in the yard. Think about it. These dogs were bred for the task of herding sheep. So, they are most happy when they have a goal to work for. Is this dog appropriate for life in an apartment ? No, it needs more space than an apartment can provide A farm or a home with a large fenced-in back or front yard are the best types of homes for this pooch with the sweet personality. Socialization is important for any dog breed but is especially critical for this one. Why? Because a Huntaway puppy that’s not properly socialized is likely to grow into an adult dog that tries to herd children, adults, and pets in a home. Keep in mind they are only doing what they were bred to do. But careful socialization from the time it is a puppy can show this breed when herding behavior is appropriate. Even a socialized Huntaway can revert to its natural herding instincts. So, it’s best to keep an eye on the meetings between a child and the family’s Huntaway until it’s clear the dog understands what is expected of it. Border Collies, Australian Cattle dogs, and Belgian Sheepdogs are all similar breeds to the Huntaway. Popular names for this breed:",
        "score": 0.73733056
    },
    {
        "Name": "Treeing Walker Coonhound",
        "Genus": "Canis",
        "Diet": "Omnivore with no preference",
        "Behavior": "Their temperament can be characterized as loyal and calm.",
        "Fun_Fact": "In addition to raccoons, these dogs can track bears, bobcats, cougars, and deer with ease.",
        "Text": "The Treeing Walker Coonhound lets out a long, yodeling call when on the hunt, and a short repeating bark once they “tree” prey. Whining is normal in anticipation of the hunt. Loving and confident, Treeing Walker Coonhounds enjoy spending time with humans. Also known as Walkers, they make good house pets but are work-oriented and require something to keep them busy if they are not going out on hunts. Without an outlet for their energy, Walkers can become restless and destructive. Primarily bred to hunt raccoons , the Treeing Walker Coonhound can hunt on its own or as part of a pack. In addition to raccoons, they track bears , bobcats , and cougars with ease. Walkers are also quick and able to hunt deer in states where it is permitted. See all of our expert product reviews . The name of this breed contains a lot of information about its origins. Treeing Walker Coonhounds are named after a hound dog’s “treeing” technique during hunts, in which it tracks prey by its scent until the animal is forced to run up a tree for safety while the dog waits below and barks loudly until the hunter arrives. These dogs also contain the name of a key family in the development of the breed in the 1700s, who imported and bred hounds from England: Walker. Finally, the last part of their name comes from coonhound dogs who were bred to hunt raccoons and larger game. Originally descended from English and American foxhounds, the Treeing Walker Coonhound is one of the oldest breeds in the U.S. It was developed when a dog called “Tennessee Lead” was crossed with a Walker foxhound in the 1800s. Early on it was classified as an English Coonhound, however, after receiving the name we know it as today, it was recognized as a separate breed by the United Kennel Club in 1945 and by the American Kennel Club in 2012. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The most common coloration found is tri-color, a combination of white, black, and tan. Walkers can also be mostly white with patches of black or tan, or mostly black with white or tan areas. See all of our expert product reviews . The Treeing Walker Coonhound is commonly cross-bred with other hounds, such as the Bluetick Coonhound , resulting in a Bluetick Walker. Another cross-breed resulted in the Beagle , an excellent hunting dog who is also family-oriented. Other non-hunting breeds, such as the Boxer , are crossed with Walkers, resulting in the BT Walker. When crossed with a Poodle , the result is a Treeing Walker Coonoodle. A Walker with a Bulldog results in the English Bull-Walker. The Treeing Walker Coonhound is a medium-sized dog with a sturdy, lean build. He was developed to run effortlessly while pursuing prey and should look the part of an athlete, with weight in proportion to height. The breed is generally healthy, but there are a few issues to be aware of. Like many athletic breeds, Walkers may develop hip dysplasia , one reason why finding a reputable breeder is important. Also, due to their floppy ears, it is easy for moisture and debris to become trapped, leading to ear infections . It is important to check and clean their ears frequently to keep them healthy. Walkers are generally calm, sociable, and loyal. They are typically patient and they enjoy spending time with children. However, when taken for a hunt, Walkers immediately focus and begin casting for scent, using their high energy to become relentless hunters. Walkers are low-maintenance for the most part, they get enough exercise daily. Their affectionate nature makes these dogs a good choice for families with children and other pets. Unlike many hunting breeds, Walkers can quickly learn to leave the family cat alone. Puppies should be fed a high-quality puppy food three times a day. Once they reach six months, Walkers can transition to around two meals a day. While some people choose to eventually move to one feeding a day, breaking the meal into two servings helps reduce boredom and encourages good eating habits. Once your dog reaches around 1 year of age, you should transition to a high-quality adult dog food . Treeing Walker Coonhounds are fortunate enough to not get too many health issues, so there are plenty of dog foods that they would likely thrive on. But at A-Z Animals, our Treeing Walker Coonhound dog food choice is Purina ONE SmartBlend Natural Large Breed Formula Adult Dry Dog Food. This food is made to support the health of large dogs. As such, it has a special hip and joint health formula fortified with glucosamine. There’s plenty of clean protein from chicken to fuel Treeing Walker Coonhounds’ high activity level. Plus, there are fatty acids, vitamins, minerals, and antioxidants for a robust immune system that fights off ear infections easily. Follow the link below to buy Purina ONE SmartBlend Natural Large Breed Formula on Chewy and Amazon. The breed is about as low maintenance as it gets when it comes to grooming. Going over his coat with a brush once a week, along with brushing his teeth every other day, is pretty much all you have to do for this breed. Use a cotton ball or gauze square dampened with a veterinary-recommended ear-cleaning solution to wipe out his ears once a week as well. Finally, clip toenails as often as necessary. While the breed doesn’t require baths often, you may want to wipe off his feet with a damp cloth when bringing him inside during wet weather to avoid any infections and dirt brought into your home. Start doing this from a young age and he will quickly learn to wait at the door and not be bothered by the wiping when he comes inside. Start working with your pup as soon as you bring him home. Walkers can be strong-willed, so introducing short, positive training sessions early on is important to establish good manners. Since the mature hound can reach 70 pounds and has a high energy level, it is important he knows how to behave. Don’t mistake his stubbornness for a lack of intelligence. Like many strong-willed breeds, the Treeing Walker Coonhound will shut down if treated poorly. Use patience, positive reinforcement, and rewards and your pup will be more than happy to please you. Anyone planning on owning a Walker should love the outdoors. These dogs need a minimum of one hour a day of vigorous exercise but the more, the better. Unfortunately, allowing him in the backyard every now and then will not be enough. Instead, plan on walks, jogs, hikes, obedience training, and active play with toys in the backyard. Walkers produce an average of 4 to 6 puppies per litter. When looking for a pup, visit a reputable breeder or adoption agency. Walkers, like many hunting dogs, are frequently available from backyard breeders. Choose a reputable breeder with health certificates verifying proof of vaccination along with any health issues that may present within a litter. Reputable breeders offer a health guarantee on their pups and spend time analyzing bloodlines to ensure the litter has the preferred temperament, lacks genetic predisposition to diseases, and is overall healthy. If you consider adoption, a reputable agency will let you know why a particular dog was surrendered and work with you to find a good match for you. One of the facts that are often overlooked is how wonderful Treeing Walker Coonhounds are with children. They are attentive playmates, aware of their size, and gentle with their movements. This sociable hound may surprise you with an affinity for playing with children, but always supervise interactions between the dog and young children. As patient as this breed is, their floppy ears can become convenient handles for rough play, and their tolerance may encourage rowdy behavior from youngsters. If you find the Treeing Walker Coonhound appealing, but want to consider some similar breeds, there are several that may be a good fit. Some popular names for hunting hounds include:",
        "score": 0.72259945
    },
    {
        "Name": "Mudi",
        "Genus": "Canis",
        "Diet": "Omnivore with no preference",
        "Behavior": "Their temperament can be characterized as smart and energy-filled.",
        "Fun_Fact": "Mudi dogs have a reputation for being able to control a herd of 500 sheep.",
        "Text": "Mudi dogs, originally from Hungary, are able to keep track of a herd of 500 sheep or serve in search and rescue because of their laser-focused attention and alert observation. Have you ever heard of the Mudi? If not, it may be because there are possibly only a few thousand of these dogs in the world. Despite being few in population, the Mudi dog has a long list of favorable qualities. This energy-filled dog has an affectionate temperament and a high level of intelligence. It’s a part of the herding group. See all of our expert product reviews . This dog’s history dates back to 19th century Hungary . It descends from the Pumi dog (a sheepdog) and the German Spitz . They were bred to herd sheep for long hours in the expansive fields of Hungary. Today, most of these dogs live in Finland and Hungary with a few scattered in Europe and North America . It’s ability to be laser-focused and alert when keeping a herd of sheep together, has made it a good search and rescue dog today. When it is off duty, this dog is playful and affectionate with a family . Mudi mixes are all relatively recent designer breeds and tend to result in a spunky and inquisitive dog: An adult male dog grows to a height of 18 inches measuring from its paw up to its shoulder. Fully grown females can achieve a height of 17 inches. When it comes to weight, an adult male can reach 29 pounds while a female’s full weight is 24 pounds. When a puppy is eight weeks old, it should register a weight ranging from 8 to 9 pounds. This canine stops growing at 9 to 12 months old. Patellar luxation is a common health issue of this Hungarian dog. This condition happens when the kneecap shifts out of its proper place resulting in lameness. While it can sometimes resolve itself, a severe case may require physical therapy or surgery. This breed is also vulnerable to elbow dysplasia. A dog with this issue has an elbow joint that doesn’t fit together in the proper fashion. It’s an inherited condition and can be resolved with surgery. Cataracts are another potential medical issue for this canine. They appear as a thin film over the dog’s eyes. Although they can ultimately cause blindness, some dogs function fairly well for years with cataracts before having surgery. See all of our expert product reviews . The most common health issues: A Mudi is one of those canines that likes to be on the move. Not surprisingly, that’s one of the most common traits found in a herding dog. A family looking to add a Mudi to their household can expect relaxed, affectionate behavior from this sweet-natured pooch. A big farm or a home with a large yard is the most appropriate place for this pet. This dog is a really good choice for an energetic family that likes to go camping, visit local parks, attend festivals, and otherwise enjoy other outdoor activities. Its friendly personality makes it welcome at almost any gathering. This pooch is happiest when it’s investigating its surroundings. Learning all the facts about the diet, healthcare, grooming, and exercise requirements of this pet is the easiest way to excel as its new owner. The basic routine of care differs depending on whether someone owns a puppy or an adult canine. Look at some of the unique needs of each one. The types of nutrients in a puppy or adult dog’s diet can help it to maintain great health. Therefore, it’s important to choose a high-quality dog food that nourishes your Mudi for lifelong health. So, check out some of the basic dietary elements. Mudi puppy food : Along with supporting its brain and vision health, Omega 3 and 6 fatty acids are responsible for maintaining the healthy skin and coat of this pup. Carbohydrates are essential for every puppy but are especially critical for active breeds like the Mudi. Lean chicken and turkey are good sources of protein nourishing this puppy’s muscles, tissue, and joints. Whitefish is another source of protein as well as calcium. These nutrients are beneficial to a breed vulnerable to knee and elbow issues. These puppies need fiber in their diet to help them properly digest a balanced diet. Mudi adult dog food : Vitamin E keeps an adult dog’s metabolism working efficiently as it ages. The proper amount of vitamin E also contributes to the continued health of this dog’s eyes. Protein is essential in supporting healthy tissue and muscles in an aging Mudi. Carbohydrates are necessary to provide this dog with all the energy it needs to run and play. Vitamin C helps to fight off respiratory illness and other ailments. The fiber in this dog’s daily diet along with access to fresh water helps keep its digestive processes in good working order. A-Z Animals picks Wellness CORE Dry Dog Food with Wholesome Grains, High Protein Dog Food as the best dog food for Mudi dogs. Importantly, dogs like the Mudi that can have joint problems including patellar luxation and elbow dysplasia need glucosamine in their diet. That’s because it’s clinically proven to protect joint mobility. Plus, the real chicken and turkey in this recipe are natural sources of these essential nutrients, as well as taurine which is good for the eyes, since the Mudi can develop cataracts. If you like the sound of that, you can find Wellness CORE Wholesome Grains High Protein dog food on amazon. One of the many favorable qualities of this pet is its simple grooming regimen. Its short coat of wavy hair needs to be brushed only once each week. It makes sense. These dogs were bred to be hard-working sheepherders. They don’t have the time to stop for a complicated grooming routine! How much does a Mudi dog shed? These dogs are known to shed on a seasonal basis. A slicker brush is perfect for removing dead and loose hair especially during those seasonal periods of shedding. Otherwise, a brush with boar’s hair bristles is effective at getting rid of tangles and smoothing its coat of black, brown, gray, and other colors. Another one of the many pleasant facts about this dog is that it’s easy to train. An alert, focused mind allows it to learn its obedience lessons very quickly. Along with that, this dog is known for its ability to learn fun tricks like shake hands (paws), rollover, play dead, and bow. Teaching a Mudi tricks like this is an easy way for a family to bond with this dog. Running is the favorite exercise of this dog. One that’s trained to come when called can be taken to an open field for a run off the leash. Time spent at the dog park is another option to think about. An agility course is an entertaining exercise idea. Leaping over jumps, running through tunnels, and climbing ramps is this dog’s idea of a lot of fun! Ensuring this dog has 60 minutes of exercise daily keeps its mind and body stimulated and healthy. It may even extend its lifespan. This dog isn’t a good choice for people in apartments . They need a lot of space to stretch their legs. A Mudi puppy needs just as much space as an adult dog to move, stretch its legs, and get its heart pumping. A fenced-in space is ideal for a puppy until it has completed obedience training. It’s true that these dogs are appropriate for families with children. However, if this breed is teased or mistreated even in a playful way, there’s a chance it will snap at the young person. A few dogs similar to the Mudi are the Border Collie, Bouvier Des Flandres, and Belgian Shepherd. Popular names for this breed: Some celebrities in Hollywood are partial to this dog breed including:",
        "score": 0.70885324
    },
    {
        "Name": "Kangaroo",
        "Diet": "Herbivore that enjoys grass and especially likes seeds, flowers",
        "Fun_Fact": "Females have a deep pouch on their front!",
        "Text": "The kangaroo is among the most remarkable leapers of the animal kingdom. They are also bipedal , meaning they walk on two legs. When it’s in motion, the kangaroo hops completely clear off the ground, covering up to 30 feet in a single swift motion. No other large animal of this size has the same ability. As the national symbol of Australia , the kangaroo adorns a coat of arms, coins, and even the logos of sports teams and organizations. It has adapted very well to the presence of humans. The kangaroo is formally defined as several large, hopping marsupials in the genus Macropus . This scientific name derives from the word macropod, which means “large foot” in Latin. The four main species in this classification are the red kangaroo, the western gray kangaroo, the eastern gray kangaroo, and the antilopine kangaroo. The black wallaroo and common wallaroo are also sometimes considered to be a true kangaroo as well. The wallaby is not considered to be a true kangaroo, but it’s similar enough to be a member of the same genus classification, Macropus . All of these species are part of the same family, which goes by the scientific name of Macropodidae. The difference between a kangaroo, a wallaroo, and a wallaby mostly comes down to size. Kangaroos are the largest members of the genus, while wallabies are the smallest. Wallaroos, as the name implies, have an intermediate size between the kangaroo and the wallaby. Otherwise, their anatomy is fairly similar. This animal’s most important anatomical feature is the exceptionally long hind legs. These legs are specifically adapted for bipedal hopping at distances up to 30 feet and a height of up to 10 feet. The animal has a unique arrangement of digits. Each hind foot consists of four individual toes, but only the big toe bears most of the animal’s weight. The second and third toes are actually fused together and highly reduced. The kangaroo’s hands have five digits and sharp claws. They are somewhat similar to human arms, but they lack opposable thumbs. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . These animals also have a unique body shape to match its lifestyle. The body is defined by the big, arched back and a comparatively small head that ends in a sleek snout and big rounded ears. Another important feature is the long, thick tail, which serves as a kind of third leg to help it properly balance on the ground. The kangaroo’s coat color can vary between a rusty red and bluish-grey. These animals take the crown as the world’s largest marsupial. Depending on the species, it stands about 3 to 7 feet tall and weighs 40 to 200 pounds. Females (also known as jills or does) are slightly smaller compared with males (which are called jacks or boomers). Females also have a forward-opening pouch with four teats. The ancestors of the kangaroo diverted from other tree-dwelling marsupials and evolved into a ground-dwelling descendant between 3 to 15 million years ago. Marsupials have a distinctive pouch that helps mothers care for their young. Somewhere along the timeline, they developed their signature hopping method of movement that makes them so remarkable today. Scientists are not sure exactly why this adaption happened, but hopping does appear to be an efficient form of locomotion. As unusual as it sounds, Kangaroos have been able to adapt fairly well to the presence of humans and farming, while many of their cousin marsupials have not faired so well. They are also so prevalent that they are killed as game for their lean meat and also to reduce them as a pest population. The kangaroo is a highly social animal that likes to congregate in groups of between 10 and 100 individuals at a time, which are known as mobs, troops, or herds. The most common social arrangement involves a group of females, their offspring, and one or more males. However, since individuals can move around independently, these mobs only have a loose organization. The primary benefit is that groups offer protection and security for all of their members. An individual can signal the presence of danger by beating its tail against the ground. These animals have numerous other ways to communicate with each other. These include eye contact, sniffing, touching, and vocalizations. They will seek to avoid confrontation when they can, but both males and females may fight each other for limited resources. The familiar boxing behavior for which they are known is a male-only competition to determine who gets access to females. These matches take a ritualized form in which one male issue a challenge and the other male can accept or decline. The males will lock arms, push each other, and kick out while standing on the tail. The kangaroo is a very fast and agile animal that can achieve a top speed of about 40 mph and a consistent speed of around 20 to 25 mph. Because of its powerful leg muscles and big tail, the kangaroo actually expends less energy at this moderate cruising speed than at slower speeds. This allows it to outlast predators who may grow weary of the chase. Kangaroos have the ability to feed at all hours of the day. However, they are most active at night or in other periods of low light. Most individuals stay within a well-defined home range and don’t move around too much except when they’re pursued. The kangaroo is found exclusively in Australia , Tasmania , and the surrounding islands. Each species has a different geographical range. The red kangaroo, which has the widest range, can be found all over the open plains of inland Australia. The eastern and western grey kangaroo species are found in the east and west, respectively. The antilopine kangaroo occupies the northern part of the country. Kangaroos can live in a wide variety of different habitats, including grasslands , savannas, and bushlands with sparse woods or no trees at all. They are well-adapted for life in hot, dry conditions and can survive for long periods of time without water. The kangaroo has an herbivorous diet, which is reflected in its highly specialized anatomy. Like a cow , it has a multi-chambered stomach that allows it to digest tough plant material and draw out nutrients. The kangaroo also has the ability to regurgitate the food and chew it again to completely break down the material. The kangaroo’s sharp incisors are specialized for cutting vegetation close to the ground, while the flatter molars are specialized for grinding up the vegetation. The kangaroo’s diet largely consists of grass, shrubs, and many different types of flowering plants. These animals are hunted by both people and other animals. They have been used as food and resources since people first arrived on the island some tens of thousands of years ago. Even today, many thousands of kangaroos are hunted and culled every year. Despite the large number of kangaroos killed, this has had minimal effect on their conservation status. In fact, like deer in the United States , kangaroo hunting is regulated and even encouraged as a way to control wild population numbers. A fully grown adult kangaroo has few natural predators in the wild. However, dingoes , feral cats , foxes , and raptors, many of which have been introduced by humans over the millennia, do sometimes feed on juveniles or dead kangaroos. The kangaroo is not limited to a single established breeding season. Instead, it can choose to mate at any time throughout the year as circumstances dictate. This means it is more likely to reproduce when resources are particularly bountiful. Kangaroos engage in a brief courtship period but do not form long-term pair bonds after copulation. Since reproduction is a bit of a free for all, males compete with each other to monopolize access to females. The male plays no other role in the development of the young. After a month-long gestation period, the young joey is born hairless, helpless, and completely blind, measuring no more than an inch in size. The first thing it does is crawl into the mother’s pouch and attach it to her teat. It remains there for 120 to 400 days. Even after it emerges from the pouch, the young kangaroo will remain with its mother for another year and a half, growing to its adult size. If resources are particularly plentiful, then the mother has the ability to take care of three offspring at the same time: the undeveloped embryo, the joey inside of the pouch, and a joey outside of the pouch. The embryo can enter a dormant state, known as diapause, for as long as necessary until the other baby has left the pouch. The mother’s anatomy is specifically adapted to deal with this. She has the ability to produce two different types of milk, one for the newborn joey and one for the larger juvenile. This allows her to maximize the number of offspring she can raise at one time. It may help the kangaroo recover quickly from long periods of drought, during which time reproduction is suspended to conserve resources for the mother. If the joey’s development goes smoothly, then it can expect to reach sexual maturity within the first two years of age. The life expectancy of the typical kangaroo is around 20 years in the wild, though some individuals have been known to live longer. According to the IUCN Red List, the current classification of the four kangaroo species, plus the common wallaroo, is least concern . Only the black wallaroo is considered to be near threatened . The best population estimates suggest that tens of millions of kangaroos roam across Australia. The San Diego Zoo is one of the major destinations in the United States for both red and gray kangaroos and several wallaby species. Their Walkabout Australia section, which opened at the Safari Park in 2018, allows visitors to walk along the pathways among the grassy habitat and get an up-close view of the animals. Other major destinations include the Denver Zoo , Saint Louis Zoo , Detroit Zoo , Cincinnati Zoo and Botanical Garden , Philadelphia Zoo , Dallas Zoo , San Francisco Zoo , Columbus Zoo and Aquarium , and much more.",
        "score": 0.7086884
    },
    {
        "Name": "Ox",
        "Genus": "Bos",
        "Diet": "Herbivore that eats they are hernivores",
        "Behavior": "They usually live in herds.",
        "Features": "Large horns",
        "Text": "The ox is the heavy-duty machinery of the animal world. An ox, by definition, is any male bovine that is used for work. Usually, only mature males (over 4 years of age) from the largest breeds of domesticated cattle are trained for work, and these males are castrated to keep them docile. Certain cattle are purposely bred to be oxen. Also called a bullock, the ox is used to plow, transport, and power operations that thresh and grind grain or produce irrigation. They are usually put to work in pairs. Pairs are added as needed, based on the job. Teams of oxen might go over ten pairs. Here are five great things you should know about these industrious animals. The ox is a large, hoofed ungulate with two horns classified as Bos taurus or B. taurus primigenius within the Bovidae family. Its ancestry depends on the type of cattle bred over the centuries in a certain location to create draft animals. What is an ox and how does it behave? Bullocks are draft animals that have a history as laborers dating back to 6000 B.C. They are powerful creatures of great size, making them perfect for pulling carts and wagons, plowing, and powering millstones for grinding grain. This steer is a quiet, peaceful animal. That has more to do with its castration than anything, which greatly impacts impulse and temperament. Except for its large size, it pose no threat to humans. The term “dumb as an ox” is a misconception, likely attributed to the ox’s quiet, slow nature. Some say oxen may be as smart as dogs . Oxen show signs of remembering places and people. They are adaptable and easily trained. They also perform chores without much supervision. In many East Asian communities, the ox is considered a comforting creature, a source of reliability, strength, conscientiousness, and loyalty, inspiring confidence. According to the Chinese lunar calendar, anyone born in the Year of the Ox will have a sense of peace with oneself, trust, and patience. It’s also believed they’re bull-headed (pun intended!) and opinionated. The most obvious difference between the buffalo and the ox is easily spotted. When it comes to size, the buffalo is noticeably larger. It has a thicker coat than the ox. Also, while you can find the ox in different regions of the world, over 95 percent of the buffalo populace resides in Asia . [Note: we are talking about African and Asian buffaloes like the water buffalo, not the American bison.] The two animals are both laborers. Buffaloes are used as pack animals, carrying heavy loads. Oxen also use their strength for powering machines, for irrigation tasks, and to skids logs in dense forests. Buffaloes work in teams, while oxen work in pairs. Of the two mammals, oxen do lighter work compared to buffaloes. Also, Oxen are the more social of the two animals. Not so friendly, buffaloes are livestock and a portion of the population is wild. The average weight of the ox is a mighty 1,500 to 3,000 pounds! On the other hand, while larger than the ox, the buffalo weighs in at around a ton, or 2,000 pounds. While there are wild oxen, the majority of the populace live in human-built habitats. The structures are usually sheds, stables, and open fields where they graze and walk freely. Here, the animals get fed and cleaned, rest, and congregate in small groups and herds. When threatened, oxen will form a circle, especially around the young. They then use their horns to defend the herd. Bears and wolves are the ox’s only predators. The ox is a herbivore, so it grazes on a diet of grass, grain, and other vegetation only. Oxen do not reproduce naturally since the male bovines are castrated early. For reproduction, the female cattle are artificially inseminated or a herd bull with desirable traits is reserved. The lifespan of this animal is a little over 20 years. At the end of that time, the animal may be used for food. Oxen are considered to have sufficient numbers such that they are not endangered. While oxen are adaptable, their numbers probably have less to do with survival and more to do with the human need for the ox. Organizations that monitor the risk of species endangerment haven’t seen much reason to keep an eye on oxen. The IUCN categorizes the species as of “ Least Concern ,” a clear indicator that the ox is plentiful and going nowhere any time soon.",
        "score": 0.7073191
    },
    {
        "Name": "Chamois",
        "Genus": "Rupicapra",
        "Diet": "Herbivore that enjoys grass and especially likes leaves, shrubs",
        "Fun_Fact": "Natively found in the European mountains!",
        "Text": "The chamois is a small, hoofed animal that is a goat antelope species. It is native to Asia Minor and the Eastern, Central, and Western European mountains at moderately high altitudes, and it was introduced to New Zealand . The pronunciation of its name resembles that of the French, while the pronunciation of its name as leather is based on “chamy” or “shammy.” Some subspecies of this bovid are having protection under the EU’s European Habitat Directive. The chamois is an animal in the family Bovidae which includes cloven-hoofed, ruminant vertebrates such as the bison , American buffalo, water buffalo , antelope , sheep , goats, muskoxen , and domestic cattle . It is further classified into the goat antelope subfamily Caprinae, which contains medium-sized bovids. Called a caprine or goat antelope, it is not a true antelope, which is classed as either cervid-like (true deer in the family Cervidae) or antilocaprid-like (even-toed ungulates in the order Artiodactyl, with their closest relatives being in the superfamily Giraffoidea). There are two species in the genus Rupicapra , R. rupicapra and R. pyrenaica . Its synonym is the former scientific name Capra rupicapra . The type species R. rupicapra contains 7 subspecies. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The subspecies of the Rupicapra genus differ by habitat range and certain physical traits, such as color. However, they are all very small bovids. Fully grown adult chamois reach 70–80 cm (28–31 in) in height and 107–137 cm (42–54 in) in length. Males are somewhat larger than females. Both genders have a weight range of 30–60 kg (66–132 lb) and 25–45 kg (55–99 lb), respectively. Both sexes have short, mostly straight horns which curve backward near the tip, with male horns being thicker. Both have rich brown fur which turns into a light chestnut color in spring and summer and long, light grey guard hairs in winter. They have white a long black or brown band from each side of the muzzle to the eyes and ears, white on the rest of the head and throat for contrast, a white rump, and a black stripe along the back. Their hooves are excellent for gripping slippery rock. The tail is not usually visible except when mating. The 7 subspecies of R. rupicapra have different habitat ranges including: As a member of the tribe Caprini, chamois occupy a somewhat unique position since they are goat-antelopes. They are also related to goats and sheep and the earliest ancestor of the tribe is believed to have appeared during the Miocene about 5.333 – 23 million years ago. Scientists believe that it was pretty similar to the medium-sized members of the genus Capricornis, serows. During the latest ice ages, this group experienced the greatest diversity it had ever known. It was during these periods that its members received the qualities which enabled different species to be capable of living in harsh climates of extreme cold or extreme heat and drought. Chamois are mostly diurnal animals but can be active at night. Adult males lead solitary lives for most of the year, while female chamois and their young live in hers of 15-30 individuals. Chamois give a warning call of danger by stamping their feet and making a whistling sound. When alarmed or threatened, they flee to the most inaccessible heights, often by making amazing leaps. The habitat of the chamois is the moderately high, very steep, rugged, and rocky mountains of Europe and Asia Minor. It prefers alpine and subalpine meadows above the timberline and both fairly steep and flatter terrain, moving into forested areas and steep slopes during the winter to avoid the accumulation of snow. The animal is often found at elevations with a minimum height of 3,600 m (11,800 ft), moving to areas predominated by pine trees in lower elevations of around 800 m (2,600 ft) in the winter The chamois’ native habitat range includes the Alps, Pyrenees, Carpathians, Tatra Mountains, the Balkans, parts of Turkey, the Caucasus, and the Apennines. It was introduced into the South Island of New Zealand . The other species of the chamois, R. pyrenaica (Pyrenean chamois) live in the Pyrenees, the Cantabrian Mountains, and the Apennine Mountains. The chamois has an herbivorous diet. It eats mainly grasses, herbs, and flowers in the summer, and lichens, mosses, barks, needles, and young pine shoots in the winter. When the snow is so deep that it cannot find food, it has been known to fast for two weeks. The common predators of the chamois used to be grey wolves , Eurasian lynxes , and Persian leopards , as well as some brown bears and golden eagles . Humans have established themselves as their main predators, finding them to be popular game animals with tasty meat. Chamois is also used for the soft, pliable leather made from its skin. Common causes of mortality to chamois include the threats of avalanches, epidemics, human disturbance, competition with livestock for food and space, habitat loss, and hybridization with introduced subspecies. Poaching and overhunting are threats from human predation. The mating season of the chamois is around late November/early December when males have fierce battles with each other for the attention of unmated females. It is during this time that the tails of both sexes are visible. Pregnant females have a gestation period of 170 days. A baby chamois is called a kid. Females give birth to a single kid or the occasional twins in May or early June. If the mother dies, other females raise the kids. Kids are weaned at 6 months and are fully grown at one year, but they do not reach sexual maturity until 3-4 years of age, with some females ready to mate as early as 2 years old. Once the males reach sexual maturity, dominant males force them out of their mothers’ herds. They then wander nomadically until they establish themselves through breeding at 8-9 years. Chamois typically live up to 22 years in captivity and 15-17 years in the wild. The latest estimated population of these animals in Europe is approximately 400,000. Since they were introduced into New Zealand in the 20th century due to environmental changes in their native habitat, their numbers rapidly increased to almost 100,000 by the 1970s and they threatened the local vegetation. Since then, the chamois population has decreased by about 20,000. According to the IUCN Red List, the northern chamois populations have a status of least concern and are remaining stable . The southern chamois populations also have the same status and increasing . These animals are difficult to house in zoos, instead of being a common captive species in a number of game parks and nonscientific institutions in Europe. However, it can be seen at the Toronto Zoo and the Munich Zoo Hellabrunn .",
        "score": 0.7040563
    },
    {
        "Name": "Maned Wolf",
        "Genus": "Chrysocyon",
        "Diet": "Omnivore that eats small- to medium-sized animals including rodents, birds, fish, and rabbits; vegetable matter including tubers, fruit, and sugarcane",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Reddish brown or golden orange fur with a black mane",
        "Fun_Fact": "Despite its name, the Maned Wolf is not actually a wolf.",
        "Text": "“The Maned Wolf is the largest canid in South America.” The Maned Wolf is found in Argentina, Brazil, Paraguay, and other countries in eastern and central South America. They have very long and skinny legs, making them the largest canine in South America. Their long legs almost make them look like a fox on stilts. In addition to these distinct legs, Maned Wolves also have a very easily recognizable black mane. Their fur is reddish-brown or golden-orange in color. These canids are solitary animals. They do not hunt in packs, unlike many other canines. They can be found in grasslands, savannas, wetlands, forests, and marshes. • The Maned Wolf is not a wolf or a fox. Rather, it is the only species in the Chrysocyon genus. • These animals communicate by marking their territory with urine or barking loudly. • In addition to hunting small animals, they eat fruits and vegetables. • Maned Wolves live an average of 12 to 15 years. • Loss of their habitats is the greatest threat these animals face. The Maned Wolf’s scientific name is Chyrsocyon brachyurus. Chyrsocyon, which means golden dog, is the genus the animal belongs to. It is the only species in the genus. Brachyurus refers to the Maned Wolf’s tail. They are part of the Mammalia class and Canidae family. Originally thought to be closely related to true wolves, the mane wolf is actually a closer relative of wild dogs and wolf-like foxes, although they are still a distinct canid genus and species. This animal can trace its history back 6 million years ago to when many of the larger canids in South America became extinct. Fossils of the mane wolf dating back to the Pleiostine era have indicated that they are the only large canids to survive elimination. Its once closest relative, the Falkland Islands wolf, is now extinct. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The fur of these canids is golden orange to red/reddish-brown in color. As their name suggests, they also have a black mane that makes them easily identifiable. Maned Wolves also have very long black legs. These long legs sometimes referred to as stilts, are believed to be an adaptation to the very tall grasslands in their habitat. In fact, these animals are the tallest of all the wild canids. Adults weigh about 51 pounds, which is about the weight of a large bag of dog food. Their body is about 39 inches long from their head to rear. Their tail adds another 18 inches or so to their total length. Maned Wolves are about 35 inches tall. Additionally, they are very large ears that are around 7 inches long. Whereas Gray Wolves, African Hunting Dogs, and most other canid species form packs, the Maned Wolf is a solitary being. Most times, they will hunt alone. They are crepuscular animals, which means that they are most active during twilight hours (between 8:00 and 10:00 am and 8:00 and 10:00 pm). These canids communicate using their urine. They use it to mark the spots where their pretty is buried and their hunting paths. Their urine’s smell is very distinct and easy to recognize; many people believe it smells similar to cannabis. These animals are found in central and eastern South America. Some of the countries they inhabit include Brazil, Paraguay, Argentina, Uruguay , Peru, and Bolivia. Maned Wolves live in the cerrado, which is the largest biome found in South America. This biome is made up of grasslands, forests (both wet and dry), wetlands, marshes, and savannas. It is also possible to find these canids hunting in the pastures around farmland, though they will not prey on farm livestock. Maned Wolves are omnivores, which means they eat both plants and animals. Plants can make up 50% or more of their diet. Some of the vegetation they enjoy eating includes fruit, vegetables, sugarcane, and tubers. One of their favorite foods is lobeira. Loberia means “fruit of the world” and is a small berry that resembles a tomato. They also hunt to catch small- and medium-sized animals. Some of the animals they prey on include rabbits , mice and other rodents, pampas deer, armadillos , and giant anteaters . When hunting for food, they use their large ears to listen closely for animal sounds. They will rotate their ears to help them hear better. When they hear something, they use their feet to tap the ground to get their prey to come out. The method they use to catch their prey can vary, depending on which type of animal they are catching. For example, they pounce after smaller animals that may be running away, dig to follow burrowing prey, or leap up to catch insects or birds. Their long legs help them move quickly to successfully capture their prey. Maned Wolves face a few threats, both from their natural predators and humans. Large cats prey on them. The Jaguar is their biggest predator, but Pumas and other cats have also been known to hunt Maned Wolves. Maned Wolves also get diseases such as parvovirus, rabies virus, distemper virus, and canine adenovirus. These diseases are a result of them sharing territory with domestic dogs. The animals can also be killed by Giant Kidney Worms. This parasite is a roundworm that attacks the animal’s kidneys. Humans also pose a threat to Maned Wolves. They have been hunted in different parts of Brazil for their body parts. Their eyes, in particular, were thought to be good luck charms. While they are now protected by laws that prohibit hunting, some people still try to kill these animals. Another major threat to these animals is habitat loss. Humans developing the lands where the Maned Wolf lives and hunts are resulting in less livable space for them and reduced animals to prey on in some areas. Automobile collisions also kill them. While these animals are not considered endangered, there is concern that their numbers have been decreasing. The International Union for Conservation of Nature (IUCN) classified Mane Wolves as near-threatened . The mating seasons for these canids are between November and April. Females only enter estrus once a year. Estrus is the set of physiological changes to a female’s body that occur due to the presence of reproductive hormones. During courtship, males approach females and engage in an anogenital investigation. A female’s estrus period lasts for four days. During this period, copulation occurs. At the end of the four days, the male and female will engage in 15 minutes of intercourse. Unlike some other animals, male Maned Wolves also only produce sperm during the mating season. The gestation period is between 60 and 65 days long. Two to six puppies will be born in each litter. When first born, the puppies are very small; they weigh just about 1 pound. For the first 10 weeks or so, the puppies will have black fur. After this time, it will turn red. Their eyes won’t open until they are about 9 days old. The puppies are dependent on their parents for food during their first year. They are breastfed until they are up to 4 months old. After they are 3 weeks old, the puppies also receive regurgitated food from their parents. While the males may provide some help in caring for the young, the females are primarily responsible for this task. While the exact lifespan of wild Maned Wolves is not known, scientists estimate that they have an average lifespan of between 12 and 15 years. One Maned Wolf at the São Paulo Zoo is reported to have lived 22 years. Sadly, the threats faced by these animals are causing their population to decrease. It is estimated that there are around 23,600 Maned Wolves left in the wild. They have a conservation status of near-threatened .",
        "score": 0.7011063
    },
    {
        "Name": "Meerkat",
        "Genus": "Suricata",
        "Diet": "Carnivore that eats insects, rodents, lizards",
        "Behavior": "They usually live in gangs or bands.",
        "Features": "Dark bands around eyes and white face",
        "Fun_Fact": "One will stand on guard to watch for predators!",
        "Text": "The meerkat ( Suricata suricatta ) is a small species of foraging mammal that is found inhabiting the harsh conditions of the open and arid, semi-desert plains in southern Africa. Meerkats differ from the other mongoose species by being unusually sociable animals. Most mongooses are more solitary while meerkats are one of only 3 other species known to live in groups larger than pairs. There are three different sub-species of meerkats that are found in varying geographic locations and although they are very similar in appearance, they differ slightly in their fur colouration and markings. In addition to the suricates, ( Suricata suricatta ) there is the slender-tailed meerkat and the grey meerkat. All however, live in highly organised communities known as gangs or bands, that rely on one another for their survival in such hostile conditions as whilst the majority of the group is out foraging for food, others stand on guard to keep a watchful eye out for approaching predators. The meerkat is a small-sized animal that has a long and slender body with a long and light but black-tipped tail that can almost double the animal’s total length. Meerkats are sandy to light brown in colour with eight darker stripes on their back, markings on their sides (which are unique to the individual) and a lighter face and underside. They have elongated muzzles with black noses and dark-coloured bands around their eyes. Meerkats are animals with long, sharp claws on their front paws that are curved and can grow up to 2cm long and help them to both dig their burrows and to find small animals that are buried beneath the soft sand. The fur of the meerkat has actually adapted remarkably to the differing desert conditions, not only helping to keep the animal cool during the boiling hot days but also acting as a layer of insulation to keep it warm during the freezing-cold winter nights. Meerkats belong to the mongoose family ( Herpestidae ) which is a branch of Feliformia – the cat-like carnivores. This includes all species of cats, hyenas, civits and mongooses. Mongooses evolved from cats nearly 45 million years ago – with the first modern mongoose appearing over 11.5 million years ago. Suricata Suricatta major, an extinct meerkat whose fossilized remains have been found in the southern tip of Africa, is the direct ancestor of modern meerkats. This extinct meerkat was quite similar to the banded mongoose from which it evolved. As the climate changed and warmed, meerkats made adjustments to adapt successfully to their new environment. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The meerkat is an animal found in southern and western Africa inhabiting the dry and hostile scrublands of the Kalahari Desert. Spanning five different countries in southern Africa from Angola to South Africa, meerkats are found throughout this vast, arid region foraging for food on the ground during the day and retiring into their immense burrows in the sand at night. Conditions in the Kalahari Desert are incredibly extreme with temperatures reaching up to 40 degrees Centigrade in the summer (with a sand temperature of 70 degrees), and falling well below zero down to -10 degrees during the bitter, winter nights. This area of Africa has an incredibly low level of annual rainfall with only a rare, small amount falling generally between January and April and after which, the Kalahari briefly transforms into a well-vegetated and life-filled region before the cooler winter months set in. Unlike all but three other Mongoose species, the meerkat is a highly sociable animal that inhabits territories in the desert in groups that usually contain between 10 and 30 individuals (although much larger bands are not uncommon in areas where there is an ample supply of food), and consist of three or four family units of a male and female pair, with their young. After emerging from their burrow to sunbathe in the early morning sun, the majority of the band goes off to forage for food while others either babysit the young, or act as guards. By standing upright on their hind legs and tails on the top of mounds and in bushes, meerkat guards are able to have a good vantage point to watch out for approaching predators, particularly from the sky. One of a series of different alarm calls will then be sounded to alert the rest of the group what the danger is, often causing the whole band to dive into their underground burrow to hide. You can check out some incredible facts about meerkats . Although there may be a number of breeding pairs in one band, meerkat society is generally dominated by one male and female pair. Young meerkats are usually born in November after a gestation period that lasts for around 11 weeks. Having mated with her partner at the start of the summer, the female meerkat gives birth to between 2 and 5 small kits in a grass-lined chamber in the burrow, that are born blind and without their full coat of fur. Unlike with the rearing of numerous other small mammal species, both females and males tend to their young with males and siblings known to help to teach the young meerkats the skills of surviving in the surrounding desert. Whilst the majority of the band is out foraging for food, the young meerkats never stray far from the den and whilst playing in the hot sand, are kept a watchful eye on by an appointed babysitter. Meerkats can live for up to 10 years in the wild but have been known to live for longer in captivity. The meerkat is a carnivorous animal which means that despite its small size, it only forages for and eats small animals in order to gain all of the nutrition (and most of the moisture) that it needs to survive. Like other mongoose species, meerkats have an excellent sense of smell which is used to sniff out potential prey that is lurking just under the surface of the sand. Once detected, meerkats then used their long and sharp front claws to dig out their prey, with the majority of their diet being made up of insects and other small invertebrates, along with also eating larger animals such as lizards and rodents. Due to the fact that meerkats are small in size and have adapted to living in such a harsh environment, they must spend a lot of their waking hours foraging for food as they are known to lose around 5% of their body weight during the night and must therefore ensure that they have enough to eat every day. Due to the small size of the meerkats, they are natural prey to numerous animal species that are both on the ground and in the air. The biggest threat to meerkats are birds of prey such as hawks and eagles that can spot these animals from high above their heads, along with ground-dwelling predators such as snakes that hunt them on the ground. In order to try and protect themselves from being so vulnerable in their open and arid surroundings, meerkats adopt the safety-in-numbers tactic and ensure that there is always an individual on guard to warn the rest of the group of any approaching danger. In places that are closer to growing human settlements and near areas where domestic animals are grazed, meerkats have been known to contract both bovine diseases and rabies that can affect whole populations of these adaptable and otherwise resilient animals. If the individual meerkat on guard spots approaching danger they will sound the alarm to the rest of the group. Meerkats are known to use a wide range of vocal calls to communicate with one another sounding long howls to warn the rest of the band of an approaching bird of prey and using short double-barks to alert them of a predator nearing the group on the ground. The individual territory of a meerkat group covers a large enough area to ensure that the band has everything they need to be most successfully survive. This includes areas of both hard and soft sand as although the hard sand provides the perfect ground for building their tunnels in, it requires more energy for meerkats to forage for food in it too. Digging in the softer sand requires less effort and therefore means that they can conserve more energy for other activities. The meerkat is one of those species that has always fascinated people with their characteristic behaviours have made them one of Africa’s most iconic small mammal species. The real delights into meerkat life were displayed in the BBC series Meerkat Manor which involved the following and filming of one band of meerkats in the Kalahari Desert. Although they are not threatened by human activity as drastically as a number of Africa’s other unique species, meerkats have been susceptible to contracting diseases from other animals which can have devastating implications on local populations. Today, the meerkat is an animal listed by the IUCN as being of Least Concern from being extinct in its natural environment in the near future. Although they are widespread and common throughout much of their natural range, populations in certain areas can be affected by the lack of rainfall or increasing numbers of their natural predators. Populations across southern Africa however, appear to be generally stable with large numbers of meerkats also found in a few of the big national parks.",
        "score": 0.70043665
    },
    {
        "Name": "Roadrunner",
        "Genus": "Geococcyx",
        "Diet": "Omnivore that eats insects, small reptiles, rodents, small birds, fruits, and seeds",
        "Behavior": "They can be characterized as mainly solitary.",
        "Features": "Head crest",
        "Fun_Fact": "Roadrunners are one of the few animals that prey on rattlesnakes and tarantula hawk wasps.",
        "Text": "The roadrunner ( Geococcyx) is a large ground bird in the cuckoo family, inhabiting desert regions in North America. They spend much of their time swiftly running on the ground and waiting for prey like rattlesnakes, scorpions, and tarantula hawk wasps. And unlike their cartoon portrayals, these speedy birds can’t quite keep up with the coyote. Learn everything about the famous roadrunner, including where it lives, what it eats, and how it behaves. Roadrunners live in North and Central America in six countries, including Mexico , the United States, El Salvador, Guatemala, Honduras, and Nicaragua. The greater roadrunner resides in Mexico and the Southwestern and South-Central United States, and the lesser roadrunner lives in Mexico and Central America. They inhabit arid lowland and mountainous shrublands and woodlands, staying in their environments year-round. Look for these birds on the ground, walking or running as they search for food, and listen for their dove-like coos. Roadrunners build their nests with sticks, leaves, feathers, snakeskins, and dung. They place it in a tree, shrub, or cactus around three to ten feet above the ground. The roadrunner ( Geococcyx ) belongs to the Cuculiformes order in the Cuculidae family, which includes the cuckoos. Roadrunners are also known as chaparral birds. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Geococcyx genus comprises two roadrunner species: The Archaeopteryx is the earliest known bird with fossils dating 150 million years ago. A range of birds with more “bird-like” features appeared after Archaeopteryx and gave rise to modern birds in the Late Cretaceous. It is believed that bird-like dinosaurs, primitive birds, and early modern birds all co-existed for a time. The oldest known fossil of a roadrunner was found in a cave in New Mexico and is estimated to be 33,500 years old. Fragments from 25 greater roadrunner fossils have been found in the La Brea Tar Pits in California. Roadrunners are large ground cuckoos, measuring 22 to 24 inches and weighing eight to 15 ounces, with a 17- to 24-inch wingspan. These birds feature slender bodies, long legs, broad tails, and large bills. They are black and brown with white streaks and feature a distinctive head crest. They also have bare skin patches behind each in shades of blue and red. These birds and other cuckoos have zygodactyl feet that aid their fast speeds. Their feet also make X-shaped markings on the ground, which appear to move in both directions. Roadrunners are relatively solitary and prefer to be alone or in pairs. However, if you see a rare flock of roadrunners, you can call them a “marathon.” These species make a slow, downward-slurring dove-like coo (not “meep meep”). And it can also cause rapid clattering sounds with its beak. They are relatively strong fliers but prefer to spend much of their time running on the ground. The roadrunner can reach speeds up to 26 mph! Roadrunners are nonmigratory and stay in their environments year-round. The roadrunner is an opportunistic omnivore who primarily eats insects and small reptiles. Their diet consists of crickets, grasshoppers, caterpillars, beetles, lizards , snakes, rodents, spiders, scorpions, centipedes, snails, small birds, eggs, fruits, and seeds. It is one of the few animals that prey on rattlesnakes and tarantula hawk wasps. The roadrunner hunts on the ground, hiding under cover and running after prey. It can leap into the air to catch insects and then smashes them against the ground. The IUCN lists both species of roadrunner as LC or “least concern.” Due to their extensive range and large, stable population, these species do not meet the “threatened” status thresholds. Their biggest threats include illegal shooting, habitat loss, and fragmentation from urbanization (development and traffic). Roadrunner predators include coyotes (of course), raccoons , skunks, domestic cats, hawks, and other birds of prey. Pairs will defend their territories from their kind and other threats. However, they often fly or run away from predators, as they generally get away quickly. But, unlike the cartoon, roadrunners are no match for the Wiley coyote, who can run over 40 Mph. Roadrunner pairs are monogamous and mate for life, defending their territories together all year. During courtship, males perform displays and dangle food from their bills to entice the females. Once pairs form, their reproductive season lasts from spring to mid-summer. Females lay two to six white eggs, and both parents take turns incubating for 19 to 20 days. Their young fledge the nest two to three weeks after hatching but forage with their parents for a few more days after leaving. They become sexually mature around two to three years and have an average lifespan of 3.5 years. However, they can live up to seven or eight years. The global roadrunner population is unknown, but the lesser roadrunner alone has an estimated 500,000 to 5 million mature individuals. Data trends show both species have stable populations with no extreme fluctuations or fragmentations.",
        "score": 0.6998037
    },
    {
        "Name": "Cow",
        "Genus": "Bos",
        "Diet": "Herbivore that enjoys grass and especially likes seeds, flowers",
        "Text": "“…roughly one cow for every seven humans on earth…” Cows are animals that are found all over the world. They were domesticated by humans over 10,000 years ago for work, dairy, meat, and more. However, scientists are still learning much about their complex brains and emotions. These gentle giants range from 700 lbs, to as big as a car, with some having long horns, humps on their backs, colorful patterns, or other incredible traits! While technically a ‘cow’ only refers to a female, the term is often used to describe any animal of the species regardless of gender. The technically correct term for a group of animals in this species is ‘cattle’. Check out more incredible facts about cows . The scientific name for a cow is Bos taurus . Bos Taurus is the largest in the category of bovinae . Two major subspecies of cow are the indicus and the taurus (or Bos taurus taurus). Indicus traces its roots to southern Asia, particularly modern-day India. Meanwhile, the taurus traces its origins to Europe. The predecessor to modern-day cows was the auroch. The auroch was an undomesticated bovine that lived in what is now Turkey and Pakistan. As cows were domesticated, they were interbred and soon started to spread across different civilizations. Researchers have found that the genetics of cattle brought to the Americas during Spanish colonization have traces of serval different bovine lineages, showing the historical mixing of breeds from African cows and European cows. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Cows are animals that come in a wide array of breeds, colors, sizes, and even shapes! Standing on four legs with hooved feet, the average adult cow weighs a little less than a small car–about 1,500 pounds. This varies depending on breed, ranging from the Chianina cow , which grows to over 3,700 pounds, to the Dexter cow , which tops out at about 750 pounds. These breeds stand six feet and three feet tall at the shoulder, respectively. Most cows have a thin layer of bristly hair, but certain breeds have longer hair. These skin and hair combinations come with a number of distinct patterns. The holstein is the most well-known style, with irregular black and white shapes, with a strip of white between the eyes. A “red” holstein has brown or reddish brown patches in place of the black. Angus cows are black from head to tail. The Highland cow features long, shaggy, brownish-red hair. Though there are hundreds, if not thousands, of breeds with different markings, most feature variations on gray, brown, black, and white hides. Indicus cows of any breed have another feature: a “hump.” This protrusion on the back of these cows’ necks is the easiest way to tell them from taurus cows. Almost all cows have horns. These range in length and shape across breeds. Sticking almost straight out to the sides from its head and reaching roughly three feet long each, the horns on a Texas Longhorn cow are easy to spot. In fact, a Texas longhorn holds the Guinness World Record for cow horn length, measuring over ten feet long from one tip to another. Meanwhile, a Brahman cow has roughly six-inch-long horns that point up and back from its head. The English longhorn can have horns that point mostly downward, curving similarly to a sheep’s horns. A group of cows is called a kine. And a group of cattle is a herd. Check out this article to learn more about group cow names and how they function. There are over 250 different types of cows throughout the globe, and American ranchers alone have around 80 breeds in which to access. Here are some of the top cow breeds: Recent research has found that cows are really smart, complex animals! They can learn, have memories, figure things out, and can even tell one cow from another. They have personalities too, with scientists documenting cows who are bold, shy, playful, and other traits. Cows also show emotion. When they’re scared or anxious one can see more of the whites of their eyes, such as when a mother is separated from her calf. In addition, their ears will hang more loosely when they’re feeling o.k. Their mood can also be affected by the mood of other cows, what scientists call “emotional contagion.” For example, a cow might eat less or act more anxious, simply because other cows in the herd are scared or hurt. Cows are animals that can survive in many climates and places. The indicus subspecies are better suited to tropical environments, while taurus cows can survive easily in winter climates. In general, cows need access to a wide range of space, so they can graze on grasses. Whether in the mountains, jungle, or wide open plains, cows can adapt to many different environments. Cows are herbivores, which means they eat grass and other plants. Cows can eat a wide range of tough grasses thanks to their very unique way of eating. A cow will first bite plants or grass and swallow them unchewed. This unchewed food goes into its first stomach until later. When the cow finds a quiet place, it will begin to vomit the plants back into its mouth. This vomit is called “cud,” and the cow will chew the cud down into smaller pieces for further digestion. Cow predators include dogs, coyotes, bobcats , and similar animals. Because most cows are on farms, the threat of predators is typically small. In the United States, for example, only two percent of all farm cow deaths were the result of predators. Most of those predators were dogs, followed by coyotes. The bigger threat to cows comes from disease. Because cows move in herds, one sick cow can quickly infect others. Depending on the type of infection, this can cause big problems. For example, some worry about a return of Foot and Mouth Disease (FMD). FMD doesn’t affect humans but can wreak havoc on cows. FMD is spread easily for miles, and can quickly infect a whole herd. Governments take cow diseases very seriously. In 2003, reports that some U.S. cattle were infected with a disease called “mad cow disease” resulted in governments not allowing U.S. beef in their countries. This costs beef farmers roughly $11 billion in lost sales. Cows begin their life after a nine-month pregnancy. Following a live birth, the baby, known as a calf, will nurse for a few months before weaning. The baby can typically walk shortly after birth. It will take about one to two years for a cow to grow to the point that it can start having babies of its own. Cows typically have one baby at a time. Most farm cows are bred artificially–that is, a sperm is implanted in the cow. This helps farmers to avoid certain genetic problems. As an adult, a cow will give birth to a single calf once every two years or so. Though the natural lifespan of a cow can go over twenty years, most cows don’t live too much beyond ten years. This is because the majority of cows are part of a farming operation, and after a few years of milk production, cows are typically then tagged for meat processing. Numbering over 1.4 billion , there’s roughly one cow for every seven humans on earth. This makes cows and cattle the second most abundant farm animal in the world. Though there are select areas of wild cows, the majority of bos taurus are domesticated. This means they were raised to live on a farm. Though cows in general are not at risk, certain breeds are significantly less common than others. Various conservation groups work to retain rare breeds of cows, such as the Dexter.",
        "score": 0.69893426
    },
    {
        "Name": "Kangaroo Mouse",
        "Genus": "Microdipodops",
        "Diet": "Herbivore that enjoys seeds",
        "Behavior": "They can be characterized as solitary.Their aggression level is low.",
        "Features": "Long tail making up about half of the total body length",
        "Fun_Fact": "The Kangaroo Mouse is a tiny mouse that stands and hops around on its hind legs, much like a kangaroo.",
        "Text": "The Kangaroo Mouse is native to the deserts of the southwestern United States . It is a tiny, nocturnal mouse with more giant hind legs, much like the Australian Kangaroo . It has a habit of bipedal locomotion by hopping about on its hind legs. There are two species of Kangaroo Mouse; both can be found in the state of Nevada . The Kangaroo Mouse is a mammal in the Mammalia class. It is in the Heteromyidae family and the Dipodomyinae subfamily. This family includes two Genera; Dipodomys includes 20 species of Kangaroo rats, and Microdipodops, which includes 2 species of Kangaroo Mice. The two species of Kangaroo Mice are: Microdipodops is derived from a few ancient words. “Micro” is derived from the Greek word for small. “Dipod” is derived from the Greek word meaning “two legs.” “Ops” comes from the Latin word meaning “Plenty,” and Ops was the name of the fertility god in ancient Roman religion. The Kangaroo Mouse looks like a typical mouse with a few distinguishing features. They have large hind legs that they typically stand on like a kangaroo. Their fore legs are proportionately small, their fur is long and silky, and they have a long, slim tail with fur at the end that helps them balance when standing and hopping on their hind legs. The average Kangaroo Mouse is 160 mm in total length, or about the length of a typical ink pen. The length of the tail averages about 84mm, which makes their body and tail overall about the same length. The average weight of a Kangaroo Mouse is about 13.5 grams, slightly less than the weight of three US 25-cent coins. Their rear foot is about 25 mm long. As you can see, their rear foot is large proportionately to their body and is about 1/3 the length of their entire body. Their head and ears are proportionally large to their body, so overall they appear to be one round furry ball with large hind feet and a long tail. The difference between the dark and pale Kangaroo Mice is the color of their fur as the names suggest. The dark Kangaroo Mouse has dark brown fur, and the pale Kangaroo Mouse has lighter, pale brown fur. The fur colors help camouflage the mice against their backgrounds in specific regions. Kangaroo Mice live alone and are independent of others of their species. They live in burrows and spend much of their time there. The mice have their young in the burrow, store food in it, and only leave at night under the right conditions to forage for food. They typically hop around on their two hind legs but sometimes may walk on all four. They forage for seeds mixed into the soil and collect them into external cheek pouches. The seeds are hoarded in the burrow and only shared with dependent young. Kangaroo Mice live in the southwestern deserts of the United States. The Dark Kangaroo Mouse can be found in California, Idaho, Nevada, Oregon, and Utah. The Pale Kangaroo Mouse can be found in California and Nevada. Kangaroo Mice live underground in burrows between 3 feet to 8 feet long. They use the burrows in the winter to protect them from the cold, and during the summer, they stay in them throughout the day to protect them from the desert heat. Kangaroo Mice are nocturnal, and their eyes are susceptible to light, so they can see best in very dark environments. This is both a survival and a defensive adaptation. The desert heat and sun are scorching, so they only leave the burrow two hours after sunset. They also avoid nights with bright moonlight, and this prevents them from being easily spotted by predators. Kangaroo Mice eat mainly tiny seeds from the vegetation and shrubs in the Sagebrush scrub zone of the southwestern US deserts. In the summer, they may consume insects as well. They do not drink water, so they do not have to live near a water source. They have efficient kidneys and can metabolize all the water they need from their food. Since they are not active in the winter, they store food in their burrows. Some are known to have food stored in multiple locations in case an intruder compromises their burrow. During the summer, their body stores fat from the food they eat in their tail. The Kangaroo Mouse populations are plentiful and are listed as the least concern by the IUCN . Their populations are believed to be declining; however, since they live in remote regions of the desert, their habitat destruction is currently not seen as an issue. The main predators of the Kangaroo Mouse are owls , weasels , rattlesnakes , foxes , badgers , and coyotes . Most of these predators will use an ambush method to capture the mice. Since the mice are only active during dark nights and use their burrows for safety, actively hunting them can prove challenging. The Kangaroo Mouse also has sensitive ears, so they can hear predators coming in the dry desert environment. Predators of Kangaroo Mice include owls, weasels, rattlesnakes, foxes, badgers, and coyotes. Kangaroo Mice eat mainly seeds and sometimes insects. Not much is known about the mating specifics of Kangaroo Mice. Since they mainly live in their burrows, any mating rituals and the young can not be observed. After the winter hibernation and early spring, Kangaroo mice begin breeding. They are promiscuous, with multiple males mating with multiple females. Pregnant females have been observed from the early spring to early fall, so it is thought that they have multiple litters per season. The gestation period is between 22 to 27 days, and the females will have 2 to 7 young at a time. The females will feed and care for the young until they are old enough to leave the burrow, which is thought to be just a few weeks. The average lifespan of an adult is about 5.4 years. Population data for Kangaroo Mice is not known. It is thought that their populations have been decreasing over the past few years due to agricultural development. Since they live in remote regions of the southwestern US desert, their conservation status is not a concern. Kangaroo Mice are similar to the Kangaroo Rats that make up their sister Genera. They are also similar to the Hopping mouse, native to Australia, and the Springhare, native to southern and eastern Africa .",
        "score": 0.6987149
    },
    {
        "Name": "Jackal",
        "Genus": "Canis",
        "Diet": "Carnivore that enjoys antelope and especially likes reptiles, insects",
        "Text": "Jackals communicate with members of their pack using howls, growls, yipping, and even hooting sounds. Jackals are animals that make their home in different parts of Africa as well as in European countries such as Greece, Romania, Italy, and Bulgaria along with others. They are omnivores eating both plants and meat. A male and female jackal are monogamous meaning they stay together throughout their lives and the pair raises their pups together. These canines can live up to 12 years in the wild. • Jackals in captivity can live as long as 16 years. • Jackals are animals that hunt in pairs instead of looking for prey alone. • A group of jackals is sometimes called a pack or a tribe. • Jackal animals usually have from two to four pups in a litter. • These creatures are canines with relatives that include coyotes , foxes , and wolves . The origin of the Jackal can be traced back 5 million years to the West Coast of South Africa. In fact, a new discovery of fossils from a new species found on the West Coast of South Africa has unearthed the African origins of the jackal. That means that scientists can trace its history on the continent back 5 million years ago. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . There are four representative species of Jackal. Those species are: The scientific name of a common jackal is Canis aureus . The word Canis is Latin for dog and aureus means golden. So, it makes sense that another name for the common jackal is the golden jackal. Its family is Canidae and its class is Mammalia. Along with the common jackal animal, there are two other species including the side-striped jackal and the black-backed jackal. The only difference between these three species is the color of their coat and the specific habitat they prefer to live in. The common jackal has a coat that is a mixture of yellow, brown, and gold. The appearance of a jackal’s coat can become darker or lighter with the change of seasons. If you have a dog, you may notice that its coat gets thicker or changes color a little bit with the seasons. A similar process happens with these animals. The jackal animal has a long slim nose, large ears, and even a bushy tail that makes it look very similar to a fox. Remember, foxes and jackals are close relatives! Jackals have four slender legs, trim bodies, and dark eyes that are always keeping watch on their surroundings. A jackal measures around 16 inches tall from its shoulder and weighs from 11 to 26 pounds. If you put one number two pencil on top of another, then you are looking at about the height of a common jackal. Alternatively, a 26-pound jackal weighs about the same as an average-sized dachshund. These canines are fast runners, with the fastest speed for a jackal being 40 mph. They can run in short bursts of tremendous speed or for longer periods of time at a lower rate of speed. This speed helps them catch their prey and can keep them safe from some predators. The color of their coat helps them to blend in with their territory. Just think of how easily a common jackal would disappear into the light brown grass on the African savanna! This camouflaging helps to protect it if predators are in the area. A jackal that is walking alone is likely to run away from a threat while a large group of jackals may stand their ground against a predator. A pack of jackals may even be able to overwhelm a leopard or a hyena . At the very least, a large pack may be able to chase the predator away. These canines are known to defend their territory using their sharp teeth and claws to drive any intruders away. A jackal’s fierce protection of its territory is a characteristic it shares with its wolf , fox , and coyote cousins. Not only is it protecting its home, but it’s also protecting any pups in the area. Jackals live in groups that can number anywhere from 10 to 30. They are called packs or tribes. These animals are normally shy and try to stay out of sight by taking cover in tall grass, in crevices of rocks, or behind trees. The only time they show aggression is when their territory is threatened by an intruder. One of the most interesting things about jackal animals is their form of communication. In short, not all howls, growls, and yips are alike in the world of jackals. The members of a pack or tribe have unique sounds they make in order to deliver a message to the rest of their family. All packs of jackals have their own sounds, so families in the area don’t receive mixed messages! One howling sound may mean that a jackal has killed prey and wants everyone in the family to eat. A yipping sound may warn other members of a pack there’s a predator in the area. The side-striped jackal is said to make a hooting sound similar to an owl . This unique sound has earned it the nickname ‘o loo’ in Uganda. These animals live in Africa and some European countries. In Africa, they’re found in the western and central parts of the continent in Senegal, Nigeria, and South Sudan. They also live further south in Zambia and Zimbabwe . The specific type of habitat a jackal lives in differs depending on which of the three species you’re looking at. Common or golden jackals live in savannas and deserts while side-striped jackals prefer wetter habitats like marshes, bushlands, and even the mountains. The black-backed jackal lives in woodlands and savannas. Though the regions are different, all three species can be found in Africa. The long legs and sturdy feet of these canines allow them to easily travel the lengthy stretches of land while hunting. Their paws can withstand heat as well as rough dry ground. They use their sense of hearing and smell more than their vision to find prey. They are active mostly at dusk and dawn. This is so they can avoid moving around in the hottest part of the day. Like domesticated dogs, they sleep a lot in the daytime. What do these canines eat? These canines are omnivores eating birds, berries, plants, rabbits , frogs, fruits, snakes, and small antelopes . Some scientists refer to jackals as opportunistic feeders. This means that they may steal leftover meat from prey killed by another animal. They take the opportunity to eat whenever they find food even if they didn’t hunt or kill it. Usually, these canines hunt in pairs. This is so they can work together to trap and take down their prey. Though they have sharp teeth, these creatures are small, so it helps for two jackals to be cooperating as they hunt – especially if they’re going after larger prey. These canines have a few predators including eagles , leopards , and hyenas . All of these predators have great speed, strength, or both, making it fairly easy to capture a young jackal. It’s not unusual for an eagle to fly down and capture a pup that’s playing outside its den. Sometimes when their food sources are scarce, these animals make their way onto a farmer’s property to kill livestock. Some jackals are shot by farmers for this reason. Another human threat to them is the loss of habitat due to land development and construction. The official conservation status of these animals, according to the International Union for the Conservation of Nature (IUCN) , is least concern . In fact, their population is believed to be on the rise. This canine has just one mate throughout its life. The mating season for the common jackal goes from October to March. The gestation period is 57 to 70 days. Coyotes , foxes , and wolves have a gestation period of about the same number of days. A male and female work together to find or make an underground den where the babies will be born. A female gives live birth to two to four babies, also called pups . Newborn pups are very small weighing less than a pound. They are born blind and nurse from their mother as well as consuming small amounts of soft food. At ten days old, the pups’ eyes open and at two months they begin to eat solid food. Because they are so small, pups are vulnerable to attacks from eagles , leopards , and hyenas . In fact, many of these pups don’t survive until 14 weeks old. As a way to protect her pups, a mother moves her litter to different underground dens every few weeks. This makes it challenging for a predator to pick up and stay with the scent of the pups. Both the mother and father care for the pups teaching them how to hunt when they are about six months old. A pup may leave its parents at 11 months of age to strike out on its own. Or it may stay with its parents to help care for other pups in other litters. Jackals living in the wild live to be 10 to 12 years old. Wild jackals are vulnerable to many of the same ailments that a dog might face. For instance, they can contract rabies. A jackal that is old or injured is also more likely to be targeted by a predator than a young, healthy animal. Of course, these canines that are well cared for in a zoo or wildlife preserve can live longer, up to 16 years old. The population of common jackals in India is more than 80,000. However, scientists are unsure of the population of these animals in Africa. The population of this species of jackal is believed to be increasing. Its official conservation status is the least concerning.",
        "score": 0.6961863
    },
    {
        "Name": "Jerboa",
        "Diet": "Omnivore with no preference",
        "Text": "A jerboa’s tail is usually longer than its head and body combined. The jerboa is a small, hopping rodent that lives in the deserts of Northern Africa and Asia. Jerboas are very cute and have exceptionally long ears, tails, and hind feet that cause them to look like a caricature instead of a real animal. They can also leap several feet in a jump because of their specially adapted legs. The jerboa is part of the rodent family Dipodidae, which originates from the Greek words “di,” meaning “two,” and “podos,” meaning “foot.” This is because they have such small arms that it appears as though they have have only their two hind feet. The Jerboa belongs to five subfamilies of Dipodidae and are related to jumping mice and birch mice . Jerboa genera include There are thought to be 33 different species of jerboa. Among them are: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Scientists have traced the evolutionary history of the Jerboa back to somewhere between 11.2 and 16.4 million years ago, according to fossil evidence in north Africa and Asia. Jerboas are animals that have earned a reputation for being extremely cute as well as resilient. These tiny desert rodents have a distinctive appearance and thrive in the harsh, dry desert environments of Eastern Europe, Northern Africa, and Asia. There are approximately 33 species of jerboas. They all share the same general features of a tiny, mouse-like head; large, owlish eyes; disproportionately long ears, and a long, powerful tail. They also have very short arms and long, cat-like whiskers that they use to navigate their environments. As its name suggests, the long-eared jerboa has even longer ears than other species of this rodent! These features have a purpose. The bent hind legs enable Jerboas to leap up to 10 feet at a bound when necessary for speed. They can also use all four limbs for hopping, but use just the hing legs for walking. The long tail is like a prop when standing and is used for balance springing up. Jerboas only grow to be two to six inches long, and their tails can be more than twice as long as their head and body combined. Both males and females share a similarly soft, sand-colored coat of fur that helps them blend into their desert surroundings, and both sexes only weigh about an ounce when fully grown – about the weight of a standard lightbulb. They are crepuscular, which means that they are most active in the twilight period of the day, but they are also active at night. Their enormous eyes and long whiskers help them to navigate the darkness easily. They are generally solitary and secretive creatures as well and usually live alone in burrows. Their shy nature has actually made it difficult for researchers to gather information on their habits and behaviors. The jerboa can be found in Eastern Europe, across Asia, and down through Northern Africa. Jerboas prefer arid desert climates, and their bodies are well-designed to thrive in these hot and sandy habitats. They make burrows in the desert sands and spend most of the hot daylight hours sleeping in these cooler spaces. During the rainy season, jerboas will look for taller hills to burrow into in order to avoid flooding. One interesting fact about jerboas is that they have multiple burrows that they cycle through depending on the time of year. They will create two separate “permanent” burrows to serve as their summer and winter homes, but they will also create temporary burrows while they are out hunting as well. Jerboas hibernate in the winter, so their winter burrows are constructed to maximize warmth and safety. Permanent summer burrows are where jerboa pups are raised after the females give birth. All jerboas are omnivores that live on a diet of plant matter and insects. Certain species may eat more insects than others, but this depends on the availability of food. They also derive all of the hydration that they need to survive from the food that they eat. Most jerboas will never actually drink water in their lives. Jerboas are secretive creatures, which makes sense given their tiny size. Their main predators are foxes , cats , jackals , small owls, and snakes , but they are also threatened by loss of habitat due to human encroachment. Jerboas are secretive creatures, which is a common trait among small mammals. Their main predators are cats, and birds of prey, but it has been reported that ancestral humans caught and ate them as well. However, in the modern era, humans aren’t known to eat these small creatures. Unfortunately, jerboas don’t have a good defense mechanism against predators and have to rely on hiding and jumping to escape danger . Although these adorable creatures may look like pets, it is illegal to keep one as such and should not be attempted. Because of their shy and elusive natures, researchers do not know a great deal about the mating and parenting behaviors of jerboas. Once their winter hibernation period is over and they re-emerge, mating season begins. Jerboas are believed to be polygynous, which means that a single male will often mate with multiple females, but the females will only mate with one male. Researchers do not know this for sure, but many closely related species behave in this way, so it is likely. Females usually breed two times during the summer, and they have a gestation period that ranges from 25 to 35 days. This is considered long for a rodent species, particularly because they have such short lifespans. A typical litter consists of two to six pups, and the mother will care for her babies until they are weaned. When they are born, babies are naked and cannot care for themselves. They develop relatively slowly compared to other rodents as well. Jerboa cannot jump at all until they are 11 weeks old, and they do not reach sexual maturity until 14 weeks – twice as long as it takes for most rodents to mature. Jerboas can live up to six years in the wild. Unfortunately, there is no data on exactly how many jerboas exist in the wild. Researchers have not found a way to get an accurate estimate of their numbers, but the International Union for the Conservation of Nature (IUCN) lists them as a species of least concern that is “widespread but distributed irregularly” due to habitat fragmentation. A jerboa is a small desert rodent that moves by hopping with its long hind feet. It has long ears, large back legs, and enormously round eyes that give it the appearance of a cartoon animal. Despite their cute and harmless appearance, jerboas have been banned in the United States for many years. This ban from the Center for Disease Control extends to all African rodents due to the possibility of these animals carrying monkeypox, a disease similar to smallpox. On its own, the jerboa is as adorable and non-threatening as it appears. They are not aggressive or venomous, but they are considered dangerous to humans. This is because they are likely carriers of monkeypox. The CDC has banned all African rodents, including jerboas and prairie dogs, from entering the country because of this deadly disease. Because they have such long and powerful feet, jerboas often appear to only have two legs. However, jerboas do have small, thin arms that are often kept close to their bodies. Although jerboas resemble mice and are a part of the rodent family, they differ genetically. This means that they are related to mice, but they are not considered mice. Jerboas are not permitted as pets in the United States, but there are some breeders in Europe and Japan that raise them in captivity. However, this is not recommended or enjoyable for the animal. Jerboas are considered to be high-maintenance pets and require a considerable amount of time, patience, and care. By nature, jerboas are skittish and somewhat high-strung, but if they are bred in captivity they may become more relaxed. Wild-caught jerboas will likely remain shy for the remainder of their lives, but there have been cases where experienced keepers have been able to get a wild jerboa to become settled around humans. Jerboas are omnivores. They live primarily on plants, but they will eat insects like beetles and worms when they are available.",
        "score": 0.6954165
    },
    {
        "Name": "Deer",
        "Genus": "Odocoileus virginiana",
        "Diet": "Herbivore that enjoys acorns and especially likes fruit, grass",
        "Text": "Foraging languidly among forests and plains, the deer is one of the most familiar and recognizable sights in all of nature. The deer is an animal that has proliferated across the globe and evolved many adaptations to help it cope with the rigors of a hostile world. Its regal antlers are some of the most notable characteristics in the animal kingdom, used for defense and sexual signaling. When it is disturbed, it can spring into action with its remarkable speed, agility, and finesse. And it has evolved a unique ability to digest all kinds of vegetation. The deer is a kind of evolutionary success story. You can check out more incredible facts about deer . Cervidae is the scientific name for all species of deer. It derives from the Latin word Cervus, which simply means stag or deer. The Cervidae family belongs to the order Artiodactyla, which represents all even-toed ungulates or hoofed animals with a certain kind of foot. The order includes giraffes , bison , hippos , pigs , camels , sheep , and cattle . More recent evidence suggests that cetaceans are also members of the order since they evolved from the even-toed ungulates tens of millions of years ago. Taxonomists generally agree that there are three subfamilies of these animals. Capreolinae, which includes reindeer , white-tailed deer, and moose , is known colloquially as the New World deer. Cervinae, which features the elk, the red deer, the tropical muntjacs, and the tufted deer, are known as the Old World deer. The third subfamily, Hydropotinae, is represented by just the water deer. The terms Old World and New World do not designate the deer’s current range but rather how they evolved. They can be distinguished from each other by key differences in their skeletal morphology. For most people, the Cervidae family is associated with white-tailed deer, red deer, mule deer, elk, caribou , and moose. But the entire family actually contains a massive amount of diversity. Taxonomists seem to disagree on the exact number of species, but by most counts, there are at least 40 still living, each one unique in its own way. Some sources put the number at more than 50 species. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Evidence from the fossil record suggests that these animals likely evolved around 20 million years ago. The earliest species were probably small creatures (much like the present-day mouse deer) with simple, rudimentary antlers and canine tusks. Many species flourished during the recent Pleistocene era, including the truly massive Irish elk, whose antlers may have weighed up to 90 lbs. Most deer species share in common a basic set of characteristics: two hooves on each foot, a four-chambered stomach, long and spindly legs, short tails, and a coat color that usually varies between brown, red, or gray. They also share a proclivity for the twilight hours. But the most prominent and conspicuous characteristic is the set of antlers on the head. This large ornamentation reveals a clear delineation between the males and the females. All males possess antlers, while females lack them. Only in caribou (or reindeer) do the females grow antlers as well. The water deer is the lone aberration where neither gender grows antlers. Instead, both male and female members grow tusk-like canines instead of the elegant network of antlers. This appears to reflect an earlier pre- antler state of their evolution. The antlers are composed of simple bone (and thus well-preserved in the fossil record) with a coat of skin and blood vessels called velvet to help them grow. It takes several months for the antlers to reach their full efflorescence, upon which time the deer will slough off the layer of velvet. The antler’s main purpose is to assist the animal in combat and reproduction. As antlers require such a large investment of energy to grow, their size signals to females the reproductive fecundity and overall health of the males. They also help to establish social status and hierarchy in the group. The size, curvature, and structure of the antlers are a source of immense variation between species. Some of them have a large central palmate (like moose antlers), while others have long single beams with varying numbers of branches. Some deer have nothing more than simple spikes for antlers. The reindeer have the largest antlers in relation to body size, but the moose can rival them in absolute terms. Deer are social animals. They usually congregate into small groups for feeding, mating, and protection. In the most densely packed areas, truly massive herds can form, depending on the abundance of food and the makeup of the population. Some species are migratory in nature and will travel hundreds of miles with the herd. To delineate social arrangements, they rely on their acute sense of smell and vocal communication. Many deer have a facial gland near the front of the eyes. The gland can release a strong pheromone for marking its territory when the animal rubs its body against trees or shrubs. Other glands reside on the legs and feet. The smallest species of deer is the humble pudu. It can range anywhere between one and three feet in length. The largest species of Cervidae is the moose. It can reach 10 feet long and weigh up to 1,800 lbs. In between these two extremes lies the common white-tail deer, whose height and weight are about the same as a human. Males tend to be larger than females in almost every species. These animals are present on nearly all continents on earth, including large unbroken expanses of North America, South America, Europe, and Asia. It contains only a single species of native deer, the Barbary red deer. Australia has no native species, but several have been introduced into the wild. These animals thrive in deciduous forests, tropical rainforests, wetlands, and grasslands. A few species inhabit the cold tundra of the north, feeding on the sparse vegetation. They are most frequently found in the areas between forests and open plains. They are also capable of adapting to urban and suburban settings, which means that some species can thrive despite human encroachment. These animals’ diet consists almost entirely of leaves, grass, lichen, buds, fruit, and herbs. The deer family is a type of ruminant — a mammal that has the capacity to break down and ferment plants with its four-chamber stomach. Each chamber contains various microbes to assist with this task. After the food is processed by the first stomach, the animal will then regurgitate it as cud and attempt to chew through the tough plant material. The food then proceeds through the remaining chambers of the stomach for digestion. However, unlike many other ruminants such as sheep and cattle, their palate is more selective. They prefer high-quality food that’s easier to digest. This is due to the large amounts of energy and nutrition needed to grow antlers. These animals are a critical food source for many predators in the wild, including bears , mountain lions , jaguars , tigers , lynxes , coyotes, wolves, and large raptors. Birds and small mammals may feed on the carcass of a deceased deer. Individual animals, especially young fawns, are susceptible to predation. They aren’t completely defenseless against ferocious predators, but when given the choice, they will usually prefer to run. White-tailed deer have the ability to sprint up to 30 MPH. They can also leap immense distances up to 30 feet. If a nearby threat is spotted, deer may attempt to warn nearby members of the herd. The more solitary moose are protected by virtue of their size. Since humans first evolved, deer have been historically an important source of food, clothing, and material to most societies. Modern hunting and habitat loss have threatened some species of deer, particularly in South Asia and the Pacific region, but with responsible stewardship, deer numbers can be maintained at healthy numbers. Climate change presents an acute problem as well. As the deer’s natural habitats change, it will force many of them to venture farther to the north. Other sources of danger include ticks, lice, parasites, and disease. Some of these diseases can be passed on to other types of animals, particularly livestock. The deer’s breeding season takes place every year for only a short amount of time. Most species pursue a reproduction strategy known as polygyny in which a single dominant male will have multiple female partners. Only a few species prefer to be monogamous. Because competition can be fierce, males tend to exhibit aggressive tendencies throughout the mating season, as they try to guard their territories and mate against potential rivals. As mentioned previously, antler size is a significant determinant of reproductive success. Once a female deer is impregnated, the gestation period can last anywhere between six to eight months. Mothers will tend to produce one or two offspring at a time. Less commonly, the doe will produce three offspring. The young deer are known as fawns or calves, depending on the size of the species. While out foraging, mothers will hide the fawn in nearby vegetation until the young animal is strong enough to begin walking on its own power. The fawns are often born with white spots to provide camouflage from predators. The offspring are weaned at two to five months, but they may stay with the mother for up to a year. Males often play minimal roles in raising young fawns. After the first year of life, males will begin to grow their antlers on an annual basis. Deer can live around 12 years in the wild, give or take a few years, but hunting, predation, and vehicle collisions can greatly truncate the length of their lives. Many do not live beyond their fifth year of existence. Due to commercial exploitation, populations of many deer species fell in the early and mid-20th centuries. But thanks to conservation efforts, populations have rebounded. Some estimates put the population size of the common white-tailed deer at around 30 million. Overpopulation has actually become a significant problem since humans have hunted many of the predators that keep the deer population in check. Therefore, regulated hunting is encouraged in many states as a means of population control. The Americas are rich in several species of deer. The white-tailed deer occupies a large range between the South American coast, Central America, the eastern United States, and parts of Canada. The mule deer tends to occupy the western United States and overlaps with the white-tailed deer in some places. Enormous clusters of deer, including white-tail deer, mule deer, caribou, moose, and elk, congregate in the national parks of western Canada. Despite their ubiquity, many species and subspecies of deer are under threat. The Persian fallow deer, Chilean huemul, Kashmir stag, Indian hog deer, Bawean deer, and Eld’s deer are either endangered or critically endangered. The reindeer, water deer, barasingha, and others are approaching vulnerable status. Pere David’s deer , which is native to China, was declared extinct in the wild, but attempts have been made to reintroduce them back into their natural habitat. The following list includes the most well-known deer species throughout the world: Chinese Water Deer – A native of the river bottoms of Korea and in the Yangtze River Valley of China, the Chinese water deer is the only species of deer whose males don’t grow antlers. Instead, these deer grow 2 inch tusks that protrude from the sides of their mouths. Irish Elk – The Irish Elk is an extinct species and one of the largest deer to ever live. During the Pleistocene, its range extended from Ireland to Siberia. This magnificent giant stood at 7 feet tall at the shoulders and weighed over 1,500 pounds!",
        "score": 0.69492537
    },
    {
        "Name": "Pademelon",
        "Genus": "Thylogale",
        "Diet": "Herbivore that enjoys grasses and especially likes herbs, shoots",
        "Text": "A cousin of the kangaroo and the wallaby Found in Australia’s forest and island areas, the pademelon is a small to mid-size marsupial. It is a solitary animal and a nocturnal one. There are seven pademelon species, but the animal population numbers are suffering because many of them are losing their habitats and being hunted. When awake, these marsupials forage for berries, herbs, grass, and leaves. If the animal detects a predator, it uses its hind legs to thump the ground, alerting other nearby forest animals of the danger. • Pademelons live in diverse environments including thick bush, forests, and swampy areas • The animals are usually a blend of black, brown, gray, and red • Male pademelons are typically about twice as large as females • The species forms tunnels in the bushes and grasses of its habitats to reach food and escape predators The pademelon’s scientific name is Thylogale, and the animals are a part of the Macropodidae family. They are of the Mammalia class and are included in the Macropodidae subfamily. The definition of “macropod” is big foot. This is a trait that’s common in marsupials like the pademelon. Often, macropods feature back legs that are much bigger than their front legs. Members of this family also often have large back feet and powerful tails that help them balance. The name pademelon comes from the Dharuk Aboriginal word “badimaliyan.” The seven different types of pademelons are Tasmanian , Brown’s , Dusky , Calaby’s , mountain, red-legged and red-necked . The dusky pademelon has had many names. In the past, locals called it the Aru Islands wallaby. Before that, it was known as the philander, which means friend of man. In the second series of the book “Travels” by Cornelis de Bruijin, the characters called this mammal the philander. The pademelon belongs to a larger genus of Macropodidae, a marsupial family that is thought to have evolved from mammals of the Therian class. It is believed that marsupials began to deviate from the therian class of mammals around 90 million years ago. These marsupials most likely came from North America and eventually expanded into South American and Asia. During the migration process, as land masses began to break off and form what became Australia, they became isolated to evolve into the marsupial of today. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The fossil evidence of a Tasmanian pademelon was found in Australia, dating back to the early Pliocene era, which gives evidence that this species may have crossed from the island of Tasmania onto the mainland during times of low sea levels. Small and similar in body shape to their kangaroo and wallaby cousins, you can tell that you’ve come across a pademelon from its shorter height and thicker body. Pademelons get around by hopping on their hind legs. They carry their front legs high into their bodies in front of them, and they have small paws and sharp claws. Pademelons have soft fur, and they generally feature a dark stripe along the cheek that extends from the side of their mouth to just behind the eye. Over the dark stripe is a section of white fur. The animal has a lighter color fur on its belly than it does on its back and legs. Pademelons have a noticeable stripe along the hip too. The animal has a short, stubby tail that’s covered with a small amount of sparse fur. Their feet are soft and coated with dark brown fur. The animal species have round ears that give it Giving it a mouse-like appearance. Female pademelons have a belly skin fold that covers a furry pouch. When it comes to behavior, pademelons prefer to be on their own. The only time that they meet up is to mate and sporadically graze together in grassy clearings. The animal species travel long distances looking for food. They make their way through the forest from early in the morning until evening. To keep up their energy, the animals rest several times a day. As pademelons travel to and from their grazing areas, they form tunnels and trails through the foliage. Pademelons are harmless, curious animals that often permit people to walk up to them for a photo opportunity before hopping slowly away. A fully mature male pademelon can grow to weigh as much as 15 pounds. Female pademelons usually weigh about 8 pounds. An adult animal’s length is from around 3.3 feet to almost 5 feet. You can recognize a male pademelon by its larger body size, defined muscles, and broad forearms and chest. Pademelons make their homes in rainforest areas, particularly in thick eucalypt forests. The animals prefer to live near the forest’s edge. They make their homes in coastal areas of Australia, Tasmania, and Papua New Guinea. You’ll find red-necked pademelons in the areas of New South Wales and Queensland. They also live in the south-central part of New Guinea. If you’re in Tasmania and come across a pademelon, it will likely be a red-bellied or Tasmanian one. Years ago, this type of pademelon also lived in the southeastern region of Australia’s mainland. New Guinea is home to the dusky pademelon. This part of the world features a humid subtropical climate, one with cool winter temps, warm summers, and plenty of rain year-round. What do pademelons eat? Pademelons are herbivores, eating grass, leaves, herbs, berries, ferns, mosses, and shoots. The Tasmanian pademelon dines on nectar-bearing flowers when available, while the red-legged pademelon typically eats fallen leaves. This type of pademelon may also obtain sustenance from fruit like the Moreton Bay fig and the Burdekin plum. In some cases, the animals eat tree bark and young trees. The pademelon’s main predators include dogs, foxes, wedge-tail eagles, quolls, Tasmanian devils , and feral cats. Humans are also a threat to the species due to clearing land to make way for homes, farmland, and other developments. This same trend has resulted in kangaroos and wallabies seeking new habitats in areas where pademelons generally live, which also decreases the food supply for all of the species. Another risk to pademelons is rabbits. While not a predator, rabbits are a competing species that consumes the same grasses as pademelons and can reduce the availability of a primary food source. In the past, aborigines and the area’s settlers also valued pademelon meat. In Tasmania and the state’s outer islands, residents kill off pademelons to keep their numbers low. Residents also hunt them for their meat and fur. According to the IUCN red list pademelon range from least concern to endangered, based on the specific species. Pademelons breed year-round, and they are polygynandrous, meaning they have multiple partners. While the animal species technically breed all year long, an estimated 70% of their births happen toward the start of the winter months. When a male selects a mate, he makes soft noises at her. The sound is similar to the one that a female makes when she is calling her baby to come to her. For the species, fertilization happens internally with the gestation period lasting for an estimated 30 days. Pademelons usually only have one baby, and when it is born, it is a small, blind, defenseless, furless embryo. Like kangaroos, an embryo pademelon is called a joey. Right after the joey is born, the baby makes his or her way from the mother’s birth canal to her pouch. Once there, it attaches itself to one of her teats. Female pademelons have four teats. The joey will live and grow from this undeveloped state within its mother’s pouch until it reaches 6 months old. At this age, the joey will start to venture outside of the female pademelon’s pouch. Baby pademelons return to their mother’s pouch for food until the mom decides to wean him or her. Weaning usually happens between 8 months old and 12 months old. Kangaroos experience birth the same way. When a baby kangaroo is born, it is usually about 2 centimeters long. Kangaroo babies typically weigh less than one gram. Just like pademelon joeys, kangaroo joeys make their way to their mother’s pouch and attach themselves to one of her teats. Kangaroo joeys stay in their mother’s pouch until they are 7 months to 10 months old. Pademelon joeys have the birth advantage of being protected by their mothers until they are big and strong enough to take care of themselves. The animal species becomes sexually mature at 14 months to 15 months old. Pademelons live for 4 years to 8 years when they are living in the wild. In captivity, they live for around 10 years. According to disease surveys, pademelons can suffer from toxoplasma. When the animals are kept as pets, they may contract roundworms along with selenium and vitamin E deficiencies. They can also get salmonellosis, which is a mouth disease. If you decide to keep one as a pet, be sure to take your animal friend to an exotic vet annually. The Department of Primary Industries, Parks, Water, and Environment is an organization that has been conducting yearly animal surveys in Tasmania for almost 45 years, and it counts the number of pademelons in the area. In 2018, the organization counted 134 pademelons in the Central region part of the state and 345 in Finders Island. The organization determined that there were 30 animals on King Island, 917 in North East Tasmania, and 582 in North West Tasmania. It also counted 398 pademelons in South East Tasmania and 32 in South West Tasmania.",
        "score": 0.69480014
    },
    {
        "Name": "Eastern Barred Bandicoot",
        "Genus": "Perameles",
        "Diet": "Omnivore that eats roots, berries, beetles, worms, grasshoppers",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Bars of black fur on its hindquarters",
        "Fun_Fact": "Digs funnel-shaped holes in search of insects",
        "Text": "“They can cover three feet of ground in a single leap” Eastern barred bandicoots are omnivores with a diet of plants and insects. They have brown or gray fur with three or four vertical dark stripes on their hindquarters. On a distribution map, these mammals live in southeastern Australia and Tasmania. In the life cycle of an Eastern barred bandicoot, a juvenile is called a joey. The population of this small animal is decreasing. The Eastern barred bandicoot is known as Perameles gunnii . The Latin word Perameles means bag or pouch while gunnii relates to the island of Tasmania where many Eastern barred bandicoots live. These animals are sometimes called pig rats . This is because they have a body shape and small dark eyes similar to those of a rat. Also, when this animal is digging for insects, it makes a grunting sound that some say is similar to the grunts of a pig. They are in the Peramelidae family and the class Mammalia. A few of the subspecies are: This animal has grayish-brown fur with three or four bars of dark fur on its rump. Its belly and feet are cream-colored, and it has a short tail. This mammal has long ears similar in shape to a rabbit’s ears. Its nose is narrow and long. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Most types of bandicoots have a long nose, small dark eyes, and other similar features. But it’s the vertical bars on an Eastern barred species’ coat that differentiates it from other types of bandicoots. Some of the most interesting facts about this animal concern its legs and feet. Its powerful back legs as well as the webbing between its second and third toes help it to jump a distance of three feet in one leap! Furthermore, it runs or gallops at speeds of up to 15mph. There’s another well-known marsupial with strong hind legs and webbing between its toes. That marsupial is the kangaroo ! This animal measures from seven to 12 inches long. Picture a wooden ruler you may use at school and you’re envisioning something equal in length to a 12-inch-long Eastern barred bandicoot. This animal can be up to four pounds in size. A four-pound Eastern barred bandicoot is equal in weight to four-fifths the total weight of a chihuahua dog. The Northern brown bandicoot has the longest body of all the bandicoots at a length of 18 and a half inches. The long, narrow snout of an Eastern barred bandicoot helps it to find beetles and other insects beneath the ground. Its sharp claws make this animal an efficient digger. This barred bandicoot has a backward-facing pouch as well. So, when a female is digging in the dirt it won’t fly up into her pouch onto her babies! Its running or galloping speed of 15mph helps this small mammal to escape red foxes , dingoes , and other predators. Also, its dark fur allows it to blend into its grassland or forest habitat so it can camouflage to avoid predators. These animals are solitary with a shy nature. They hide during the day and come out to look for food at night. Look at a distribution map and you’ll find this bandicoot lives in Victoria located in the southeastern part of Australia. They also live in Tasmania. One of the most pertinent facts to keep in mind is the largest portion of this mammal’s population is found in Tasmania. They live in a temperate to hot climate. These animals stay undercover for most of the daylight hours in order to remain cool, especially on extremely hot days. These animals are found in dense areas of vegetation where they can take shelter. Normally, these patches of vegetation are located near open areas of land, so they have somewhere to forage for food at night. An Eastern barred bandicoot makes its nest in a shallow depression in the ground. Its nest is usually lined with grass or other soft material. A bandicoot’s nest is very similar to the nest of a wild rabbit . Eastern barred bandicoots are omnivores. They are nocturnal animals that search their habitat for food at night. They spend much of their time digging for prey that lives underground. Specifically, this marsupial eats beetles , worms, grasshoppers as well as a diet of berries, seeds, and grass. Red foxes are the main predator of these mammals. They may also be attacked by dingoes. Both of these predators are nocturnal like Eastern barred bandicoots. The Eastern barred bandicoot has suffered loss of their habitat putting it in the category of Vulnerable on the IUCN Red List. Sheep and rabbits have eaten a lot of the vegetation in the Eastern barred bandicoot’s habitat leaving it with fewer places to build nests. Red foxes also greatly reduced the population of this marsupial. Though its population is listed as decreasing, there are currently protected areas set aside for the Eastern barred bandicoot to help replenish its numbers. These bandicoots have multiple partners and have their young between the months of May and December. Females can sometimes have as many as three to four litters of babies in a single breeding season. Their gestation period is just 12 days. This is the shortest gestation period of all marsupials! A bilby’s gestation period is similar at 14 days. Eastern barred bandicoots give live birth to one to four babies per litter. Newborn bandicoots are hairless and less than one inch in length. After moving from newborn to juvenile in its life cycle, an Eastern barred bandicoot is called a joey . Joeys live in their mother’s pouch for the first 5o days of life. They nurse from their mother inside her pouch and eventually begin to eat small insects and vegetation. After 55 days, the joeys emerge from their mother’s pouch to live in the nest and search for food with her for the next week or two. After that, they can live independently. As a note, bandicoots are solitary animals. They don’t share their nest with other bandicoots with the exception of the one to two weeks they allow their young to be there. The average life span of this small marsupial is three years. The Eastern barred bandicoot’s population is 10,000 to 100,000. It’s categorized as Vulnerable with decreasing numbers. But conservation actions are being taken in the form of establishing protected areas of land where these animals can reproduce and live without fear of predators. This is gradually helping to rebuild their population.",
        "score": 0.69474995
    },
    {
        "Name": "Catalan Sheepdog",
        "Genus": "Canis",
        "Diet": "Omnivore with no preference",
        "Fun_Fact": "This breed is called the Gos d’Atura Catala in native Catalan and Pastor Catalan in Spanish, both of which roughly translate to mean Catalan Sheepdog",
        "Text": "This breed is thought to share close ancestry with other Pyrenees dogs. The Pyrenees is the mountain range that separates Spain and France along the northern edge of Catalonia. Several different herding dogs have sprung from the region. The Catalan Sheepdog is a big, shaggy breed, lovable in appearance and temperament but driven by an insatiable desire to herd livestock. It hails from the Catalonia region in the northeast of Spain , which encompasses the city of Barcelona. The origins of the Catalan Sheepdog are unfortunately shrouded in mystery. One (implausible) tale suggests that it descended from two shaggy dogs belonging to Emperor Charlemagne, one of the most important figures of post-Roman Europe . A more likely theory suggests that this breed was produced from a mix of Roman herding dogs and local Spanish breeds. See all of our expert product reviews . Either way, this breed is highly bound up with the history of Catalonia, a semi-autonomous region of Spain with its language and culture. In the 1930s, this breed played an important role as messenger and guard during the Spanish Civil War on the Republican side. The victory of Francisco Franco in the war coincided with a period of decline for the breed. Despite a revival in its fortunes from the 1970s onward, it remains a rare but beloved pet in many parts of Europe. Unfortunately, it is less known in the United States . The American Kennel Club does not recognize this breed at all. The Catalan Sheepdog is characterized by a long and wavy double coat, particularly soft and dense underneath. This coat is so long that it obscures the eyes, the head, and the muscular body. There are several accepted color combinations, including fawn, gray/white, black/tan, gray/black, and white/black/sable. A short-coat variation also exists, but it is considered to be nearly extinct. The Catalan Sheepdog is a medium-sized breed with a fairly muscular frame. Males are quite a bit larger than females. All reports indicate that this is a very healthy breed with a life span of 12 to 14 years, but it does suffer from few inheritable conditions. One of the most common is hip dysplasia, a developmental disorder in which a malformed hip may fit poorly in the socket, causing lameness and pain. Other problems include glaucoma, progressive retinal atrophy, epilepsy, and dental issues. Cancers and heart diseases are also leading causes of death in just about any dog breed . Talk with your breeder to ensure that all the proper medical tests have been done. Regular checks at the vet are also necessary to ensure the best possible health. In summation, these are the most common health problems: See all of our expert product reviews . The Catalan Sheepdog has many of the personality traits of a proper herder: it is intelligent, protective, and devoted, always working to keep the herd together. While it was originally bred to be independent and free-roaming, this breed also exhibits extraordinary tenderness and gentleness toward the family. Keep in mind that this breed is very active both mentally and physically. It needs something or someone to interact with frequently throughout the day. If they don’t receive enough stimulation, then they might find an outlet for their energy in annoying and destructive behavior. The Catalan Sheepdog is probably not a good choice for casual or inexperienced owners. Their active, roaming minds and boundless reserves of energy require an owner who knows how to deal with a breed of this kind. A large house with a big yard is also recommended. The Catalan Sheepdog will need about three cups of high-quality dog food every day. The exact amount should be based on the dog’s size, age, and activity level. As with any dog prone to dental health issues, always feed your Catalan Sheepdog a dry, kibble dog food. With this in mind, A-Z Animals recommends Eukanuba Adult Large Breed Lamb 1st Ingredient Adult Dry Dog Food as the best dog food for Catalan Sheepdogs. Here’s a hearty lamb kibble with added poultry ingredients for supplemental chondroitin and glucosamine to prevent conditions like hip dysplasia. It also has beta-carotene for clear eyes. All this is wrapped into crunchy pieces with a shape and texture engineered to remove plaque and tartar for healthier gums and teeth. Eukanuba Large Breed dog food is available on Chewy and Amazon. The Catalan Sheepdog has a long, dense coat that naturally takes care of itself. It still needs to be combed about two or three times a week, but the coat is otherwise very resistant to weather and dirt. The most difficult aspect of its grooming might be the need to trim the coat from time to time to prevent it from becoming too long and unwieldy. A professional groomer is recommended if you don’t want to take care of it yourself. Owners should also trim the nails about once a month to prevent them from cracking and clicking on the floor. Brush the teeth with a vet-approved product to prevent gum and teeth disease. Finally, check the ears regularly for signs of wax buildup or infection. The Catalan Sheepdog should be a breeze to train. Owners will need to set clear and consistent boundaries without being harsh or mean, but these dogs enjoy having a task to perform and take to training with a certain amount of gusto. They’re also incredibly whip-smart. The Catalan Sheepdog will probably need at least an hour of exercise per day. Long walks, while highly recommended, will not be enough to satisfy its needs. This breed will also benefit from vigorous exercise, games, fetching, agility challenges, and herding trials. Like all puppies, the Catalan Shepherd will benefit immensely from early training and socialization. Training classes and daycare can help improve the dog’s overall behavior, but any positive interactions are beneficial. Owners might want to consider crate training as well. This can provide a safe space to help puppies with house training and behavioral issues. The one issue you need to keep in mind is that this breed does tend to herd both people and pets. This behavior can be recognized when the dog starts circling and nipping at heels. Since the dog can sometimes accidentally bite, owners should probably try to dissuade this behavior by setting clear boundaries and then channeling its energies into other pursuits. The Catalan Sheepdog is a gentle and loving companion for children of all ages. As mentioned previously, they do tend to nip at people. While this shouldn’t be mistaken for aggressive behavior, some children might not enjoy being nipped at. An adult should always be present to supervise interactions with children. The Catalan Sheepdog resembles many other types of herding breeds: The Catalan Sheepdog is something of an important symbol in its native Catalonia. A dog named Cobi was the official mascot of the 1992 Barcelona Olympics . Outside of Spain, this breed is probably best known from the film “Back to the Future” as Doc Brown’s canine assistant. Einstein, obviously named after the famous physicist, was the first test subject of Brown’s time machine in 1985. Copernicus, named after the Renaissance astronomer, was the dog Doc Brown owned in 1955. A Catalan Sheepdog named Colonel was also a character in “101 Dalmatians.” If you’re still unsure about what to name your new Catalan Sheepdog, then you might want to consider one of the following options:",
        "score": 0.69384396
    },
    {
        "Name": "Archaeotherium",
        "Genus": "†Archaeotherium",
        "Diet": "Omnivore with no preference",
        "Fun_Fact": "The family Entelodontidae is commonly referred to as hell pigs.",
        "Text": "Archaeotherium (Archaeotherium mortoni ) is an extinct artiodactyl. That means it was a member of the mammalian order Artiodactyla of even-toed ungulates. These animals put their weight on an even number of toes (in this case, two toes, the third and fourth) when they walk. The other toes might or might not be present or functioning. Among even-toed ungulates are pigs, hippos, deer, giraffes, camels, llamas, sheep, goats, cattle and the like. Odd-toed ungulates that bear weight on an odd number of toes also exist and include animals such as rhinos, zebras, mules, donkey, and horses. The ancestry of the Artiodactyla order is not known exactly, but fossils show that even-toed ungulates existed as far back as 53 million years ago in the early Eocene period. Fossils of the same age have appeared in Europe, Asia, and North America. Getting more specific, the Archaeotherium is a member of the Entelodontidae family. Entelodonts included mammals much like today’s pigs , sheep , camels , and cows , but they lived between 38 and 19 million years ago. All Entelodonts, including the Archaeotherium and another pig-like dinosaur called Daeodon , are now extinct . The name Archaeotherium comes from Greek and means “ancient beast,” but Archaeotheriums are commonly referred to as “hell pigs” or “hell hogs.” However, they are actually not related to today’s pigs. Surprisingly, they are more closely related to whales and hippos . There may have been several species, but mortoni is the type species (the example), and also the largest. Archaeotheriums were about the size of modern cows. On average, they stood about 4 feet 11 inches at the shoulder. From nose to tail, they were about 6 feet to 7 feet long. The largest discovered Archaeotherium was 5 feet 3 inches tall at the shoulder. They weighed up to 1,300 lbs., but averaged 1100 lbs. The skull of the largest specimen was 31 inches long. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Measurements of Archaeotherium include: Scientists believe that males and females were about the same size. But it is difficult to know for certain because skulls are more commonly found than the mammal’s complete skeleton. These creatures also had very large heads (but small brains) in proportion to the rest of their bodies, making size estimation even more complex. From discovered bones, scientists believe that this animal looked like a cow with its hoofed feet. But it had a longer face than a typical cow, also with wider cheekbones and humped shoulders. Like warthogs , the Archaeotherium had bosses on the face, the large bumps that gave warthogs their “wart” name. Despite being called hell pigs, Archaeotherium did not have a pig-like nasal disc. What did Archaeotherium eat? The hell pig’s diet was omnivorous . This means they ate both plants and animals. They had teeth well-formed for eating even tough plants like stems and hard fruits. These same teeth enabled the animal to chew up bones. The Archaeotherium’s teeth and jaws were quite unique to this prehistoric family. In fact, its oral features are unlike any living animal. But there are parts of its mouth that seem similar to modern pigs, rhinos , bears , and other meat-eaters. Still, the hell pig could not chop up or tear meat with its teeth. It had to use its well-formed neck muscles and motion of its whole head to tear off chunks of its prey. In its North American territory, Archaeotheriums hunted prehistoric camels, Poebrotherium. They ran alongside their prey like a lion , then bit the neck of the animal to bring it down. In many instances, the hell pigs did not eat their fallen prey right away. Instead, they would move the kill to a cache to eat later when unable to hunt or locate their prey. Scientists have found fossilized remains of multiple pre-historic camels in caches like these. When it was time to eat the meat, Archaeotheriums tore the body in half and swallowed a foot-long rear section first. Other animals they hunted included prehistoric horses and rhinoceroses. Scientists believe Archaeotheriums chewed on one side of the mouth. This theory comes from the hell pigs teeth being more worn on one side. Their mouths also indicate that they used the front teeth to strip foliage from above-ground plants. Hell pigs often ate smaller mammals and fed on other predators’ leftover carcasses. Archaeotheriums lived in North America 35 million to 25 million years ago for a period of about 9.1 million years. Their eras included the Eocene and Oligocene epochs of the Paleogene Period . In North America , they lived in forested and riverbank areas of Colorado , South Dakota , North Dakota , Wyoming , Nebraska , and Texas before grasslands had developed. Remains have also been found in southern Canada , specifically in Saskatchewan. It is believed that predators of Archeotherium are responsible for the animal’s extinction . But little else is known about why they became extinct after 9.1 million years on Earth. Other threats included the hell pigs’ own argumentative nature toward each other. They fought amongst themselves often and are believed to have displayed their widely-gaping jaws in aggressive displays of dominance, just like a hippo . Adult fossils from this family show bite marks on their skulls that likely occurred during biting fights. Fossilized bones for Archaeotherium are most often discovered in the Great Plains’ White River Formation. However, they have been uncovered in multiple U.S. states, including South Dakota, North Dakota, Texas, Nebraska, Colorado, Wyoming, Oregon , and Saskatchewan. In the Toadstool Geologic Park of Nebraska, a set of Subhyracodon tracks show the animal was walking, then stopped and looked over its shoulder at Archeotherium stalking it. The Subhyracodon then ran at a high speed as an Archeotherium’s tracks joined it, indicating the hell’s pig was chasing the rhinoceros-like creature as prey. Other animals’ bones have been found cached in North America, presumably by Archeotherium. Archeotherium’s unique bites have also been discovered in other fossilized animals’ bones in the floodplains of North America. Scientists have not yet discovered what made the Archeotherium go extinct. However, they believe it was likely due to predation by bigger dinosaurs like the “bear dog” Amphicyon. Overall, the animal lived for about 9.1 million years from 35 million to 25 million years ago. This was during the Eocene and Oligocene epochs of the Paleogene Period of the Cenozoic Era . Similar dinosaurs to the Archaeotherium include:",
        "score": 0.6922629
    },
    {
        "Name": "Tibetan Terrier",
        "Genus": "Canis",
        "Diet": "Omnivore with no preference",
        "Behavior": "Their temperament can be characterized as energetic, playful, stubborn quiet and lazy.",
        "Fun_Fact": "Tibetan terriers have round, flat, “snow shoe” feet that evolved to give them traction on snowy Himalayan paths",
        "Text": "Tibetan terriers have round, flat, “snow shoe” feet that evolved to give them traction on snowy Himalayan paths. A Tibetan terrier could easily be mistaken for a larger version of its cousin, the Lhasa apso. Like Lhasa apsos, Tibetan terriers have a long, historic association with Buddhist monasteries, and they also have that long front fringe, which frequently obscures their eyes. Despite their name, though, Tibetan terriers are not true terriers; they were not bred to hunt vermin but to guard the monasteries and help nomadic herdsmen tend their flocks. The lamas nicknamed this breed, “the Holy Dog.” See all of our expert product reviews . Tibetan terriers are medium-sized dogs with a squarish build, though it can be difficult to glimpse their bodies beneath their wooly double coats. They are friendly, energetic dogs who require a fair amount of exercise. Their highly independent natures make it critically important to establish who’s the boss when you first enter into a relationship with a Tibetan terrier. Hint: That boss should be you! The Tibetan terrier is a breed that dates back at least 2,000 years in Tibet, where they were bred and raised in monastaries by lamas. They originated in the region of Tibet known as the Lost Valley and they were considered to be prized companians and for those blessed to own one, they were thought to bring good luck. Which also meant if you mistreated them, misfortune would come your way. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . There is only one type of Tibetan terrier but they do come in a variety of different colors, including black, brown, white and a combination of colors. While there is only one Tibetan terrier breed, there are two additional types of native Tibetan breeds – the Tibetan spaniel and the Llasa Apso. The Tibetan terrier is a medium-sized dog that stands between 14 and 17 inches high and weighs approximately 18 to 30 pounds. A three-month-old puppy will weigh approximately 7 pounds while a six-month-old puppy will weigh approximately 14 pounds. These dogs assume their adult heights and weights between the ages of 12 and 14 months. Females are slightly smaller than males. See all of our expert product reviews . Tibetan terriers were first recognized by the American Kennel Club in 1973 and have been bred in the U.S. ever since. Like all purebred dogs, they’re characterized by a certain amount of inbreeding. That inbreeding may sometimes be associated with hereditary health issues. These health conditions can also be found in dogs that are a mix between Tibetan terriers and another breed, The lifespan of a healthy Tibetan terrier ranges between 15 and 16 years. Tibetan terriers are prone to progressive retinal atrophy (PRA). PRA is not a single disease but a collection of disorders, including red cone dysplasia, progressive rod-cone degeneration, photoreceptor dysplasia, and cataracts, that may culminate in degenerative deterioration of the retinal cells. Primary lens luxation, a deterioration of the fibers that hold the lens of the eye in place, is another vision-related issue that affects these dogs. Neuronal ceroid lipofuscinosis, a condition caused by abnormally high accumulations of ligopigments within the tissues of the body, is also found in members of this breed; symptoms include night blindness, motor abnormalities, and epilepsy. Tibetan terriers may also be affected by canine hip dysplasia and luxating patellas. Additionally, some Tibetan terriers have allergies to dairy and wheat, which can cause them to break out in dermatitis. There are DNA tests for many of these conditions. Responsible breeders will make sure you’re aware of the potential for these health issues in any Tibetan terrier pup or Tibetan terrier mix you buy from them. In summary, health issues that affect Tibetan terriers include: Tibetan terriers have a sweet but stubborn temperament. Unless you stay on top of their training, they’re smart enough to try and run your household. Their temperaments and reactions can seem very human in other ways, too. They appreciate relationships based on mutual respect and cooperation. These dogs don’t like to be scolded, and repetitive training bores them. They have unconditional love for the human members of their families, but it can take them a while to warm up to outsiders. Tibetan terriers are mellow in most respects, but there’s no denying that they have high-maintenance hair both as puppies and as full-grown dogs. Some of these dogs have a tendency to become obese, so it’s important to stick to feeding guidelines. They will also rebel against negative disciplinary routines and unrealistic expectations so set achievable objectives for your Tibetan terrier pup, and keep your training methods consistent. Tibetan terriers are naturally lean dogs. They’re unusual among canines in that they don’t typically bolt their food but chew it carefully, and they often leave food in their bowls. The staples of this dog’s diet in its homeland were barley gruel and meat broth. These dogs should not need more than two cups of high-quality dog food a day. If you rely too much on treats as a training incentive, your Tibetan terrier may grow greedy and show a tendency to overeat, which could turn into obesity. If your Tibetan Terrier shows signs of food allergies, talk to the vet about your dog’s diet, and ask about which allergy-alleviating or limited-ingredient dog food to try. In our opinion at A-Z Animals, the best dog food for Tibetan Terriers is Purina Beyond Simply, Natural Chicken Adult Dry Dog Food. That’s because this simple chicken, rice, and barley recipe balance protein, fat, and nutritious carbohydrates without any soy, wheat, corn, peas, lentils, and potatoes that can lead to health problems. Real meat is a good source of natural glucosamine for stabile joints. Also, omegas and vitamins can help improve any lingering skin irritation from their previous diet. Check out Purina Beyond Simply Natural Chicken dog food on Chewy and Amazon. Tibetan terriers need to be combed daily with a metal comb. Their hair is very thick, and if you don’t comb it regularly from root to tip, it will form thick mats that can become a perfect hiding place for fleas, ticks and doggy hot spots. Always mist your pet’s coat with water and conditioner before you attempt to comb out the tangles. Bathe your pet, too, at least once every two weeks. You’ll need to use a shampoo specially formulated for dogs and a high-end conditioner. Tibetan terriers have double coats that take a long time to dry without help so consider investing in a dog-safe hair dryer. If you let it, a Tibetan terrier’s hair can easily reach the ground. This is the basis for the classic Tibetan terrier show cut. Regular trips to a professional groomer will give you other style options. If you’re not showing your dog, a short haircut is more practical. You can count on your Tibetan puppy to get into everything, so he or she may do best with a short hair puppy cut between one and two inches long. Another short haircut between three and five inches preserves your pet’s characteristic hair but makes the daily comb out far less of a chore. Trim your pet’s nails regularly, too, and get into the habit of brushing his or her teeth at least once a day. Tibetan terriers will always assume they are the alpha dogs of any pack they’re in unless you demonstrate otherwise. That’s why it’s critically important to begin training your pup as soon as possible. These dogs do not respond well to coercion. Vocal praises and a very occasional treat make the best incentives. Tibetan terriers are active dogs. They should be taken out for at least two long walks every day, and they make excellent jogging partners. If you don’t give this dog an opportunity to burn off all its extra energy, your dog may turn to random acts of destruction to amuse itself. This dog is a rover, so apart from the dog park, it’s best to keep him or her on a leash at all times when you’re outside together. Among the llamas of the Tibetan monasteries, a Tibetan terrier puppy was the most highly prized of all gifts. These adorable bundles of fluff are ready to leave their parents and their breeders at around 10 to 12 weeks of age. Tibetan terriers love the children they live with, but they tend to be distrustful of strangers, so you should not allow kids your dog doesn’t know to pet your dog. They’re not the best dog for toddlers, either, because when their ears and tails are being pulled, they will do whatever they need to do to make a child stop pulling. Bearded collies, shih tzus and Havanese are similar to Tibetan terriers. Hugh Bonneville , the actor who plays Lord Crawley on “Downton Abbey,” has two Tibetan terriers named Teddy and Sasha.",
        "score": 0.6915959
    },
    {
        "Name": "Australian Kelpie Dog",
        "Genus": "Canis",
        "Diet": "Omnivore with no preference",
        "Behavior": "Their temperament can be characterized as alert and intelligent.",
        "Fun_Fact": "Kelpie can travel more than 30 miles in one day.",
        "Text": "Australian Kelpies, or Kelpies as they’re affectionately referred to, were bred in Australia to work as a shepherd to handle a large number of sheep in New South Wales and Victoria. They were bred to take care of the sheep primarily on their own with no real guidance from any shepherds or other individuals. In addition to herding sheep, this breed is also good at herding cattle and goats . See all of our expert product reviews . Today, there are two different varieties of Kelpies. The first variety is working dogs that continue working as shepherds and herding livestock. The second variety is Show Kelpies. Show Kelpies are bred for their appearance in dog competitions. Kelpies are very intelligent animals who can make good family pets so long as they are also given a job, as their instinct to be working is very powerful. If they get bored, they may also become destructive. When Australia’s New South Wales and Victoria regions opened up many acres of land, the number of sheep on these properties skyrocketed to the millions. It was no longer practical to herd them with humans, so wire fences were put in place instead. To handle the sheep in such large areas in harsh climates like heat, rough terrain, and dust storms, a special dog breed was needed. The Australian Kelpie was the perfect fit since it could do the work of multiple people without tiring in the most extreme conditions. The source of the Kelpie breed has been contested. However, it is known that these dogs originated in Scotland. The canines were black and tan with long hair and semi-erect ears and were about the size of a Collie. Additionally, litters from these dogs created puppies that were reddish brown in color. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . See all of our expert product reviews . Australian Kelpies are a medium-sized dog breed. Both males and females generally weigh between 25 and 45 pounds and are between 17 and 20 inches tall. Unfortunately, Australian Kelpies face more potential health issues than some other dog breeds. Learn what to look out for so you can offer the best care possible to your dog. One potential health concern for this breed is progressive retinal atrophy. This is an eye condition where the retina deteriorates over time. At first, a dog will lose their night vision, but daytime vision will follow as the disease gets worse. Patellar luxation is another possible health concern for Kelpie. This is a disorder where the bones of the knee cap (patella) are not properly lined up. This causes them to slip, which can make it challenging and painful for a dog to walk, especially in more severe cases. Surgery may be required for these more severe cases. Hip dysplasia, which is a genetic disorder, is another potential issue to be on the lookout for. With this condition, the bones around the hip aren’t properly formed, which causes them to rub together and cause pain. Dogs may also begin to limp or experience lameness in one of their legs. Surgery may also be required for this condition. To review, these are some potential health problems that may impact a Kelpie: Australian Kelpies have a pretty even temperament. This breed exhibits very loyal traits and can be very devoted to the members of their family. Kelpies are also very intelligent dogs that need mental stimulation along with regular exercise. If these needs aren’t met, they can exhibit destructive behaviors. They were bred to herd livestock and still do their best as herding dogs or when they are given a job to do. Kelpies also have a very alert and active personalities. Keep Kelpie’s health concerns, temperament, dietary needs, activity needs, and more in mind as you prepare a care plan. This dog breed is unique and will require different care than what you would give a different breed. Always choose high-quality dog food for your Kelpie. Check with your vet to confirm which brand or type of food will best suit the individual needs of your dog. The exact amount of food your dog will require each day can vary based on his or her weight, age, activity level, metabolism, health concerns, and more. Again, your vet is a good resource to make sure you are feeding your dog the right amount of food. After an Australian Kelpie Puppy is weened, they will need to eat very small meals more frequently throughout the day. This is because a puppy has a smaller stomach than a full-grown dog. Younger puppies should eat between three and four times a day. By the time puppies are six months old, two meals each day should be sufficient. Choose high-quality puppy food for your Kelpie. Since patellar luxation and hip dysplasia are both concerns for Australian Kelpies, try to find a dog food with a nutritional profile that covers sturdy joints and bones. Here’s the A-Z Animals Australian Kelpie food recommendation- Blue Buffalo Life Protection Formula Natural Adult Dry Dog Food. This wholesome dog food gives your Australian Kelpie a healthy dose of glucosamine and calcium for cartilage, bones, and joints that keep your dog on its feet happily for years. Vitamin A and taurine also support eye health for this breed which can suffer from retinal atrophy. Check Chewy or Amazon for this product. Kelpies are relatively easy to groom. They have a denser undercoat with a flat, water-resistant outer coat. You should brush your Kelpie about once a week to take off any looser hair or other debris. You may also find that your Kelpie needs a bath once in a while to keep him or her clean and smelling good. It is also important to trim a Kelpie’s nails so they don’t become too long and make it painful for the dog to walk. Their teeth should also be brushed a few times a week to prevent dental disease. Training an Australian Kelpie from a young age is important. This can keep them from becoming too territorial and can help them learn what is expected of them. Keep in mind that Kelpies do best when they are given a job and will respond well to training aimed at teaching them this job. Australian Kelpies are very active dogs who are used to getting a lot of exercise each day. It will be important to help make sure your Kelpie gets sufficient exercise. This can include long walks, play sessions, or completing their assigned tasks. Kelpies can be very destructive if they get bored, so it will be very important to make sure your home is puppy-proof. Remove anything that could be a potential safety hazard or that you don’t want to see ruined by your Kelpie. In addition to puppy-proofing your home, make sure that you select a trusted veterinarian to bring your dog to after you bring him home. The change in environment can cause stress to a Kelpie puppy, so be sure to give them plenty of attention. It will also be important to start training and socializing your dog from a young age so they get used to different people and places and learn how to act appropriately. Kelpies can make good family pets under proper conditions. Since they are herders by instinct, they may try to herd younger children if they aren’t properly trained or socialized. Without proper training, they may also nip at children. However, they can make great family dogs as long as they receive the training, socialization, and stimulation they need. Australian Cattle Dogs, Australian Shepherds, and Border Collies are three breeds that are similar to the Australian Kelpie. Australian Kelpies are seen at many dog shows. Some of the more famous members of this breed include: Below are some of the most popular names for an Australian Kelpie:",
        "score": 0.69028556
    },
    {
        "Name": "Porcupine",
        "Genus": "Erethizon",
        "Diet": "Omnivore that enjoys roots and especially likes leaves, berries",
        "Text": "Porcupines are the third largest rodent on the planet. They are broken down into two types of porcupines, which are Old World and New World porcupines. These large rodents are known to fight off enormous predators, and they feast on plants, shrubs, and trees throughout the year. Despite their fierce-looking exterior, they are gentle and docile creatures unless provoked. You can check out more incredible facts about porcupines . The taxonomy of Porcupines is broken down into the Rodentia order, the Erethizontidae (New World) or Hystricidae (Old World) family, and the Erethizon or Chaetomys genus. The Hystricidae porcupines stay on the ground for the most part and live in Europe, Asia, and Africa . Erethizontidae porcupines enjoy climbing trees and swimming throughout the Americas. The actual name of porcupine originates from the French word porcespin, which translates to quill pig. There are over two dozen species of porcupines across the world, including: Family Hystricidae (Old World porcupines): See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Family Erethizontidae (New World porcupines): Porcupines are large, terrestrial rodents that are known for their sharp quills. They belong to the rodent family Erethizontidae and are native to North America, South America, and parts of Africa and Asia. The earliest known porcupines date back to the Eocene epoch, around 55 million years ago. They evolved from a common ancestor shared with other rodent groups such as beavers and rats. Over time, they developed their distinctive quills as a defense mechanism against predators. Porcupines are herbivores and have a varied diet, mostly eating tree bark, fruits, vegetables, and sometimes small animals. They are also known for gnawing on bones for their minerals. Porcupines have a slow reproduction rate, and usually only have one litter per year, with one to three babies. They are also known for their longevity, some species can live up to 20 years in the wild. Each species of porcupine looks a bit different from the next. However, they do have some general appearance characteristics, such as they often have robust bodies and small heads. Their quills will either be grouped together or individually embedded into their skin and hair. These quills are their defense. They will drop their quills in the path of a potential predator to protect themselves The front of their bodies is most vulnerable as it is covered with hair rather than quills. The base color of the hair can vary, including to be yellow, brown, grayish brown, dark brown, or black. The patterns that overlay the base layer can also vary in color, including black, orange, yellow, and white. There are even albino porcupines in some parts of the world. Most porcupines range between 25 and 40 inches long, which includes their tail. They typically weigh between 10 and 40 pounds. Both males and females are roughly the same size. And many species have hairless soles that make them excellent climbers. Porcupines are solitary animals that spend most of their time alone. They will gather in groups during the winter and spend time with a potential mate during courtship. A group of porcupines is called a prickle. When they do gather as a group during the winter, you will find a group of up to 12 porcupines sheltering together. Where do porcupines live? The New World porcupines are primarily found in the Americas; whereas, the Old World porcupines are often found in Europe, Asia, and Africa. You will find porcupines in the Americas enjoy exploring the trees and water as much as land. However, the porcupines in other parts of the world typically remain on solid land for the most part. You will find them living in nearly any type of terrain, including deserts, forests, grasslands, mountains, and rainforests. They can adapt quite easily to their environments. Many porcupine species prefer to spend their downtime inside rocky crevices, caves, tangles of roots, brush, tree branches, burrows, and hollow logs and trees. Their home, wherever it may be, is called a den. They do not hibernate; however, they are nocturnal so they sleep during the day and explore at night. Porcupines the world over are herbivores. They eat roughly 0.9 pounds of food each day. During the winter, they rely upon tree bark as a primary source of nutrients. Due to harsh conditions, they often lose roughly 17% of their weight in the winter due to a lack of nitrogen in their winter diet. In Spring, porcupines prefer leaf blades rich in protein. If trees begin to develop toxic tannins, they will select more herbaceous plants and trees with fewer tannins. Summertime brings about more dietary changes, including potassium-rich foliage. This can lead to excreting too much sodium which forces porcupines to go in search of salt. In nature, they may find salt in a variety of sources, such as aquatic plants. When they do not find it in nature, they look for human-made sources, including tires, plywood, handles of tools, and brake lines. In some instances, they will eat certain nuts and fruit. Despite their dietary habits in nature, they cause far less damage than insects, disease, winds, and fires. For a complete analysis of their diet, give our ‘ What Do Porcupines Eat ?’ page a read!” The small stature of a porcupine, particularly young porcupines, makes them vulnerable to a number of predators, including great horned owls, black bears, bobcats, martens, long-tailed weasels, ermines, coyotes, and mink. The fisher is their most common predator. Fishers can even prevent porcupine populations from growing. If a predator does approach, the porcupine will turn its back to the predator keeping the quills facing the threat at all times. However, if the predator can get the porcupine on its back, it will often lose the battle. In some instances, porcupines have fought off an attack with their quills, including against highly dangerous animals like a leopard . When an approaching predator gets a quill embedded into their paw or body, they will often retreat as the quills are quite painful and difficult for animals to remove. The Phillippine porcupine is the only porcupine categorized as vulnerable at this time. All others are listed in the least concern classification. The biggest threat to the global porcupine population is human deforestation, wildfires, and infrastructure development. These actions displace porcupines from their homes and force the slow-moving rodents to search for new sources of food and shelter. Cars are also considered a threat to porcupines as porcupines move too slowly when crossing the street. The mating ritual of porcupines includes only dominant male porcupines mating with several females, and less dominant males may not mate at all. Males will defend their mate for several days during the annual breeding season to fight off other potential suitors. Females will also fight for their territory against other female porcupines. Male suitors are attracted to the scent and vocalizations of females. Mating will only occur once a female selects a male and becomes open to his advances. The annual breeding season lasts from October to November. A female will carry for 210 days and give birth to one to three offspring. Baby porcupines are typically born in April or May, and they are called porcupines. Newborns weigh between 0.88 to 1.17 pounds and are 10 inches long. Their hair is soft during birth. Quills will harden after a few hours. Their eyes often do not open for several days. The mother will nurse for a short time. After five months, the offspring will become entirely independent and left to survive their first winter on their own. The average lifespan of a wild porcupine is five to seven years. Porcupines raised in captivity might live up to 10 years. The Prague Zoo is known to have had an Indian crested porcupine for at least 30 years. As porcupines age, they can suffer from disease and loss of senses that make them more vulnerable to predators and natural death. All but one porcupine species is considered a least concern at this time. As a result, population studies are not overly accessible making it difficult to determine the global population size of porcupines. The only known threats to population growth at this time are the fishing predator and human development.",
        "score": 0.6897935
    },
    {
        "Name": "Polish Lowland Sheepdog",
        "Genus": "Canis",
        "Diet": "Omnivore with no preference",
        "Behavior": "Their temperament can be characterized as playful and a quick learner.",
        "Fun_Fact": "Despite having shaggy hair that covers its eyes, this dog is known for its watchful gaze when guarding a herd.",
        "Text": "The Polish Lowland Sheepdog is so popular in Poland its likeness was featured on a postage stamp. The history of the Polish Lowland Sheepdog dates all the way back to the 1500s. They originated in Central Asia and became popular in Europe in the 1800 and 1900s. Its parents are the Tibetan Terrier and a Hungarian Sheepdog called the Puli. Though they are smaller dogs, they are confident and alert when it comes to caring for a herd of sheep . These shaggy dogs belong to the herding group. See all of our expert product reviews . This dog is sometimes referred to as a PON. PON is an acronym for the full Polish name of this dog: Polski Owczarek Nizinny. These dogs are playful, energetic, and smart. In addition, they are good with children as well as other pets. A male Polish Lowland Sheepdog can grow to a height of 20 inches tall at its shoulder while females can be 19 inches tall. Males can weigh as much as 50 pounds, fully grown whereas females weigh up to 45 pounds. Polish Lowland Sheepdog puppies that are 7 weeks old weigh between 8 and 10 pounds. These dogs are considered fully grown between 12 and 18 months old. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The recent history of these affectionate, fluffy balls of energy can be traced back to a single ancestor Dragon (Smok), into the 1950s. In other words, the tale of this breed like so many others, is one which was brought back from the brink following World War Two. See all of our expert product reviews . But to get to that point, we need to reach even further back in time to its earliest beginnings. The Polish Lowland Sheepdog is believed to be the descendant of the Tibetan terrier, a long-haired canine used to run errands on the Tibetan mountainside. The Puli is another of its forebears. This clever, agile canine noted for its trademark corded coat is believed to have been brought to Hungary during the 9th century. The Polish Lowland Sheepdog is believed to have first emerged in Poland in the 13th century. It is also believed to have reached Scotland in the 16th century thanks to Polish seamen who swapped the long-haired breed for other animals. Following the Second World War and the reversal of its fortunes which followed, a plucky vet Dr Danuta Hryniewicz bred her beloved Smok in hopes of establishing the breed. And the rest, as they say, is history. The canine was responsible for no less than 10 litters during the decade following the end of World War II. The breed was well on its way and by the end of the decade in 1959, it was recognized by the Belgium-based Fédération Cynologique Internationale. Like other dog breeds, the Polish Lowland Sheepdog has some common health issues. One of those issues is known as hip dysplasia . Hip dysplasia occurs when a dog’s hip joint doesn’t fit together properly. Hopping and limping are two signs of this condition. The treatment for hip dysplasia depends on how severe it is. Some dogs can improve with physical therapy while others need surgery. Another common health issue is progressive retinal atrophy. Progressive retinal atrophy occurs when the retinal tissue begins to deteriorate. The tissue continues to deteriorate throughout the dog’s lifespan. A dog that has trouble seeing at night may be suffering from this condition. Unfortunately, there’s no treatment for progressive retinal atrophy. Hypothyroidism is another common health issue of this breed. Hypothyroidism happens when there’s a reduction in thyroid hormone levels. Hair loss, lethargy, and itchy or flaky skin are all symptoms. Fortunately, hypothyroidism can be treated with medication. Common health issues include: This shaggy dog has a cheerful, friendly personality. They are suitable for families with or without children and other pets. The behavior of this dog is energetic and playful. This pooch likes to have fun! Loyalty is one of this dog’s most valued traits. They love to be around their family no matter the activity. These dogs are known as excellent watchdogs because they are always alert to what’s happening in their environment. They are not shy about barking to let their family know someone is on their property. Learning about the diet, exercise requirements, grooming routine, and healthcare needs of a dog or puppy is a big part of being a responsible pet owner. Look at some specifics regarding the overall care of these dogs. Not surprisingly, the food an owner feeds a Polish Lowland Sheepdog can contribute to its health. Of course, puppies and adult dogs need different diets. Check out the details: Polish Lowland Sheepdog puppy foo d: Lean protein is important for the developing joints, bones, and cartilage of a puppy. This is especially true for a breed prone to hip dysplasia. Fat in the diet gives these puppies the energy they need to jump, run and explore their surroundings. Calcium supports the growing teeth, bones, and claws of a young herding dog. Omega-3 fatty acids contribute to healthy brain and eye development in these active puppies. Also, fatty acids help maintain this puppy’s beautiful double coat. Polish Lowland Sheepdog adult dog food : Chicken , turkey, and fish are all lean proteins that support strong joints and cartilage as well as healthy tissue in adult Polish Lowland Sheepdogs. Fat in a limited amount is necessary for this dog’s diet. A limited amount of fat allows them the energy they need to run and play while not adding excess pounds to their small frame. Vitamin A helps to maintain healthy vision and the antioxidants in vitamin C help to repair damaged cells. Fiber assists in proper digestion in both adult dogs as well as puppies. A-Z Animals’ favorite for the best dog food for Polish Lowland Sheepdogs is Stella & Chewy’s Wild Red Classic Kibble Dry Dog Food. This low-carb turkey, chicken, and duck blend combines everything your dog needs and leaves out unnecessary extras. The natural glucosamine and chondroitin from real meat ingredients support joint strength. Plus, the taurine and vitamin A are great for keeping the eyes sharp. You can buy Stella and Chewy’s Wild Red Classic kibble on Chewy and Amazon. How much do these dogs shed? They do a moderate amount of shedding. That’s why brushing them twice a week can help to reduce the amount of shedding they do on the sofa! A pin brush is an excellent tool to help an owner work through the shaggy hair of this sheepdog. Be sure to check between this dog’s toes for small mats or tangles. An undercoat rake can help to remove any tangles further down in its thick hair. A soft hair brush with boar’s hair bristles can be used on the dog’s face. Remember that itchy, flaky skin can be a sign of hypothyroidism in this breed. So, an owner should be on the lookout for those signs while working through the grooming routine. A veterinarian will be able to determine whether the dog has hypothyroidism or skin allergies. These dogs are relatively easy to train. Though they are smart they can be independent and stubborn. After all, they were bred as herding dogs in charge of large numbers of sheep. So, it’s important for an owner to be confident when putting this pooch through its obedience lessons. Australian Shepherds are herding dogs that also respond to a confident owner during obedience training. This high-energy, shaggy canine needs 60 minutes of exercise each day. These dogs need regular, daily exercise to maintain their health as well as their happy temperament. Hikes in the woods, walk in the park, games of chase or fetch, and visits to the dog park are all great ways to give this dog exercise. These herding dogs need to be able to stretch their legs in a large area. So, they aren’t good candidates for apartment life. A home with a medium to large size yard would be ideal for this lively dog. When it comes to these dogs it’s important to start the socialization process early. A responsible breeder begins this process soon after a litter of puppies is born. Since they were bred to herd sheep, these canines like to be in control. Socialization at an early age lets them know the owner is in charge and makes them a welcome addition to a household. After purchasing one of these dogs from a breeder or adopting one from a rescue organization, it’s best to monitor its interactions with children. These are herding dogs and may try to push small children in certain directions simply out of instinct. Once again, socialized puppies are less likely to try to herd the kids. Other dogs similar to the Polish Lowland Sheepdog include the Australian Shepherd, Old English Sheepdog, and Belgian Sheepdog. Popular names for these dogs include: These adorable, shaggy dogs have shown up in the entertainment world. A Polish Lowland Sheepdog played the character, Paul Anka, on the popular show Gilmore Girls. The dog’s real name: Sparky.",
        "score": 0.6890015
    },
    {
        "Name": "Boelens Python",
        "Genus": "Simalia",
        "Diet": "Omnivore that eats cuscus, rodents, bats, lizards, frogs",
        "Behavior": "They can be characterized as solitary solitary except during mating season.Their aggression level is low.",
        "Features": "iridescent black scales and pale chin and jaw",
        "Fun_Fact": "A single hatchling can go for over $5,000 as a pet.",
        "Text": "Boelen’s python is a native of New Guinea that is still a bit of a mystery to science. This species only lives in the highland mountains that run through central New Guinea. It is a diurnal predator that spends most of its time on the ground hunting. There are reports of a few snakes reaching 13-14 feet long, but most often it averages about eight feet long. You’ll find this python at elevations of 7,500 to 8,500 feet in the mid-mountain forests of New Guinea in the Jayawijaya Mountain range. Occasionally, there’s a report of one in areas anywhere from the Bird’s Head Peninsula to Goodenough Island, but the temperatures in those areas aren’t optimal for the pythons. This species is somewhat timid and hard to observe, let alone find in the wild. The mountainous region that it calls home is remote and isolated. Any useable roads are usually maintained by private companies that mine for resources like gold and other precious metals; they’re not available to the public. Yet, the publicly accessible roads aren’t passable except with a well-equipped SUV. This, along with its newness to western science, adds up to a snake that is, in some ways, still very much a mystery and difficult to study. Boelen’s python is a terrestrial species, most active during the day. In the wild, their diet consists of lizards, frogs, cuscus , bats, and rodents. In captivity, they will take rats, quail, and rabbits. Most of what we know about their behavior and breeding comes from herpetoculturists who keep them as pets and zoos that are working to breed them. Boelen’s python is named after K.W.J. Boelen, who helped obtain specimens of the species for scientists to study. In 1953, when it was first described, scientists classified it as Liasis boelini ; in 1958 it moved to Liasis toranga ; over the years, it’s been variously classified in the genera Morelia, Simalia, Liasis, and Lenhoserus, finally landing (thus far), in the Simalia genus, with the Amethystine python and a few others. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Simalia genus pythons occur in Indonesia, Papua New Guinea, and Australia. Members of this genus are generally pretty big, and there are reports of Boelen’s pythons growing up to 14 feet long. This snake goes by several names, including black python; locals know it by blue moran, papa graun, and a few others, but that depends upon the language spoken at the time. On a large island with dozens of languages, it’s easy to see how a snake with sometimes mythical connotations can have several names. While more research is needed, these beautiful snakes are well known to the local tribes and there are many beliefs surrounding them. The IUCN Redlist of Threatened Species considers Boelen’s python “data deficient.” There isn’t enough information on its population or rarity to make an accurate assessment. This species is relatively unknown to science and was only discovered by the west in 1953. Boelen’s python doesn’t appear common in its native range, and a distinct lack of scientific data on its population, reproduction in the wild, diet, etc. That said, it doesn’t seem to reproduce in large numbers, so any take from the wild population can damage its numbers. Western Guinea is part of Indonesia, and the protections offered by the government for this (and other) species are extremely limited. However, on the eastern half of the island is Papua New Guinea; it is strongly protective of its wildlife, including Boelen’s python. As a result, Papua New Guinea prohibits the export of most of its wildlife. In this, Papua New Guinea is similar to Australia. Once you’ve seen a Boelen’s python, it’s unmistakable. It’s a large, muscular python with a big head and elliptical pupils; adults average about eight feet long. Mature individuals have a white to pale yellow belly color, which extends in streaks up their sides. Their backs are dark purplish- or bluish-black with a distinct iridescent, oil-slick-like sheen to their scales. Adults and juvenile snakes’ upper and lower jaws have alternating black (adults) or red (juveniles) and white to cream-colored vertical bars. Their nostrils and heat-sensing pits are large and noticeable. Breeders and zoos are responsible for much of what we know about Boelen’s python and their breeding. Like all pythons, they lay eggs – the female will lay between 6 and 14 in a clutch, then coil around them while they develop. She protects the eggs until they hatch, about 70 days later. At that point, the babies are on their own. Juveniles are a snake of another color. They hatch as a bright red or reddish-orange snake, then darken as they mature, becoming the striking black and white or yellow snake that we know as an adult Boelen’s python. Hatchlings measure about two feet long and reportedly have a very healthy appetite. In captivity, Boelen’s pythons can live for 20 years and more, but no one knows how long they live in the wild. Again, we need more research to determine many aspects of their life cycle. They’re not venomous, but Boelen’s pythons can grow rather large – about 8 feet long with some reports of individuals reaching 14 feet long. Their muscular body makes them capable of injuring a person by constriction; however, they aren’t an aggressive species. This reclusive snake is part of the regular diet of some tribes. Other tribes only allow their warriors to eat it, and only when getting ready for war because they believe it to be one of their gods. They believe that eating Boelen’s python before going into war may give them special powers. The snake figures heavily in the mythology of several tribes. In one story, a god that had beautiful feathers ran from a fight. As he ran, he shed the feathers bit by bit until all that remained was a black python with iridescent scales. On the Indonesian side of New Guinea, a vibrant pet trade exports many native animals, including Boelen’s python. One problem with this is that wild-caught snakes often do not survive captivity. Additionally, those that survive in captivity often refuse to breed. Very few breeders have managed to get these snakes to breed, and those command high prices for one hatchling, currently $11,000 and up. The other problem is the risk of over-harvesting. Some species were driven to extinction in the wild by over-harvesting – whether for the pet trade or other purposes.",
        "score": 0.6882507
    },
    {
        "Name": "Wild Boar",
        "Genus": "Sus",
        "Diet": "Omnivore that eats berries, roots, worms",
        "Behavior": "They usually live in sounders.",
        "Features": "Long, hard and straight snout",
        "Fun_Fact": "Males have a top tusk to sharpen the bottom one!",
        "Text": "The Wild Boar is a species of Wild Pig, native to the forests of Europe, northwest Africa, and throughout Asia. It may have originated in Indonesia, the Phillipines, or nearby, but the earliest fossil evidence, from the Early Pleistocene Era, comes from both Europe and Asia. The Wild Boar’s closest wild relative today is the bearded pig in Malaysia. The Wild Board is an animal with an extremely wide distribution among a number of habitats. Naturally, it is hard to classify them all since they can easily interbreed, but it is widely agreed that there are 4 main types, determined by their location, with 15 subspecies. They are all very similar in size and appearance but may vary in color, depending on their geographic location. The Wild Boars are also commonly known as European Wild Pigs, Hogs, or simply Boars. People have farmed them for so many centuries that the Wild Boar is the ancestor of common domestic pigs. The Wild Boar is a medium-sized mammal with a large head and front end that leads into a smaller hind. Their double coat of fur has a bristly top layer with a softer undercoat. The hair that runs along the ridge of the Wild Boar’s back is longer than the rest. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Coloration varies: brown, black, red, or dark grey, generally depending on the boar’s location. For example, Wild Boar in Western Europe tend to be brown, while those in Eastern European forests can be completely black. The Wild Boar has very poor eyesight because of its very small eyes, but it also has a long, straight snout that enables it to have an acute sense of smell. The snout of the Wild Boar is probably one of this animal’s most characteristic features, and like other Wild Pigs, it sets these mammals apart from others. It has a cartilaginous disk at the end that is supported by a small bone called the prenasal, which allows the Wild Boar’s snout to be used as a bulldozer when it is foraging for food. All Wild Boars have tusks on their bottom lips, although the male’s are larger than the female’s and curve upwards out of their mouths. Interestingly, males also have a hollow tusk on their top lip, which acts like a knife-sharpener, constantly sharpening the male’s bottom tusks, both of which can grow up to 6cm long. There have been several wild boars whose size captured the imagination of the Internet. We published a look at the largest wild boars on record . Generally, the weight is Size The Wild Boar is the most widely distributed land mammal on Earth occupying habitats from Western Europe to Japan to the rainforests of Indonesia. As discussed above, the four divisions of Wild Boars are determined by their location with one inhabiting Europe, north-western Africa and western Asia; another is found across northern Asia and in Japan; the third inhabits the tropical jungles of India, South East Asia and the Far East, with the last being found only in Indonesia. Wild Boars inhabitat tropical jungles and grasslands, but they favor deciduous, broad-leafed forests with dense vegetation. Wild Boars are nocturnal animals that forage for food only at night. They spend around 12 hours sleeping in a dense nest of leaves during the day. Female Wild Boars are relatively sociable animals that live in groups called sounders consisting of 6-30 members. Sounders consist of breeding females and their young and can often be found in the same area as other groups, although they don’t usually mix. Males however, are solitary most of the year, but during the breeding season will move closer to the sounders, and even other males. Male Wild Boars compete with one another to mate with a female. Once mated, the female Wild Boar gives birth to 4-6 piglets in a nest found in a dense thicket, which is made up of leaves, grasses, and moss. The mother remains with her piglets for about two weeks to protect them from hungry predators. Wild Boar piglets are distinctive animals because they have light brown fur with cream and brown stripes that run the length of their backs. Although these stripes will disappear when the piglets are between 3 and 4 months old, they will have effectively camouflaged the vulnerable babies in the forest floor debris. Once they are two months old, the piglets begin to venture out on short foraging trips. Then they turn almost red and become independent at around 7 months old. The Wild Boar does not reach adult coloration until the animal is about a year old. The Wild Boar is an omnivorous animal, and 90% of its diet is young leaves, berries, grasses, and fruits, It also unearths roots and bulbs with its hard snout. Living in highly seasonal regions, Wild Boars have had to adapt to changing fruits and flowers and favor the protein-rich nuts (such as acorns) found in the autumn, which helps to prepare them for the winter ahead. They will, however, eat almost anything that will fit into their mouths and supplement their diet by eating eggs, mice, l izards , worms, and even snakes. Wild Boars will also finish off the abandoned kill of another animal. Due to their large distribution, Wild Boars are prey to numerous predators of all shapes and sizes. Large felines such as leopards , lynxes, and tigers are among the most common predators of the Wild Boar, along with other large carnivores like wolves, bears, and humans. Although their numbers in the wild have dropped rapidly in much of their natural range, in other areas, including mainland Europe, Poland, and Pakistan, there has been a significant population rise. The exact reasons are not known. It is thought to be due to the decline of their main predators, their increased protection, and more regulated hunting. In terms of being in danger of extinction, the Wild Boar has been listed by the IUCN as a species of Least Concern. Wild Boars are now farmed in many places for their meat, but they have also been hunted for their sharp tusks as prize trophies for centuries. Some populations even became extinct, such as in Britain. Today, however, humans have introduced the Wild Boar to numerous other countries around the world, purely so that they can be hunted and eaten. This list includes Hawaii, the Galapagos Islands, Fiji, New Zealand, Australia, South Africa, Sweden, and Norway . Although the overall Wild Boar population is increasing, the species has, in places, been threatened by habitat loss to humans, mainly through deforestation and continuously growing settlements.",
        "score": 0.6870551
    },
    {
        "Name": "Hare",
        "Genus": "Lepus",
        "Diet": "Herbivore that enjoys grass and especially likes herbs, seeds, shrub bark",
        "Text": "The hare is one of the fastest land mammals in the world. This speed is absolutely critical to its survival. Lacking any other formidable defenses at its disposal, the hare is a small and timid animal that can outrun predators with incredible bursts of speed and endurance. The hare is a very common sight, but many fall victim to ferocious predators or human hunters before they can die of natural causes. The hare is not a single species, but rather an entire genus known as Lepus (which is the Latin name for the hare). As you might already know, genus is the level of scientific classification directly above species. There are approximately 30 species within the genus Lepus. There is quite a bit of popular confusion between the terms hare, jackrabbit, and rabbit. Hare and jackrabbit are interchangeable terms that describe the same thing, but the term rabbit applies to a different genus of animals entirely. More confusingly, five species of rabbits are actually called hares, including the endangered hispid hare of Nepal and the red rock hares of Africa . Hares and rabbits are both animals that belong to the same family of Leporidae and the order of Lagomorpha (although they were once considered rodents). The main differences are the hare’s larger ears, more solitary lifestyle, and the tendency to bear young above ground rather than in burrows. Because of the young lack protection, they must be ready to fend for themselves immediately after birth. Another difference is that with their longer muscle fibers, hares are better suited for long-distance running. These animals have a rather distinctive appearance characterized by their extremely long ears, long hind legs, short snout, big eyes, and stout body. They are typically adorned with white, black, gray, tan, or reddish-orange colors to blend in with the surroundings. Some species turn white during the winter months or remain white all year long as a form of camouflage in the snow. In order to change color, these hares molt in the spring. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Hares and rabbits are believed to be descended from a ground dwelling ancestor dubbed Hsiuannania . This creature was native to China and lived during the Paleocene Era in China. This animals was discovered in a few teeth and jaw bone artifacts, but they can definitely be placed as originating in Asia. There are about 40 species of hares in the world. They are divided into three different genera: Lepus, Caprolagus, and Pronolagus. Below are 32 types of hares: Hares are the physically largest animals in the order of Lagomorphs. They are even larger than the closely related rabbits and the pikas . Measuring about 16 to 28 inches from head to tail, they are a little larger than the typical house cat . The body is complemented with 6-inch feet and 8-inch ears. The heaviest species is the arctic hare at around 11 pounds. The male is known as a jack, while the female is called a jill. Both are fairly similar in size and appearance, though females do tend to be a little larger, which is uncommon for a mammal. These solitary animals tend to form in small pairs or family units called a drove. The only time they will congregate among other hares is to find an appropriate mate. Unlike rabbits, they tend to live exclusively above ground. If they need to seek out safety, then they will usually hide in grasses or shrubs. Although they may not look it, hares are physically remarkable creatures with a finely developed sense of hearing, smell, and vision. Their wide angle of view allows them to detect predators coming from anywhere around them except for a small blind spot in front of their noses. They also produce pheromones from scent glands, which might play a role in mating. Some species are capable of short bursts of speed between 40 and 50 MPH and more consistent speeds of around 30 MPH. Thanks to their powerful hind limbs, they can leap 10 feet in the air. They are also excellent swimmers that can traverse rivers and large bodies of water without a problem. The hare has impressively huge ears. In relation to body size, they are perhaps the largest among all living mammals. It is believed that they have long ears for two different reasons. First, the ears allow them to hear sound from almost any direction. Second, the ears serve to dissipate body heat and keep the hare cool, especially during the warmer months of the year. This is essential for the animal’s survival since these animals cannot sweat or pant to work off heat. In fact, when light shines through the ear, you can sometimes see the dense patchwork of blood vessels inside of it that will swell in the heat to lower body temperatures. These animals occur naturally throughout Europe, Asia, Africa, and North America. Because of the large number of habitats to which this genus has adapted, each species inhabits a different geographical range. The snowshoe hare is a well-known species that occurs from Alaska to the mountainous regions of California and Nevada. The African hare, as the name implies, inhabits much of Africa. The arctic hare is one of the few species adapted for the frigid extremes of northern Canada and Greenland. The European hare — which inhabits Europe, the Middle East, and as far east as Siberia — is perhaps the most common species of hares in the world. In recent centuries, it has been introduced into Australia, New Zealand, South America, and parts of North America as hunting game. But after spreading out of control, the species is now considered a pest in many parts of the world, as it consumes crops and outcompetes local species. Wherever it’s found, these animals prefer to inhabit open plains such as meadows, grasslands, deserts, tundra, and savannas. Although this sometimes exposes them to predators, their remarkable speed often allows them to get away even in relatively flatlands. If they need to hide, then hares will conceal themselves in the grass, shrubs, or hollows. Only a few species live in more forested regions. Hares are herbivorous animals that mostly consume grasses in the wild. This is supplemented with nuts, fruits, vegetables, and fungi. Composed of tough cellulose, grass is extremely difficult to digest. Because these animals lack the multi-chambered stomach of cattle , deer , and other ruminants, it is believed that they have evolved to eat their own droppings, which contain many undigested nutrients. This gives them a second chance to digest whatever nutrients remain in the food. Hares are the natural prey of many large cats, birds, and reptiles around the world. The snowshoe hare is the most common prey animal of the powerful lynx . This species goes through an unusual boom/bust cycle in which numbers crash from overhunting and then slowly begin to recover. This cycle takes place over a regular eight to 11-year time span. Meanwhile, both the brown hare and the European hare are the prey of the fox . Other common predators include bobcats , hawks, eagles , snowy owls , wolves , coyotes , bears , and even weasels . The hare has traditionally been a common source of food for people, and they are still among the most hunted animals today. Most of this hunting is responsibly done. However, an even greater threat is habitat loss and fragmentation, which has caused numbers to decline around the world. The hare’s breeding season is quite competitive and feisty. Males will fight each other for access to females, while the female will force the male to chase her as a test of his stamina and determination. This also serves the purpose of helping the animal to stay fit. If the female is not ready to mate at all, then she may box the male right across the face with a stern punch. The hare’s breeding season varies quite a bit by species. Some species can breed at any time throughout the year, while others only breed during the spring and summer months. Both hares and rabbits have a reputation for a prolific rate of reproduction. The female can typically produce one to eight children in a single litter (rarely up to 15) with up to three litters per year. The amount of young usually depends on the abundance of food. The mother will typically carry the children for around 40 days. Hidden in large grasses or depressions, the young hares, also known as leverets, are born with their eyes open and their fur completely grown. They are able to begin hopping within minutes of emerging from the womb. This is because they won’t have the protection of a larger group. The mother herself only visits the children once every day for very short periods, usually to nurse them. Weaning usually begins around 10 days of life and lasts up to 23 days. Although they are functionally independent soon after birth, sexual maturity takes about one to two years in most species of hares. The typical lifespan is between four and eight years in the wild. If a hare avoids disease and predation, then the maximum possible lifespan is around 12 years. The majority of hare species appear to be in relatively good health. According to the IUCN Red List, which tracks the conservation status of many animals, most hare species are currently classified as least concern . A few species, like the Corsican hare, the white-sided jackrabbit, and the black jackrabbit, are vulnerable . The Hainan hare of Hainan, China, and the Tehuantepec jackrabbit of Mexico are both endangered to extinction. Exact population figures are not available, but some species appear to be declining from agriculture and other habitat loss. Hare meat and blood have both been used across the globe through centuries as a source of protein. Hare are available everywhere and their numbers are plenty, which is why hunting activities are unregulated compared to other game. They have also been used for sport hunting activities, in America, many European countries and the UK. Hare meat is not seen as a great survival food due to its low fat content compared to beef, lamb/goat, turkey and even chicken. However, the leanness does make it a healthy choice as it is a great source of protein. Here are some nutritional facts (Per 100g) about hare meat, which produces 173 calories when consumed: Typically hare are cooked over a spit, grilled, roasted or fried for making sandwiches or eating with sauce. Here are a few popular recipes from around the globe: Hare Stew All around the world, especially in Europe hare meat is slow cooked with various vegetables such as onions, tomatoes, potatoes, carrots, celery, garlic and sprinkled with regional sauce and spices. Jugging Hare: The blood of hare is collected in a process called Jugging. The blood is then used to cook the rabbit meat and to thicken the gravy or sauce. The hare is first skinned and the entrails are removed, then the hare is hung upside down so all the blood accumulates in the chest cavity. The hare can be hung for long period of time for collecting the blood. Which is why it is mixed with red wine to prevent coagulation and refrigerated. Their pelts have been and are still used for creating winter wear by the native population living in Americas, Europe, and the Polar regions. Hare have been seen in may cultures and folklore as bringers of prosperity, fertility and abundance. They are also seen as a representation of moon deities, resurrections and rebirth. Here are some facts you would find interesting: Celtic Mythology: The Celts saw Hares as connectors to the Otherworld and it was forbidden to eat them. There are many stories in Celtic mythology about shapeshifting hare that turn into people. Native American: Many native Americans saw the hare as demiurge, probably due to their proclivity to multiply so swiftly, and worshipped them. Egyptian: Egyptians saw the hare as a representation of procreation and immortality. Africa: African natives see the hare as a trickster who survives through the use of great wit. Greek: In Greek mythology hare are associated with Eros and Aphrodite, and they were seen as a romantic gift to be given to partners and potential love interests. East Asia: In Japan, Vietnam Thailand, Sri Lanka, Korea, Cambodia and India, the hare is seen as a Moon deity. The Chinese see the hare as a companion to moon goddess Chang’e. The Asian festival of Mid-Autumn festivals are a celebration of the Moon deities and has risen through the the legends of the moon goddess. Another great example of celebration of the hare is the Easter Bunny who represents the starting of spring, which is essentially a celebration of fertility, rebirth and reproduction.",
        "score": 0.6861336
    },
    {
        "Name": "Antelope",
        "Diet": "Herbivore that enjoys grass and especially likes shoots, seeds",
        "Text": "“The antelope is one of the fastest land animals in the world” With its elegant, bounding leap, the antelope is an animal that roams the forests and plains of Africa and Asia, relying on its incredible speed and agility to elude the most fearsome predators. However, it is important to explain that ‘Antelope’ is a blanket name that covers around 91 different subspecies around the globe. Most of these species are native to Africa. In East Africa alone, there are around 40 different subspecies of antelope. Antelopes are revered and much appreciated even by ancient cultures, due to their speed, their long horns that are capable of causing much damage, and their beauty, eyes, and lashes that are exceptionally large. Although very common and widespread, it still faces enormous dangers from excessive hunting and poaching. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Antelopes are a diverse group of mammals that belong to the family Bovidae, which also includes cattle, goats, sheep, and buffalo. The first known antelopes appeared in the Miocene epoch, around 20 million years ago, in Africa and Asia. Over time, they evolved into a wide variety of forms adapted to different environments and ecological niches, such as savannas, deserts, and mountains. Today, there are over 90 species of antelopes found throughout Africa, Asia, and parts of Europe and North America. The horns of male antelopes are used for fighting and display, while females typically do not have horns. Antelope is more an informal classification than a scientific one. There is no single scientific name that includes all these animals. Instead, the name antelope describes any deer-like animal within the family Bovidae that has a similar appearance and physiology. It is generally accepted that there are several distinct subfamilies that fall within the general term of antelope, but this is still a matter of scientific debate. Due to the lack of precise scientific criteria, there are many different edge cases. For instance, the pronghorn, or the American antelope, is not actually a true antelope at all. The giraffe is more closely related to the pronghorn than the antelopes. Antelopes are incredibly widespread animals. They make up approximately 91 of the 140 or so known species of the Bovidae family, which also includes sheep , goats , and domesticated cattle . More distantly, they belong to the order Artiodactyla with giraffes and pigs . The most distinctive feature of this order is the even number of hooves. The name antelope came to us from the original Greek via Medieval Latin, but the actual meaning of the word is currently unknown. Because of its massive diversity, it is difficult to talk about a single characteristic or appearance of the antelope. Most tend to have a deer -like appearance with spikes or corkscrew horns, but the largest members of the group almost resemble a cross between a deer and cattle. There are generally two types of antelope, which vary by habitat. Small to medium animals such as the duikers and reedbucks are more adapted to concealed cover in forests and wetlands . Thanks to their short legs, round back, and large rear end, they are capable of fast, sporadic movements to elude predators. These animals have camouflaged colorings or markings to provide an extra layer of defense. They tend to forage on foliage by themselves but then pair together with mates monogamously during the breeding season. The larger antelopes, on the other hand, are built for deserts , open plains, and savannas. They graze on the grass and rely on pure speed to help them avoid predators. They tend to congregate into large herds in which a dominant male will mate with multiple females. The size of the herd can vary quite a bit. Some herds consist of no more than 10 or 20 individuals, while other antelopes have herds of thousands, which can make for quite the spectacle on the open plains. These herds may undertake large migrations during certain parts of the year in search of new food reservoirs and grazing land. Antelopes vary dramatically in size between the small royal antelope, which weighs a mere 4 pounds, and the truly gigantic eland, which weighs up to 1,800 pounds, or about as much as some cattle. The topi is perhaps the longest, reaching nearly 9 feet. Males tend to have larger bodies and horns than females, but in a few species, the females may lack horns altogether, or they will have smaller horns than the males. Like many other bovids, the entire body of the antelope is remarkably well adapted for the consumption and digestion of vegetation. It has a multi-chambered stomach filled with specialized bacteria to ferment and break down the tough cellulose of the plant matter. The antelope will also regurgitate the food as cud and chew it again with its well-developed molar teeth to aid in digestion. Another important feature is the antelope’s visual acuity. They have horizontal pupils located on the side of the head that enable them to see predators coming from the periphery of their vision. The acute sense of smell also aids in communication. Specialized fluids secreted from scent glands around the face, knees, and hooves allow them to mark territory and communicate with other members. Antelopes also have a suite of whistles, barks, bleats, grunts, and moos. These vocalizations serve as a means of alarm calls, warnings, or greetings. Approximately 71 species of antelopes inhabit the African continent. Most of the remaining antelopes are found in Asia, including the Middle East, Central Asia, and the Russian steppes. These animals were once prevalent across Europe and the Americas before going extinct there. No known antelopes have ever evolved in Australia. As mentioned previously, antelopes tend to live exclusively in either forests or open plains, rarely mixing the two. Habitation dictates the survival strategies of each species, from body size to diet to social organization. The antelopes feed almost exclusively on vegetation. The only exception is the duiker (a small- or medium-sized antelope located in forests), which supplements its herbivorous diet with small amounts of meat from mammals, insects , and birds . There are generally two types of foraging strategies: browsers and grazers. Browsers tend to feed on leaves, seeds, fruits, flowers, and bark close to the ground. Grazers tend to consume grasses and similar vegetation. The gerenuk and dibatags have a unique strategy of standing on their hind legs to reach leaves in tall trees. It takes an enormous amount of time to break down the plant matter into a usable form, but this strategy is highly beneficial since foliage and grazing land can support a large number of antelopes at a single time. These animals spend a great deal of their time searching for and feeding on food. In order to find adequate sources, some antelopes have cleverly offloaded the work to other animals. They will actively follow bird flocks, monkey troops, or migrating zebras in search of prime foraging grounds. For a complete analysis of antelope diets, make sure to read ‘ What Do Antelopes Eat ?’ Antelopes are some of the most common prey animals in Africa . They make a tempting meal for cheetahs , lions , hyenas , civets, pythons, and large birds. Because of the antelope’s incredible speed, many predators prefer to sneak up on them and pick off individual stragglers. The cheetah, as one of the few animals fast enough to catch them, relies on its pure speed. These chases often make for spectacular footage in nature documentaries. These animals have a number of strategies to deal with a dangerous predators, the most important of which is their speed and agility. If the animal cannot evade its pursuer outright, then it may try to hide in water or foliage. Some species will actually freeze in place to avoid being noticed. If everything else fails, then the antelope may stand its ground and defend itself with its sharp horns. Antelopes are hunted by humans for both their horns and their meat. Some cultures have local taboos against antelope hunting. However, the animal can still become accidentally ensnared in traps. Habitat loss is another significant threat to many types of antelopes. Antelopes pursue so many different courtship and mating rituals that it is difficult to discuss all of them in detail. Breeding strategies can vary between full monogamy and a dominant breeding pair within a herd. In other species, males compete with each other every season for the right to breed with females. Once the female is impregnated, gestation lasts anywhere between four and nine months. The mother produces only a single calf at a time, while twins are relatively rare. Because the calf is highly vulnerable at birth, they generally have two different strategies to protect the young. Most antelopes prefer to hide the calf in a concealed location, while the mother rejoins the herd or hunts on its own. In the second strategy, the calf is expected to begin traveling immediately with the herd from almost the moment it is born. In exchange, the herd provides additional protection for the young calf. The age of maturity varies widely between species. Some of these animal species come of age in as little as six months. Some take as long as eight years to fully develop. Females usually mature faster than males on average. Lifespan likewise can vary between three years and 28 years based on the species. According to the IUCN Red List , around a quarter of antelope species are currently threatened by extinction, and several have already gone extinct in the 19th and 20th centuries. But even among those groups in good health, many appear to be in decline and could face pressure in the future due to hunting and declining habitats. The exact population numbers are not known. The San Diego Zoo Safari Park has perhaps the largest collection of these animals in the United States, including springboks, lechwes, waterbucks, sables, roan antelope, gazelles, white-bearded gnu (a type of wildebeest ), blesboks, and many more. One of the most important denizens is a breeding herd of saigas, a critically endangered antelope that inhabits the Eurasian steppe. The zoo has bred more than 100 saiga calves in captivity and also assists with conservation efforts across Russia. If you don’t live near San Diego, then there are still several ways to see live antelopes. The Little Rock Zoo in Arkansas contains three species of antelopes: the yellow-backed duiker, the greater kudu , and the dik-dik. The Buffalo Zoo contains the roan antelope and the addax. The Saint Louis Zoo has the addax, the lesser kudu , Speke’s gazelle, and the gerenuk. Finally, the Smithsonian’s National Zoo contains the dama gazelle and the scimitar-horned oryx . Antelope hunting is very popular in regions that are their natural habitat. In fact, many people have made antelope hunting into business by creating farms. Some claim to have adapted sustainable practices and conscious hunting practices. It is essential to note that out of 91 species of antelope 25 are in various stages of conservation by the IUCN; 9 Species have been classified as endangered, 9 as vulnerable, and 5 as critically endangered. IUCN also says that 70% of the species are under threat of extinction and 62% of species are rapidly declining in numbers. Although not as popular as venison, deer, or buffalo, the meat of antelope is known for being lean and healthy. The taste of the meat largely depends upon how fast the hunter can skin, remove the entrails and cook the meat. According to seasoned hunters, if too much time passes before the animal is processed, the meat does not taste good. Antelope meat has a mild sage-like flavor and is granular and sweet in taste. It is almost the same as venison and just as lean. The best way to cook antelope meat is to cook it over the fire, like grilling, roasting, or medium-rare in the oven. Overcooked meat becomes dry and tough to chew. Antelope are killed more for the pursuit of their horns than as a game. In many cultures, the horns have been used for medicinal and mystical purposes. In ancient times natives of Africa, America, and Asia used the horns for various purposes. In India and China, deadly weapons were fashioned by tipping the horns with metal, parrying shields were reinforced, and they can also be turned into knives and other striking weapons. Some cultures believed that the antelope horns are an effective aphrodisiac. They were hunted down for the sole purpose of collecting the horns, which were ground into powder form and consumed. The Saiga males have fallen prey to this belief and are now termed critically endangered with around 50,000 of them left in the world. Antelopes are widely used in heraldry, however, their forms are altered from their natural form. They are seen to have the body of a stag, the tail of a lion, and serrated horns. They have also been given small tusk which is placed with a snout. The heraldry was designed by Europeans during the middle-ages, who had no idea what an antelope really looked like and imagined it as a monster hunter.",
        "score": 0.6860477
    },
    {
        "Name": "Mongoose",
        "Genus": "Herpestes",
        "Diet": "Omnivore that enjoys rats and especially likes eggs, insects",
        "Text": "Fast and agile, the mongoose is an animal that is an adept hunter that will feed on almost anything it can catch. The mongoose is a small, sleek animal (similar in appearance to a weasel ) that roams the forests and plains of Asia and Africa. Because of its rather bold temperament, the mongoose has been the subject of human myths and stories for thousands of years. However, the life of a mongoose as a normal animal is far more complex and interesting than these myths suggest. Mongoose is the colloquial, or common, the term for a group of similar species that belong exclusively to the family of Herpestidae. The scientific name derives from a Greek word for an animal that walks or creeps on all four feet. Mongooses occupy the same order — Carnivora — as cats , bears , dogs , seals , and raccoons . They are the most closely related to viverrids such as civets , genets, and linsangs. The mongoose is an animal somewhat more distantly related to the hyena , and an example of a feliformia, or a cat -like carnivore. It is believed that at some point early in its evolution, these animals split into two different subfamilies: the Herpestinae and Mungotinae. A third subfamily called Galidiinae was once classified with the other two. Endemic to Madagascar, Galidiinae was sometimes known as the Malagasy mongoose for its similar appearance. However, this subfamily is now classified as the family Eupleridae instead of Herpestidae. There are around 34 mongoose species still living. This includes 23 species of Herpestinae and 11 species of Mungotinae. A few extinct species are also known from the fossil record. Mongoose species are unevenly distributed across the entire family. Some genera only have a single species in them. The genus Herpestes, however, has approximately 10 living species, including the well-known Indian grey, the Egyptian, and the crab-eating mongoose. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . These animals are typically slender creatures with elongated bodies, short legs, thin snouts, and small rounded ears. The coat color is almost always brown, gray, or even yellow, sometimes interspersed with markings or stripes. The tail may also have a unique ring pattern or coloring on it. Because of their appearance, some people mistake them for a weasel, even though their traditional range rarely overlaps. The mongoose as an animal (not the myth!) varies in size from one species to another. Their body can range from seven inches on average for the diminutive dwarf mongoose to 25 inches on average for the massive Egyptian mongoose, while the tail adds another six to 21 inches. This makes the typical animal about the size of a house cat . The largest species can also weigh up to 11 pounds when fully grown. Their sense of smell is an important part of mongoose communication. This is facilitated by the presence of large scent glands near the anus that they use to signal for mates and mark their territory. In fact, the scent gland is the primary characteristic that separates these animals from the civets, genets, and linsangs. Mongooses (the correct plural of mongoose) are animals that also rely on vocalizations to signal threats, begin courtship, and convey other critical information to other members. They have an impressive range of sounds to communicate with each other, including cries, growls, and giggling. Each sound is accompanied by a different set of behavior. The Herpestidae family in general exhibits a wide array of social structures and behavior. While some species thrive in solitude or small clusters, other species live in colonies of up to 50 individuals. The well-known meerkat, for instance, (which was made famous by a TV show) lives in large cooperative bands with a distinct social hierarchy. Individuals are sometimes responsible for specialized tasks such as guard duty, hunting, and child protection. The colony lives or dies based on the actions of each individual member. The particular social arrangement of a species may be related to its physical size and type of animal. The larger and more physically intimidating Egyptian mongoose is a lone hunter, while the smaller dwarf mongoose is a more social creature that staves off predators by clustering together into large groups. Alone, an individual is vulnerable. But even smaller animals can be difficult to kill when it is part of a pack. The mongoose’s small size conceals its rather bold disposition. The creature is able to hold its ground against dangerous predators much larger or more aggressive than itself. Being able to kill snakes (even venomous species!) is only one example. These animals can also sometimes evade or bamboozle deadly predators with their impressive speed and agility. Some species can run at an average of 20 mph. These animals are most active during the day while they hunt and socialize. They tend to spend the night in their dens asleep. Mongooses can be quite intelligent and playful, especially in social settings. The mongoose is an old-world animal that thrives largely in hot or tropical areas. The largest populations can be found across sub-Saharan and Eastern Africa , including most species of Mungotinae and some species of Herpestinae. They are also fairly common throughout a long stretch of territory in southern Asia, from China to the Middle East. Other common locations include southern Iberia, Indonesia, and Borneo. These are largely terrestrial mammals that roam the ground. They reside in a variety of different climates and habitats, including tropical forests, deserts, savannas, and grasslands. However, there are a few notable exceptions. Some species such as the crab-eating mongoose are semi-aquatic and spend a good deal of their lives in and around the water. They are quite adept at swimming with webs between their digits. Other species inhabit the trees, moving effortlessly between branches. The terrestrial mongooses, on the other hand, burrow into the ground with their big non-retractable claws. They spend much of their time within the complex system of tunnels they have created. These animals are opportunistic carnivores that will feed on a huge variety of different foods, whether living or dead. These may include reptiles, small birds and mammals, amphibians, insects , worms, and crabs . However, some species will supplement their diets with fruits, vegetables, roots, nuts, and seeds. If the opportunity presents itself, then the animal will steal or feed on another creature’s kill. A clever animal, mongooses have learned the ability to smash shells, nuts, or eggs against rocks to crack them open. It can pound the object directly against a hard surface or throw the object from a distance. This tactic is passed from one generation to another, which may represent a form of transmissible culture. The mongoose’s diverse palate can be a problem for other species, however, and they have been considered an invasive species in some areas. The Mongoose has only a few natural predators in the wild such as hawks and big cats . Larger mongooses can ward off predators through sheer physical size, but smaller species in particular are vulnerable to predation from large carnivores. The mongoose is also sometimes threatened by venomous snakes , but thanks to its agility and speed, the mongoose is more than a match for the fearsome reptile. Its sheer adaptability has enabled it to thrive across many different geographical regions around Asia and Africa. However, some types of mongooses are currently declining due to habitat loss from human encroachment. They require ample space for burrows and social arrangements. In the 19th and 20th centuries, human settlers introduced mongooses around the globe — particularly to several oceanic islands such as Hawaii — to help with pest control on plantations and farms. Although mongooses rarely succeeded in this task, it did have the unintended consequence of driving much of the local wildlife — including many unique bird species — to the brink of extinction. For this reason, mongooses are considered to be one of the top invasive species in the world, and some efforts have been made to cull or limit mongoose populations in non-indigenous areas. Mongoose reproduction varies widely between species since it is often a reflection of their social structure. Solitary mongooses only meet up at regular intervals to reproduce, usually once a year. One or both parents may raise the young pups. Large colonies, on the other hand, tend to have a dominant member of the pack with almost exclusive breeding rights to several females — or sometimes there is a single male-female dominant pair. Once mating is completed, the female will give birth a few months after conception. She can give birth to a litter of anywhere between one and six pups at a time. The mongoose pups tend to grow up relatively quickly. After they are weaned, the pups will remain dependent on the parent(s) for another several months. It can take between six months and two years for a pup to become fully mature. Among more social mongoose species, pups are introduced into the colony from an early age. When foraging, several members will stay behind to protect the young. In some colonies, a pup will choose a specific adult to provide regular sustenance and attention. Individuals may even form lifelong bonds with family and/or fellow members of the colony or pack. Lifespan depends greatly on the species, but a typical mongoose can live around 10 years in the wild and perhaps twice that in captivity. Although precise population numbers are difficult to estimate, many Mongoose species across the globe appear to be in robust health. The Indian grey mongoose is perhaps the most widespread species. It is commonly found throughout the Indian subcontinent and southern Iran in a single unbroken range. According to the International Union for the Conservation of Nature (IUCN) Red List of threatened species, the Liberian mongoose is the only species that qualifies for vulnerable status, while several other types of mongoose are near threatened . However, the Malagasy mongoose, though not a true mongoose, is under threat in its native habitat, since several species have fallen to endangered status. Habitat loss will need to be halted or reversed for some species to rebound again to their former levels.",
        "score": 0.68594164
    },
    {
        "Name": "Aardwolf",
        "Genus": "Proteles",
        "Diet": "Carnivore that eats termites and other insects",
        "Behavior": "They can be characterized as solitary.",
        "Features": "The thick mane that runs along the back",
        "Fun_Fact": "The aardwolf has five toes on its front paws",
        "Text": "“Aardwolves play a positive role in the ecosystem by limiting the number of termites throughout their natural range.” The aardwolf is the lesser-known cousin of the striped , brown, and spotted hyenas. Because it’s shy, elusive, and nocturnal, it’s rarely encountered by people. The name aardwolf essentially means earth wolf in the Afrikaans and Dutch languages, but this is misleading because it’s not a wolf at all. Instead, it belongs to the hyena family, a fact which is fairly obvious from its appearance alone. It looks quite a bit like a striped hyena, whose African habitat overlaps with its own. This article will cover some interesting facts about the identification, diet, habitat, and behavior of the aardwolf. As just mentioned, the aardwolf is a member of the hyena family, and its appearance is quite similar to a hyena. The main differences are that the aardwolves are generally smaller in body size, they live in smaller groups of family units, and they consume insects rather than carrion or larger prey. The scientific name of the aardwolf is Proteles cristata . The genus name Proteles, which essentially means “complete in front” in Greek, refers to the fact that it has five toes on the front limbs and only four on the hind limbs. Cristata comes from a Latin word that means a comb or tuft on the head of an animal (referring to its luxurious mane). See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . There are two subspecies of the aardwolf: Proteles cristatus cristatus lives in Southern Africa, and Proteles cristatus septentrionalis lives in eastern and northeastern Africa. Together with the brown hyena , spotted hyena, and striped hyena , the aardwolf is a member of the family Hyaenidae. It was once placed in its own separate family, but this is no longer considered to be correct. Aardwolves are thought to be an example of a “primitive” hyena. This essentially means they may have evolved from a very early branch of the hyena family before the other three species came to be. Based on genetic and fossil evidence, they probably diverged from the rest of the hyena family at some point between 15 and 32 million years ago. It was once thought that the aardwolf may not be a hyena at all, but rather a closely related species mimicking the appearance of the striped hyena to trick potential predators, but this explanation has fallen out of favor as scientists have gathered more evidence. The aardwolf might be accidentally mistaken for a hyena if you don’t know what key identification markers to look for. The most prominent feature is the strong dark stripes against a backdrop of brown or yellow fur with additional black markings around the feet, tail, and muzzle. It also has a thick mane running from the head to the tail and large triangle-shaped ears. However, compared with most hyenas, it also has five toes on the front feet instead of four. Most members of the species are about three feet long and weigh between 17 to 31 pounds. This makes them the smallest member of the hyena family. Males and females look almost identical in coloration and size. Because of their shy and elusive behavior, there is still a lot about the aardwolves we don’t yet understand. For a long time, it was thought that the aardwolf was a solitary creature. But in fact, as we’ve since learned, the basic unit of the aardwolf’s social life appears to be the family, which consists of a breeding pair and their immediate offspring. There is little evidence it forms larger packs or groups for long periods. The breeding pair raises the offspring together nearly all year long and defends their territory against outside aggressors. They may create as many as 10 dens, as well as several waste disposal areas, within their territory. The den is usually composed of a simple hole, crevice, or abandoned porcupine or aardvark burrow in the ground. Aardwolves do most of their communicating with the scent markings of their anal gland. This scent is smeared all over foliage to mark their territory and attract mates. They tend to make very few sounds unless they are threatened or startled. The only exceptions are some clucking, barking, and roaring sounds. If it’s in direct danger, then the hairs on the back of the mane will stand up and it may emit a foul-smelling substance from the anal gland. The aardwolf may also chase the intruder out of its territory, but given the slow speed, it may prefer to let the intruder go. Only when the aardwolf is faster will it overtake the other animal and instigate a fight. Despite the strong bond between the mating pair, the aardwolf appears to do most of its foraging alone without the help of its partner. As a nocturnal animal, it comes out at night to do most of its feeding, and then it retreats to the underground den during the daylight hours to avoid the withering heat. This behavior may change during the winter months when it comes out for some time in the afternoon and then sleeps at night. There is some evidence to suggest that the aardwolf may share part of its territory or hunt in small groups when food is particularly scarce. This maximizes their chances of finding food. The aardwolf prefers to inhabit dry open savannas and grasslands with minimal annual rainfall. It can be found in two separate disconnected places, thus the two subspecies have developed from the separation: the eastern horn of Africa around Ethiopia, Somalia, and Kenya, and the southern portion of Africa around Angola, Zambia, and South Africa. There is some debate about whether these eastern and southern populations should be considered as entirely separate subspecies because apart from their distinctive ranges, they are otherwise similar. The aardwolf faces few significant threats in the wild because they generally keep to themselves and don’t bother humans too often. However, sometimes they are in danger of falling victim to hunting, motor accidents, and habitat loss from encroaching human habitats. Adult aardwolves have few serious predators in the wild, but the aardwolf puppy is vulnerable to jackals , lions , leopards , and other hyenas. Hunting dogs will also sometimes attack and kill the aardwolf. Aardwolves may look like fearsome predators, but their diet consists almost solely of termites . After locating the termite mounts through scent and sound, the aardwolf will dig up the quarry with its sharp claws. It will then lick the termites right off the ground with their long sticky tongue. It’s estimated that a single individual can consume around 300,000 termites every single night. The termites also supply them with most of the water they need in their otherwise dry and arid habitats. Aardwolves are immune to the toxins that these termites produce to stop other predators from eating them. If termites are not available, then they might consume beetles and other insects. Contrary to expectation, they do not appear to scavenge for carrion at all like other hyenas, butt they might consume insects right off a dead body. The aardwolf’s mating season can conceivably take place at any time of the year, but depending on where it lives, breeding often peaks in the rainy months. To attract a potential mate, both males and females will secrete a pungent scent from the anal gland. If the female accepts what the male has to offer, then they will form pair bonds together and produce a single litter per year. However, the most aggressive males may intrude on another territory and copulate with the mate of a weaker male as well. After a gestation period lasting approximately 90 days, the mother will give birth to a litter of two to five pups with their eyes open but otherwise helpless. They will remain safe and protected in the underground den, feeding on the mother’s milk for the first three to four months of their lives. The father has the responsibility of guarding the den, while the mother will make foraging trips outside. When the offspring are fully weaned, each puppy will be fed regurgitated termites until they’re old enough to hunt on their own. These foraging trips become progressively bolder and farther from the den with each passing month. The aardwolf puppy will continue to learn and grow under the supervision of the parents for the first year. After that, they leave the family to stake out their territory. Most aardwolves achieve full sexual maturity at around 1.5 to two years of age. The lifespan of the aardwolf isn’t exactly known, but other closely related hyena species can live about 15 years or more in the wild. Aardwolves are considered to be a species of least concern by the IUCN Red List . This means numbers are healthy and they require no special conservation efforts. It is not known how many aardwolves live throughout their entire range, in part because their elusive and nocturnal behavior makes it hard to estimate. Based on the aardwolf’s behavior, however, we know that population densities are quite low. A single breeding pair can occupy territory as large as 1 to 4 square kilometers (0.4 to 1.5 square miles). The male will defend his territory both in and out of the breeding season.",
        "score": 0.6858879
    },
    {
        "Name": "Impala",
        "Genus": "Aepyceros",
        "Diet": "Herbivore that enjoys grass and especially likes seeds, flowers",
        "Text": "When startled, an impala animal can jump up to 10 feet high. Impala are animals that live in the light woodlands and savannahs of southern and eastern Africa. These medium-sized antelopes travel and gather in herds of hundreds during the rainy season. The rains bring an abundance of grasses, shoots, herbs, bushes, and shrubs for their grazing. In the dry season, these herds work together to find food in a process called “browsing,” as part of which they eat leaves, twigs, and higher-growing vegetation. Impala animals have an innate sensibility when it comes to avoiding predators. For example, they tend to drink in the hottest part of the day from rivers or other sources of water, aware that their enemies tend to be sluggish or sleep during that time. Also, pregnant female impalas give birth around midday for the same reason–there will be a lower risk of a predator laying in wait to attack. If a herd encounters a lion, leopard, cheetah, or other predators, they will scatter in many directions to confuse the attacker, while kicking their hind legs to release a scent from glands in the feet to help them stay together or regroup. Impala animals are truly fascinating creatures! Read on to learn more about their characteristics, behavior, habitat, and more. Impala have the scientific name Aepyceros melampus. This name comes from Ancient Greek, with Aepyceros meaning “high horned” and melampus meaning “black foot.” The common name impala is from the Zulu language. Impala belong to the kingdom Animalia, phylum Chordata, and class Mammalia. Along with cattle, antelopes , sheep , goats , buffalo , and bison , they belong to the family Bovidae. All of these bovidae have hooves and horns. The horns differ from deer , however, in that they grow from the front of the animal’s skull and do not shed or branch. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Impala have mostly red-brown fur that helps them hide among the brush. But they feature white on their bellies, chins, lips, inner ears, eyebrows, and tails. The tail and backside of the animal also feature a set of black stripes that form the letter “M.” Otherwise, they have more black across their foreheads, thighs, and ear tips. Female impala, called ewes, have no horns. But males, the rams, grow curved horns with a notable twisted appearance due to ridges. These horns are black and grow as long as 36 inches. Males measure between 30 and 36 inches tall from their hooves to their shoulders. Females grow to a smaller span of 28 to 33 inches. Their length from their head to the base of their tail is between 47 and 63 inches, for both genders. An impala tail adds between 12 and 18 inches more to their length. They usually weigh 88 to 99 pounds (for females) and 132 to 143 pounds (for males). Impala limbs are lengthy, slender, and graceful with scent glands at the ankles. These legs help them leap up to 30 feet in length or up to 10 feet high. Learn more about the highest jumping animals on earth here . Impala typically stick together in herds of 100 to 200 animals. During the dry season, these herds include both males and females working together to find food. When the wet season begins, the herd separates into a male herd and a female herd. These new groups graze on the plentiful grasses and other vegetation. Paleontologists have discovered a wide range of fossils relating to this slender antelope such as A. datoadeni dating back to the Pliocene Era in Ethiopia. They also believe according to evidence obtained from the oldest fossil that the ancestors of the impala were pretty similar to their modern descendants although somewhat smaller in size. A sign that the herbivore has done rather well for itself in handling the challenges presented by its habitat from the distant past until the present. Impala are animals that prefer to live near a water source in woodland, grassland, and savannah of Africa . In Africa, these animals still live throughout Kenya, Botswana, Angola, Malawi, Zimbabwe , Zambia, Mozambique, Namibia, Rwanda, South Africa, Swaziland, Uganda, Zaire, and Tanzania. Herds recently began living in Gabon. But in Burundi, local impala are extinct. Impala animals prove highly adaptable herbivores. They change their diet according to what vegetation is available around them. They prefer to eat fresh grass. But they will then rely on many types of foliage, including herbs and shoots, when there is no grass. Other foods they eat include shrubs, bushes, fruits, and acacia pods. Much like your pet house cat, impala are picky about the water they drink. They prefer lake or river water, over murky ponds or puddles. But they can also eat enough green vegetation to keep themselves hydrated. The primary predators of impala include stalking animals like lions , leopards , cheetahs , hyenas , and wild dogs . But many also lose their lives to jackals , humans, eagles , hunting dogs, and caracal. When the animal attempts to drink water from a river or they fail to pay attention, an impala can become a meal for a hungry Nile crocodile . The captured impala is usually one that was absorbed by its own thoughts while grazing. They tend to stop paying attention to their surroundings when they are in low-lying brush, where many predators stalk and surprise them. When out in the open, they stay aware and act quickly to get away from danger. Leaping upward is “pronking,” a behavior that confuses impala animal predators. It can work on human hunters who then struggle to line up a shot on the fast and high jumper. When a predator comes near, all of the impala in the herd start pronking to create a confusing scene. If pronking fails to send the predators away, the impala scatter in all directions and hide in low brush and bushes. Besides this vertical leap of up to 10 feet in the air, impala can leap up to 30 feet outward and over bushes and other hurdles. Besides signalling growth of abundant food for impala, the rainy season also signals time for males to compete for territory dominance. The single herd of the dry season separates into two herds, one male and one female group. After separation, the most dominant males spray urine and feces to make their presence known and mark their land. Using their long, slender horns, the males challenge each other to prove their strength. Some of the males find a territory and herd as many females as they can onto that territory. Once on their territory with a group of lured females, the dominant males mate while using their horns to threaten incoming rivals. To attract females, dominant males engage in tongue flashing. This means they flash their tongues at the females who group together to walk through the male herd. Non-dominant males in the territory show their defiance of this scene by running away or flashing their own tongues stubbornly. Males not succeeding in achieving herd dominance retreat to a bachelor herd. They can challenge rivals throughout the season. Of course, the younger, older, and weaker males typically find themselves staying with the bachelors for grazing until the herd comes back together as one unit for the dry season. After successful mating, females give birth to an approximately 11-pound fawn after about seven months of gestation. They can put birth off until month eight if conditions are not right for the fawn’s safety. Most births are for only one baby. The mother and newborn fawn stay together in an isolated area for several days. The mother then leaves each day to be with the herd, returning to the fawn’s den to nurse. Eventually, they both join the female herd and other offspring where the fawn nurses for four to six months before weaning. Like humans going off to nursery school at a young age, weaned fawns live in a sub-group of the herd called a nursery group. When they mature at about one year of age, females from this group stay with the herd. But males must join a bachelor group. Impala live for 12 to 15 years in the wild. But in captivity and without predators, drought or disease to contend with, many live beyond age 20. The International Union for Conservation of Nature (IUCN) lists the impala as of the least concern, in regard to conservation. This means they are at low risk for extinction at this time. About two million impala live in the wild or on private land today. About one quarter of these live in protected areas in Botswana, Kenya, South Africa, Tanzania, Zambia, and Zimbabwe. The population remains stable with the exception of a black-faced subspecies of southwestern Angola and Kaokoland in northwestern Namibia, that currently includes only 1000 animals. To help that subspecies with black faces restore its population, some are being protected on private farms in Namibia and the Etosha National Park.",
        "score": 0.685548
    },
    {
        "Name": "Baboon",
        "Genus": "Papio",
        "Diet": "Omnivore that eats fruits, seeds, insects",
        "Behavior": "They usually live in troops.",
        "Features": "Dog-like muzzle and long, bent tail",
        "Fun_Fact": "Can travel more than four miles a day!",
        "Text": "The Baboon is a medium to large-sized species of Old World Monkey that is found in a variety of different habitats throughout Africa and in parts of Arabia. There are five different species of Baboon which are the Olive Baboon, the Guinea Baboon, the Chacma Baboon, the Yellow Baboon, and the Hamadryas Baboon which differs most from the others wide its bright red face and cliff-dwelling lifestyle (the other four species are collectively known as Savanna Baboons). However, there is some debate over the classification of the different species due to the fact that some have been known to interbreed, indicating that they could be sub-species instead. Baboons are incredibly sociable and intelligent animals that are known to form close bonds with other members of the troop that often last for life. They are also incredibly adaptable animals but their population numbers are declining throughout their natural range primarily due to hunting and habitat loss. Here are the five different Baboon species: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Baboons are large and powerfully built monkeys that spend most of their time on the ground. They have large heads with long, dog-like muzzles and cheek pouches for storing food with a heavy brow ridge protecting their eyes. Males are often twice the size of females and have fearsomely sharp canines that help them to defend the troop from danger, but their exact size depends on the species with the Chacma Baboon being the largest while the Guinea Baboon being the smallest species. Baboons have wild-looking fur with a longer mane that extends over the shoulders and hairless patches on their faces and rumps which are padded with hard skin. Their color varies from olive-green to yellow, silver, and brown depending on the species. They also have a distinctive bend towards the base of their long tails. Baboons would have once been found throughout the African continent and today, although they are still widespread, their natural range continues to decrease. Baboons are found in a variety of habitats including savanna, scrub, rocky deserts, and rainforests providing there is an ample supply of water. The Hamadryas Baboon is found in the rocky deserts in the hills that line the coast of the Red Sea both in northeast Africa and in parts of the western Arabian peninsula. The Olive Baboon is the most widespread species with a range that extends from west to east across a wide range of habitats, whereas the Guinea Baboon is confined to a small region in the west. The Yellow Baboon is found in the east and the largest species, the Chacma Baboon is also found the furthest south, with a range that covers the southern tip of Africa. Baboons are incredibly sociable animals that live in large troops that can be very varied in size and can contain a few hundred members. Baboon troops consist of both males and females with their young and form very close bonds by feeding, sleeping, and grooming together. During the day they break into smaller bands of 4 or 5 females and young, which is led by a dominant male who attempts to keep other males away. The Hamadryas Baboon, however, lives in much smaller groups of around 12 females and a single alpha male. Baboons live together for protection and are constantly on the lookout for dangerous predators, particularly when they are out in the open. If a threat is spotted, they make loud barks and while the males run to attack, the females and young disappear up into the safety of the trees. Baboons communicate with one another in a variety of different ways including vocal calls, facial expressions, and even signals with their tails. Baboons breed all year round and while they don’t have a strict breeding season, there are peaks in mating and births at certain times of year (depending on the location). When a female is ready to mate, the dominant male of their sub-group will defend his right to mate with her fiercely but despite his efforts, female Baboons mate with numerous males in the group during their lives. After a gestation period that lasts for around 6 months, the female Baboon gives birth to a single infant that grabs onto her fur instantly and clings to her. When they are born, young Baboons are contrasting colors to their parents and are tolerated by the troop until they molt and grow their adult fur after about two months. Young females remain with their mothers and the two will often form very close bonds throughout their lives, whereas males are chased out of the troop and are forced to try and prove themselves to another group. The Baboon is an omnivorous animal that is known to eat a wide variety of both plant matter and small animals. Fruits, seeds, tough roots, and flowers all make up the bulk of their diet, along with insects, eggs, lizards, and rodents. However, their large size and power also mean that they sometimes hunt and kill larger prey such as young Gazelles. In areas where human settlements are encroaching on their natural habitats, Baboons are also known to raid crop fields which have led to them often being seen as pests. Baboons have very similar teeth to people with a series of large, flat molars which are perfect for grinding down vegetation and surplus food can be stored in their flexible cheek pouches to be saved for later. Due to their size and the fact that Baboons spend the majority of their lives on the ground, they are preyed upon by numerous predators throughout their natural range. Wildcats such as Lions , Leopards, and Cheetahs are the most common predators of the Baboon along with large Pythons, African Wild Dogs, and Birds of Prey that hunt the smaller and more vulnerable young. People, however, pose the biggest threat to Baboons as they are often hunted and killed for meat and are even shot by farmers who consider them pests, fearing for their crops. Their numbers though are being most affected by the loss of their once vast natural habitats, which are being subjected to deforestation for agriculture or land clearance for grazing and growing human settlements. Although Baboons retire into the safety of the trees to sleep at night, they spend nearly all of the rest of their lives on the ground and roam throughout their home ranges in search of food and water. They are known to walk many miles a day and only stop in the shade to get out of the midday sun and are capable of traveling more than four miles between dawn and dusk. Like many other primates, Baboons take part in social grooming by picking parasites, dead skin, and dirt from each other’s fur. This not only strengthens social bonds within the troop but also highlights the status of the individual, with the Baboon who is being groomed having a higher status in the troop than the one who is grooming them. In order for male outsiders to be accepted into the troop, they must form a relationship with one of the females until he is then accepted by the others. This process can take months but the pair are usually known to remain close-knit friends for life. Baboons have adapted remarkably well to the growing human populations throughout their natural range but the fact that they often raid crops has led to them being persecuted by farmers. They are also hunted and eaten as bushmeat in many areas of their native regions but it is their dwindling habitats that are causing the biggest problem for them. Vast areas of forest are cleared every day to make room for agriculture or to log the tropical timbers which means that Baboons have fewer areas where they can sleep safely in the trees. The grasslands are also dwindling in size as land is turned over to livestock for grazing or used for the expansion of growing settlements. Today, four species of Baboon are listed by the IUCN as species that are of Least Concern from becoming extinct in the wild in the near future. The Guinea Baboon is listed as a Near Threatened species. However, despite still being relatively widespread, population numbers are declining in all species due to hunting and habitat loss, with populations in certain areas rapidly becoming more and more isolated from one another. They are found throughout many of Africa’s national parks and reserves where they play a vital role in the upkeep of the eco-system.",
        "score": 0.6850543
    }
]