[
    {
        "Name": "Blackpoll Warbler",
        "Genus": "Setophage",
        "Diet": "Omnivore that eats flies, lice, beetles, fruit",
        "Features": "Black feathers on its head (males)",
        "Fun_Fact": "They migrate for the longest distance of any warbler.",
        "Text": "“These birds fly 72-88 hours non-stop during migration.” A Blackpoll Warbler is a songbird. It’s an omnivore eating mosquitoes , spiders , flies , and fruit. They live in an evergreen forest habitat. One of the most interesting facts about this bird is it travels non-stop on a migration route that proceeds over water. Blackpoll warblers live in North America , specifically Canada . Their migration route goes through the eastern part of the United States down to the northern part of South America . Though it’s temperate and rainy in some areas of Canada, its habitat is too cold for these songbirds in the wintertime. Birdwatchers interested in seeing the blackpoll warbler are most likely to see them during the spring and fall seasons. Their migration route covers the eastern part of the United States. So, people can see them in the spring as they head up from South America back to Canada. Alternatively, birdwatchers can see them in the fall as they head south again for the winter. They don’t travel the same migration route for both seasons. Blackpoll warblers are sometimes heard before they are seen and are known to sing much more in the spring than in the fall season. Plus, the colors of the male are more distinct in the springtime. This makes them easier to spot in their habitat. Female blackpoll warblers usually build their nests in fir or spruce trees, close to the trunk. Some of these songbirds build a nest just six feet above the ground while others build them thirty feet up. The nest is the shape of a cup and with an exterior made of lichen and twigs. The inside of the nest is constructed out of hair or grass. Construction of the nest takes three to four days. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The scientific name for this songbird is Setophaga striata . The word Setophaga refers to the genus of this bird while the Latin word striata translate to striped. A blackpoll warbler has a striped pattern on its wings. It is in the Parulidae family and the Aves class. Some other species of warbler include: The differences in the colors of male and female blackpoll warblers make identification fairly easy. The male blackpoll warbler is named for the cap of black feathers on its head. It has a white breast and black and white stripes on its wings. A female has brown and white streaks on her head. Look closely and you’ll notice a yellowish tinge to the feathers on her head and breast. A female blackpoll warbler’s wings have black or brown and white stripes. The female has muted colors, whereas the male feather colors are bold. This songbird is small in size at no more than five and a half inches in length. It weighs from 0.4 to 0.5 ounces. The wingspan of this bird is eight to nine inches. One of the most notable facts to use in its identification is this songbird is it has orange feet! In the fall season, blackpoll warblers migrate south from Canada to South America. Their migration route in the fall runs south from Canada over the eastern part of the United States, over the Atlantic Ocean to the northern part of South America. Many of these tiny songbirds travel non-stop for 72 hours or more on their journey south. These birds travel north in the spring to breed in various parts of Canada. However, their migration route in the spring is not the same as the route they use in the fall. This songbird is an omnivore. It finds food on the leaves in the tops of evergreen and deciduous trees. The diet of this bird includes spiders , beetles , mosquitoes , ants , and fruit. They increase their intake of food right before they start on their journey south in the fall season. These small songbirds have several predators. Other animals attack adult birds as well as the eggs and chicks of blackpoll warblers. Hawks , owls , snakes , and cats eat adult blackpoll warblers. Blue j ays are known to prey on the chicks and eggs of these songbirds. These birds are categorized as Near Threatened . Their numbers are decreasing due to habitat loss. They are slowly losing their breeding ground made up of forests and shrublands. In the spring, these birds lay from three to five white or pale green eggs with brown spots. The incubation period is 11 to 12 days. The baby birds or chicks, begin molting at around 10 days old. These young birds usually leave the nest at 11 or 12 days old before the molting process is finished. Some blackpoll warblers have two clutches of eggs each spring. According to IUCN , this bird’s conservation status is Near Threatened. Their population is 59,000,000, though it’s reportedly in decline.",
        "score": 0.75703096
    },
    {
        "Name": "Swainsons Hawk 2",
        "Genus": "Buteo",
        "Diet": "Carnivore that eats small mammals, reptiles, and large insects",
        "Behavior": "They can be characterized as social.",
        "Features": "White wing linings",
        "Fun_Fact": "Their wings form a “V” shape when flying.",
        "Text": "“ Swainson’s hawks are long-distance migrants, and almost the entire population moves from North America to South America during August and September. ” The Swainson’s hawk ( Buteo swainsoni) is a medium-sized raptor native to North and South America. They live in open areas with scattered thickets of trees, like grasslands and prairies. They spend their days soaring low to the ground or perched on fence posts and utility poles, searching for prey. These long-distance migrants make an arduous journey from Canada and the Northern United States to Argentina each year. Learn everything there is to know about this bird of prey, including where they live, what they eat, and how they behave. Swainson’s hawks live in North and South America in 19 countries, including Canada, the United States , Mexico, Costa Rica, and Argentina. They are long-distance migrants who move from North America to South America during late summer. They inhabit open areas like grasslands, savannas, plains, farmlands, and cultivated lands. This bird only requires a small thicket of trees for nesting. Look for them soaring in flocks, perched on posts, or scattered on the ground, looking for food. They nest in prairie regions with scattered trees, where they typically place their nests well-hidden by vegetation. Occasionally, they nest on old magpie nests, cliffs, ledges, steep slopes, or tall shrubs. They construct a platform of sticks and leafy green branches and line the inside with weeds. The Swainson’s hawk ( Buteo swainsoni) is from the Accipitriformes order in the Accipitridae family, encompassing small to large birds with strongly hooked bills. The Buteo genus includes wide-ranging raptors called “buzzards” or “hawks.” This species is monotypic, meaning there are no subspecies of the Swainson’s hawk. The Swainson’s hawk is a medium-sized raptor, measuring 17 to 22 inches long and weighing 1.1 to 3.7 pounds, with a 46 to 54-inch wingspan. They have slim bodies and long wings, which they hold in a “V” shape when soaring. They also have a hooked bill and a fan-shaped tail. And they have light undersides with reddish-brown breasts and brown or gray upper parts. Their flight feathers are black, and they have distinctive white wing linings. Males have gray heads, and females have brown heads. Some species are darker and can be reddish to almost all black. These birds are social, forming monogamous pair bonds and joining small groups outside the breeding season. You will often find them soaring in flocks or perched on fence posts and utility poles. Occasionally, they sit scattered on the ground. These hawks are not overly noisy but give a hoarse scream (“kreeee”) when perched or in flight. They soar on rising air currents with their tails and wings spread wide. Swainson’s hawks are long-distance migrants, and almost the entire population moves from North America to South America during August and September. They breed in the western half of the United States and Canada and migrate through Mexico, Central America , and Northern South America before reaching their wintering grounds in Argentina, Uruguay, and Southern Brazil. They travel a total of 12,000 miles during their journey. Swainson’s hawks are carnivores who hunt by soaring low over grasslands. Their diet consists of small mammals , reptiles, and large insects. They feed their young squirrels, gophers , small birds, mice, snakes, and lizards. They occasionally eat bats and carrion. In late summer, they rely heavily on grasshoppers and caterpillars. They hunt by perching and scanning the ground or soaring low over grasslands. They can also run on the ground, searching for insects. The IUCN lists the Swainson’s hawk as LC or “least concern.” Due to its extensive range and large, stable population, this species does not meet the “threatened” status thresholds. The biggest threat to this hawk is their loss of foraging and breeding grounds due to urbanization. They may also be susceptible to the future effects of climate change, such as spring heat waves and wildfires. Swainson’s hawks have very few natural predators, but their nests can become vulnerable to certain species, such as great horned owls, coyotes , golden eagles, and bobcats. These hawks are highly aggressive when defending their nests and typically have no problems driving off intruders and potential predators . These hawks are monogamous and form long-term pair bonds, and their courtship involves aerial displays. Females lay two to three dull white eggs and incubate them for 34 to 35 days, while they may bring food. Both parents assist in feeding their chicks, and young fledge the nest 42 to 44 days after hatching but may remain with their parents until the fall migration. This species reaches sexual maturity around two years and has an average lifespan of 10 years, but it can live over 24 years. The global Swainson’s hawk population is unknown, but they’ve had stable population trends in North America for the last 40 years. They are not experiencing any extreme fluctuations or fragmentations in their numbers. Sources:",
        "score": 0.75092757
    },
    {
        "Name": "Western Tanager",
        "Genus": "Piranga",
        "Diet": "Insectivore that eats bees, wasps, grasshoppers, ants, beetles, cicadas, stinkbugs, and termites and especially likes insects",
        "Behavior": "They can be characterized as mainly solitary pair.",
        "Features": "Contrasting black and yellow color",
        "Fun_Fact": "They migrate farther north than any other tanager.",
        "Text": "The western tanager migrates farther north than any other tanager. The western tanager is native to the Americas, wintering in Mexico and Central America before migrating to the Western United States and Canada. They spend their days on the tops of coniferous trees, searching for food and feeding their young. They may be challenging to spot due to their location, but listen closely for their hoarse robin-like songs and bright yellow and orange coloring. Learn everything there is to know about this beautiful bird , including where they live, what they eat, and how they behave. The western tanager lives in and migrates through at least 14 countries, such as Canada, the United States, Mexico, Nicaragua, and Costa Rica . You can find them in the western United States and northwestern Canada during the warmer months and in central to southern Mexico and Central America during the winter. They breed in open woodlands, primarily in Douglas-fir and Ponderosa-pine trees. You may occasionally find them in aspen forests, wetlands, forest edges, parks , gardens, and burns. During migration, they stop in a wide range of habitats, like urban areas , backyards, parks, forests, and woodlands. During the winder, also inhabit forests and woodlands. To find them, listen for their hoarse songs and chuckling calls. Look to the tops of the trees where they nest and forage; wait for their flashes of yellow and orange. Females build the nests by themselves, while males keep watch. The process takes four to five days, and females diligently scrutinize their potential nesting sites. She chooses a spot in an open canopy area, usually in a fir or pine tree on a horizontal branch away from the trunk. The nest foundation consists of twigs, weaved until they form a cup. And she lines the inside with soft materials like animal hair, feathers, grasses, and plant fiber. The western tanager (Piranga Ludoviciana) belongs to the Cardinalidae family, which includes Piranga tanagers, cardinals, grosbeaks, and buntings. Its genus Piranga is the cardinal bird family, and its specific epithet, Ludoviciana, is Late Latin for “Louisiana.” This species is monotypic, and no other subspecies exist. The western tanager is a medium-sized American songbird, measuring 6.3 to 7.5 inches long and weighing 0.8 to 1.3 ounces, with an 11.5-inch wingspan. They have stocky bodies with thick bills and medium-sized tails. Adult males are bright yellow with black wings and an orangish-red head. They also have white wingbars and black backs and tails. And females are an overall yellowish-green, while immatures have less red on their heads than adult males. Western tanagers are relatively solitary, except for when they form pair bonds. During winter, they may forage with other mixed-species flocks. They spend many days slowly moving along branches and shrubs, looking for food. But the males are vocal, especially during the breeding season. His songs are hoarse, short, and robin-like. These birds are also excellent, swift fliers with powerful wing beats. However, we don’t know their exact speed. Western tanagers are long-distance migrants who move alone or with small groups at night. They migrate farther north than any other tanager. They spend their springs and summers breeding on the west side of the United States ( Colorado , Wyoming, Idaho, Washington, etc.) and as far north as Northwest Canada near Yukon. They migrate through the Central US, parts of the West Coast, and Mexico before reaching their wintering grounds in Southern Mexico and Central America (Guatemala, Honduras, Nicaragua, and Costa Rica). Some also winter in Southern California . Western tanagers are mainly insectivores who supplement their diet with fruits and berries. They primarily eat insects, such as bees, wasps, grasshoppers , ants, beetles, cicadas, stinkbugs, and termites. During the fall and winter, when insects are no longer abundant, they will eat wild cherries, elderberries, mulberries, blackberries, buds, and seeds. They spend much of their time picking food from branches and foliage in shrubs or at the tops of trees. They will also fly out and grab flying insects like dragonflies and will clip the insect’s wings before swallowing. The IUCN lists the western tanager as LC or “least concern.” Due to its extensive range and large, increasing population, this species does not meet the thresholds for “threatened” status. While they are not experiencing any significant ongoing threats, they are still vulnerable to the effects of climate change . Spring heat waves and wildfires could endanger their habitats and young in the future. Hawks, owls , and jays are known predators of adult western tanagers. Their nests are vulnerable to owls, jays, snakes, black bears , crows, ravens, and squirrels. They make loud calls, flap their wings, and swoop toward intruders to defend themselves and their nests. Western tanagers are monogamous breeders who perform courting displays, such as chasing each other. Males defend their nesting territory by constant singing, and the two rarely leave each other’s sides. The breeding season runs from mid-April to mid-August, and females lay 3–5 bluish-green eggs with brown markings. Females incubate for 13 days, while the males bring food. But both parents share the feeding duties of their nestlings. The young leave the nest around two weeks after hatching and undergo a pre-juvenile molt shortly after fledging. These tanagers reach sexual maturity at around one year and can live up to 15 years, but live to an average of 8 years. The global population of the western tanager is unknown, but their numbers appear to be stable. Their species has increased slightly over the last 49 years in North America and doesn’t appear to suffer from extreme fluctuations or fragmentations.",
        "score": 0.7432021
    },
    {
        "Name": "Mexican Eagle Northern Crested Caracara",
        "Genus": "Caracara",
        "Diet": "Carnivore that eats rabbits, squirrels, skunks, frogs, lizards, snakes, turtles, fish, insects, birds, and alligators",
        "Features": "The multi-colored beak",
        "Fun_Fact": "The northern crested caracara mates for life with its partner",
        "Text": "The northern crested caracara will sometimes steal food from other birds. The northern crested caracara, also known as the Mexican eagle, is among the most common birds of prey in all of Central America. It is often considered to be its own separate species, but some taxonomists still classify it as a subspecies of the crested caracara. The popular name Mexican eagle is actually a misnomer. This bird is not an eagle at all; it belongs to the falcon family. The closest living relatives include the black caracara, black-throated caracara, and other caracaras. The northern crested caracara is endemic to a huge stretch of territory between the southern United States (mostly Florida , Arizona , and Texas ) and northwestern Brazil , but it is most commonly associated with Mexico and Central America . Its closest related sibling, the southern crested caracara, can also be found from northern Brazil down to the tip of Argentina . These birds prefer to live in semi-open habitats with enough cover for nesting. Nesting sites are usually established at the top of tall shrubs or trees, up to 50 feet above the ground. Live oak, acacias, and even giant cactuses can all become a home for the caracara. The nests are usually constructed out of sticks, weed, and other random debris. They are typically reused from year to year. The scientific name of the northern crested caracara is Caracara cheriway. Caracara is a Spanish and Portuguese word that originally came from the indigenous Tupi language of Brazil. It is probably an imitation of the bird’s call. Cheriway is thought to be the native word for the crested caracara among people from Venezuela . The northern and southern crested caracaras are the only living members of their genus. Together they belong to the falcon family. The main difference between caracaras and other falcons is their more solitary, sedentary lifestyle. They are also slower flyers. The crested caracara is a fairly large bird, measuring up to 26 inches long with a wingspan of around 4 feet. The unique plumage is quite striking: the dark brown lower body and outer wings transitions to a combination of buff white feathers and dark brown bars along the chest. The cheek and neck feathers are mostly buff white with minimal brown. However, the crown at the top of the head, which can be erected into a crest, is covered in solid brown plumage. The beak is an unusual combination of an orange base and light blue tip. The bird also features alternating bands of brown and white tail feathers. Both sexes are similar in appearance, but the juveniles have duller plumage. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The northern crested caracara spends a lot of time flying low in the air, searching for prey on the ground below. They start flying early in the morning and occasionally come down to the ground to hunt. One of their favorite strategies is to follow the winding path of the highway for potential road kills. Crested caracaras are mostly solitary hunters, but they do spend the breeding season with a mate. They communicate with each other through alarm and mating calls. The northern crested caracara is considered to be an obligate carnivore, meaning they must eat meat to survive (although there are some scattered reports that they do consume fruit as well). They are highly aggressive when on the hunt, even chasing away vultures from their kills. It is considered to be an apex predator . The northern crested caracara has a diverse diet that includes rabbits , squirrels , skunks , frogs , lizards , snake , turtles , fish , large insects , other birds and their eggs, and even young alligators . It does not care whether the prey is found dead or alive. It will feed on almost any kind of meat it can find. They will sometimes run along the ground to capture their prey. According to the IUCN Redlist , the crested caracara is a species of least concern . This means population numbers are quite healthy and it requires no special conservation efforts. In some places, however, it does appear to be threatened with habitat loss, road accidents, and low reproductive rates. This bird has disappeared from some parts of its range in the United States. That is why it has a disconnected population in Florida. An adult caracara has few predators in the wild and therefore enjoys a long, healthy lifespan. Eggs and juveniles are more vulnerable to raccoons , crows , and other birds of prey, but they are usually well protected by the parents. The northern crested caracara forms lifelong monogamous pair bonds that mostly last until one partner dies. Courtship usually involves an elaborate ritual in which they toss their heads back and give a guttural call. After pairing up, they will continue to reinforce their bond over the years with mutual preening and care. The breeding season takes place every year between January and March. Together they produce a clutch of two or three eggs, rarely four, at a time. Both parents take turns incubating the eggs for the first 30 days. After the chicks hatch, then parents will continue to bring food back to the nest. It takes about six to eight weeks for the chicks to start flying, but they may remain with the parents for another few weeks. The typical lifespan in the wild is somewhere around 26 years old. It’s difficult to estimate the true population size, but the conservation organization Partners in Flight suggests a combined population for both the northern and southern crested caracara of 2 million. Numbers appear to be increasing overall, but they have declined in parts of the United States. Even though it’s listed as least concern overall, the crested caracara is currently classified on the US endangered species list.",
        "score": 0.7387123
    },
    {
        "Name": "Robin",
        "Diet": "Omnivore that enjoys worms and especially likes insects, fruit, berries",
        "Fun_Fact": "The robin can migrate up to 3,000 miles to its wintering grounds",
        "Text": "The robin is one of the most common songbirds and a staple of the American ecosystem. Its rich and beautiful songs are often a harbinger of the arrival of spring. There are several different species of robin. The two most common are the American robin and the European robin. Unless otherwise indicated, this article will tend to discuss the American robin first. The American Robin ( Turdus migratorius ) is a migratory songbird of the true thrush genus and Turdidae, the wider thrush family. It is named after the European Robin because of its reddish-orange breast, though the two species are not closely related. The American Robin is widely distributed throughout North America, from southern Canada to central Mexico, and is the state bird of Connecticut, Michigan, and Wisconsin. Its evolutionary origins and relationship to other species in the Turdidae family are not well understood, but it is believed to have evolved in North America and diverged from a common ancestor with other members of the genus Turdus. Lower Classifications of Robins: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The American robin is a bird that is endemic to the entire North American continent. The European robin, by contrast, has a massive range across all of Europe and parts of Asia and North Africa . It inhabits almost any ecosystem, like woodlands, fields, and gardens, with short grass for foraging and some scattered trees for nesting. These birds construct a cup-shaped nest out of coarse grass and twigs all woven together. Mud, moss, feathers, and finer grass line the interior to provide a soft cushion. The nest is usually located 5 to 15 feet above the ground in dense shrubs or trees. They have adapted very well to human habitats and sometimes construct a nest in garages, houses, and other buildings. The scientific name of the American robin is Turdus migratorius . Turdus is the Latin name for the thrush (to which it’s closely related), while migratorious is obviously the Latin name for migration. A member of the thrush family Turdidae (along with bluebirds and solitaries), the American robin is only distantly related to the European robin, which belongs to the family of Old Word flycatchers known as Muscicapidae. The scientific name of the European robin is Erithacus rubecula . Erithacus is the Ancient Greek term for the robin. Rubecula appears to be a Latin name derived from ruber for red. Although the American and European robins are only distantly related, the original American colonists named the American robin after its European counterpart due to the somewhat similar appearance, particularly the bright red or orange markings on the breast. The main difference is that the American species have darker feathers around the back and an upright posture, while the European robin has light brown, gray, or white feathers and a more rounded body. The American robin is also the larger of the two. It measures up to 11 inches long with a wingspan of up to 16 inches. The European robin is about 5 inches long with an 8 to 9-inch wingspan. The American robin is a social species that gather in large flocks at night and on their winter grounds. The flocks break up during the day to search for food. The bird is generally friendly toward other members of its species. The only time it becomes more territorial is in the breeding season. As a songbird, they can often be heard chirping from a high perch to attract mates, warn of the presence of predators, and in general communicate with each other. Their song behavior appears to be changing in response to human society, however. The chirping now begins earlier in the day and operates at a higher pitch than in the past. The American species completes a yearly migration in which it travels as far south as Mexico and Central America for the winter and then returns to the north for the spring. Those birds residing in Alaska and northern Canada for the breeding season have the farthest to travel in the winter, sometimes as far as 3,000 miles per trip, while those in the central and southern United States don’t travel too far from their breeding grounds. The European bird, meanwhile, migrates to Southern Europe , North Africa , and even parts of Asia for the winter. The Scandinavian and Russian species migrate to the more temperate areas of Britain . These birds play an important role in the ecosystem by keeping pests in check and dispersing undigested seeds throughout the environment. The bird’s diet consists of approximately 40% invertebrates (like grasshoppers , caterpillars , earthworms, and beetles ) and 60% fruits and berries. It tends to eat animals in the spring and summer and fruit more toward the autumn and winter. These birds fall victim in large numbers to predation and habitat loss. But according to the IUCN Red List, both the American and European robins are least concern , which means they require no special conservation efforts. Adult birds are most often preyed upon by domesticated cats , large snakes , and hawks. Eggs are also consumed by squirrels , snakes , bluejays , crows, ravens, and grackles. Whenever they’re out foraging, the bird always keeps an eye on nearby members of the flock for the presence of predators. If they cannot get away easily, then they may mob small predators to chase them off. The bird’s breeding season begins shortly after returning from the winter grounds in the spring and lasts until around July. These birds acquire a new mate every year and never form permanent or long-term bonds. This means the male must engage in an annual courtship process that involves a strutting display, singing, shaking, throat puffing, and fluffing their tail feathers. After finding and copulating with an appropriate mate, the female produces three to five light blue eggs per clutch and up to three clutches per season. The chicks emerge from the eggs after about two weeks of incubation. They are undeveloped and almost completely reliant on their parents. After about two weeks of life, the young chicks develop their flight feathers relatively quickly, though, at this early stage, they differ from their adult counterparts with spots on the breast and paler color. The chicks leave the nest right after the growth of their flight feathers. This quick development time is perhaps due to the upcoming autumn migratory route and due to the need to make way for a new clutch. Most American robins only live about two years on average, and a quarter of them won’t even survive the first summer of their lives. If they do develop into adults, however, the survival prospects improve significantly. The oldest recorded robin lived about 14 years in the wild. It is estimated that the American species’ population stands at about 310 million. The IUCN Red List also estimates up to 200 million mature European robins in the wild. In the 20th century, they were badly affected by the pesticide DDT, but numbers quickly recovered after the DDT ban in 1972. Both species appear to be on the rise today.",
        "score": 0.7354294
    },
    {
        "Name": "Pied Billed Grebe",
        "Genus": "Podilymbus",
        "Diet": "Omnivore that eats invertebrates, insects, fish, amphibians, crustaceans and especially likes aquatic",
        "Behavior": "They can be characterized as solitary.Their aggression level is low.",
        "Features": "Develop a black band on the bill during the summer",
        "Fun_Fact": "Chicks stay on the parents' backs until they learn to swim",
        "Text": "Known for their shy and reclusive behavior, pied-billed grebes belong to the grebe family Podicipedidae. These small, stocky water birds live in marshes, wetlands, and rivers throughout the Americas. They aren’t great fliers and frequently dive both to hunt and avoid threats, hence their common name, “hell-diver.” They migrate at night and tend to live alone or in mating pairs instead of flocks. You can find them throughout much of North and South America , although they are absent from the Amazon and the northernmost parts of Canada . Populations that live in areas where water freezes during the winter will migrate between breeding and non-breeding grounds depending on the season. In North America, migrating populations tend to breed during the summer throughout much of central Canada. They then migrate to winter feeding grounds in the southwestern United States , northwestern Mexico , and southern Latin America. Meanwhile, other populations live year-round in the southern and western United States, central Mexico, the Caribbean, and parts of northern and southern South America. Occasionally, pied-billed grebes may also show up as visitors in the United Kingdom , Hawaii , and the Galapagos Islands. They primarily make their homes in freshwater habitats such as marshes, wetlands, and slow-moving rivers. They prefer areas with plenty of aquatic vegetation present where they can hide and build their nests. That said, they may also frequent open waters, particularly outside of the breeding season. Additionally, you can sometimes find them in brackish water and made-made waterways. The pied-billed grebe belongs to the grebe family Podicipedidae, the sole family in the order Podicipediformes. Since the closely related Atitlan grebe went extinct in the late 1980s, pied-billed grebes now represent the sole extant member of the genus Podilymbus. The genus name derives from the Latin word podicipes, meaning “feet at the buttocks,” and the Greek kolymbos, meaning “diver.” Its common name refers to the colors on the short, chicken-like bill. During the winter, the bill looks predominantly silvery-gray, but during the summer, it is encircled by a thick black band. Hence the name “pied-billed,” from the Middle English word pied, short for “magpie,” in reference to its black and white colors, and now generally meaning multi or two-colored. Pied-billed grebes are small, stocky water birds with short necks. On average, they measure 12 to 15 inches long and weigh between 8.9 and 20 ounces. They typically sport a wingspan of 18 to 24 inches long. Females and males appear relatively similar and look primarily brown except for a dark back and crown. Unlike other grebes, they do not possess white features under the wings, although the feathers under the tail are white. Their common name derives from their short, thick bill, which looks silvery-gray in winter and features a black band in the summer during the mating season. Pied-billed grebes possess lobed rather than webbed feet, which aid them with swimming. However, their lobed feet make it difficult for them to walk on land. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Pied-billed grebes rarely fly and typically only do so at night when they migrate. They spend most of their time in the water and are excellent divers. When startled or hunting, they can dive up to 20 feet and stay submerged for up to 30 seconds. They also do not gather in flocks, instead living alone or in mated pairs. The evolution and history of pied-billed grebes and other grebes continue to challenge researchers to this day. Grebe fossil records are woefully incomplete, which makes it difficult to track their development over time. That said, most scientists believe that grebes have a fairly ancient evolutionary history. While some evidence suggests they may have emerged sometime during the Early or Late Cretaceous Period , more research is needed to prove this theory. True grebes emerged sometime during the Late Oligocene or Early Miocene, around 23 or 25 million years ago. Today, flamingos represent the closest relatives to grebes, as the two share a number of similar characteristics. Like other grebes, pied-billed grebes are primarily carnivorous. Aquatic invertebrates and insects make up the bulk of their diet, although they also eat small fish , crustaceans , and amphibians , such as frogs . They normally hunt by diving into the water to catch prey, and their strong, sharp bills can break through even the toughest of crustacean shells. While they are primarily carnivorous, they will also eat some aquatic vegetation. In addition, pied-billed grebes have been known to eat their own feathers. This habit likely helps to aid in their digestion and prevent potentially harmful bones and other prey parts from damaging their intestines. The feathers cling to these objects and allow the birds to regurgitate indigestible items as pellets easily. Several animals prey on pied-billed grebes. Their main predators include birds such as gulls, owls , eagles , falcons , and coots, and fish such as bass and pike . They also must contend with alligators , snapping turtles , and large snakes like cottonmouths . Young grebes and eggs also frequently fall prey to minks , ferrets , rats , and raccoons . To protect themselves, pied-billed grebes will dive into the water to depths up to 20 feet. They can remain underwater for up to 30 seconds until the danger passes. Moreover, their coloration serves as a form of camouflage that allows them to blend into their surroundings to avoid predators easily. Aside from predators, the major threat to pied-billed grebes comes from human activity. Habitat loss represents possibly the single greatest threat to the pied-billed grebe. When wetlands and marshes dry up or get drained for development, pied-billed grebes lose important breeding and feeding sites. They can also get easily disturbed by noise from boats or cars, which scare them away from their nests. These sounds and other activities can cause the birds to abandon their nests, thereby leaving their eggs vulnerable to damage or predation. During the summer mating season, pied-billed grebes court each other by using calls and singing duets. A male can act aggressively if another male enters his territory. When this happens, the two males will face off against each other and then turn their backs to issue threatening calls. Females typically lay between 3 and 10 eggs at a time and can lay two clutches per year. Both parents help to incubate the eggs and will take turns watching the eggs. When neither parent is present, they may cover the eggs with feathers, grass, or other soft material to hide the eggs from predators and keep them warm. The eggs incubate for approximately 23 days until the chicks hatch. Pied-billed grebe chicks cannot swim well when young, so they spend most of their time on their parents’ backs. They may even stay attached when the parents dive for food. After about 4 weeks, they begin to swim and hunt by themselves. Although pied-billed grebes can live for up to 10 years, most rarely live longer than 4 years. Overall, the pied-billed grebe population appears rather stable. However, populations in certain areas are on the decline for various reasons. For example, some stocks in the eastern half of the United States show signs of distress. Pied-billed grebes have practically disappeared from Rhode Island and are considered endangered in Connecticut and New Hampshire . Although they receive protections under the Migratory Bird Treaty Act of 1918, pied-billed grebes continue to lose breeding and feeding grounds in the densely populated areas of the northeast. Still, these pockets represent the extreme end of the spectrum, and most populations remain in good standing. As a result, the IUCN lists the pied-billed grebe as a species of Least Concern .",
        "score": 0.73410875
    },
    {
        "Name": "Sparrow",
        "Diet": "Omnivore that especially likes insects, seeds, berries",
        "Fun_Fact": "There are more sparrows in the world than people.",
        "Text": "“No matter where on Earth you live, sparrows likely visit your backyard.” Sparrows are a common sight the world over. Eurasian house sparrows and tree sparrows are among the most common. Not only do they occupy a large natural range, but they’ve invaded several continents as settlers took the birds with them. These birds have adapted well to living near people, from cities to farm fields. These birds have been symbols in songs, pets, and food sources. You can learn more about this small bird that has played a role in human lives throughout history. Old World species are native to Africa , Asia , and Europe , but they have been naturalized in the Americas and Australia . New World sparrows live in the Americas. The bird’s natural habitat is that of open woodlands, fields, grasslands, scrubland, and deserts. They have adapted well to life around humans, and they can be found in cities and neighborhoods in large numbers. If you want to view These birds, you are certain to attract them with a backyard bird feeder. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Most of these birds are classed as Old World or New World sparrows. The Old World species are also called “true sparrows.” They make up eight genera in the family Passeridae, superfamily Passeroidae, infraorder Passerida, suborder Passeri, order Passeriformes, class Aves (birds), phylum Chordata, and kingdom Animalia. The 43 species of Old World sparrows with their scientific names include: There are around 138 species of New World sparrows divided into 29 genera. These birds are more closely related to Old World finches than to Old World sparrows. The chipping, white-throated, and field sparrows are examples of New World sparrows. Other sparrows include the Java (scientific name Lonchura oryzivora) and Timor sparrows ( L. fuscata) of the family Estrilididae and the dunnock or hedge accentor (Prunella modularis) of the family Prunelidae. It is hard to account for the history of house sparrows because they are so ubiquitous. We have a tendency to overlook commonplace creatures, and even scientists would rather study rare species than those that are common. The story of the relationship between sparrows and humans is ancient and incomplete, much like our own history. As a result, it is difficult to tell the story of the house sparrow accurately. Evidence of the house sparrow first appears in Africa, and two jawbones belonging to a bird called Passer predomesticus were found in Israel in sediment more than 100,000 years old. After this, other birds similar to the modern house sparrow began appearing in the fossil record approximately 10,000 or 20,000 years ago. These birds had distinct features on their mandibles, like a crest of bone where there had been only a furrow before. As humans spread agriculture across the world, house sparrows spread with them and evolved to adapt to the different regions. This caused sparrows around the globe to all originate from one single line of descent. House sparrows have continued to evolve as humans have taken them to different environments, leading scientists to classify them into subspecies and even species. An example of this is when house sparrows met with Spanish sparrows in parts of Italy, forming a hybrid species called the Italian sparrow. These are small brown and gray birds with conical or cone-shaped beaks. Some, like the red-headed chipping and white-throated sparrows, have distinctive markings on their heads. Others, like the song sparrow, are blotched in brown and cream. Finches, such as the red-headed house finch , are often mistaken for sparrows. The smallest is the chestnut sparrow. It is 4.5 inches (11.4) long and weighs less than half an ounce (13.4g). The largest is the parrot-billed sparrow, which weighs in at 1.5 oz (42g) and has a length of 7.1 inches (18 cm). These birds forage in small to large flocks. Many species may be present in a single flock. This changes at mating time, when the flock is limited to just one type of sparrow. Abundant varieties include song, chipping, white-throated, and red-headed sparrows. A unique behavior of these birds is dust bathing. The bird scratches a hole in the ground with its feet, settles into it, and flings dust onto its body using its wings. They also like to bathe in puddles. Many types of sparrows survive cold or inclement weather by retreating into the eaves of buildings, tree cavities, or even behind sections of loose tree bark. Others, such as the American tree sparrows, migrate south to find warmer weather. Sparrows are small, brown birds that migrate seasonally. During their migration, sparrows travel in large groups and fly from one place to another to find food or a more suitable climate for nesting. Sparrows usually migrate during the fall months when temperatures start to drop and food sources become scarce. They can be seen flying in tight formations as they make their way southward. This helps them stay together as a group and also provides protection against predators such as hawks. Some sparrows will even take breaks along the way at stopover sites where they can rest before continuing on with their journey. It is estimated that some species of sparrows have traveled over 10,000 miles during their migrations! These birds are opportunistic feeders. Sparrows mainly eat seeds and grains, but they will also supplement their diet with insects, fruits, and other small animals such as spiders or snails. Sparrows typically hunt for food by hopping along the ground, looking for insects to eat, or searching trees and shrubs for berries or seeds. They may also scavenge around human dwellings looking for crumbs that have been left behind. To get a better view of their surroundings while hunting, sparrows often perch atop branches or telephone wires. Hawks , owls , and cats commonly hunt adult birds. Young flightless birds and unhatched eggs are preyed upon by raccoons and snakes . Crows, jays, and grackles may also eat the eggs. In some parts of the world, people eat these birds. People have also been a threat to sparrows through intentional and unintentional agricultural poisoning. Birds of prey, cats, snakes, and sometimes people are their predators. Sparrows are social and colonial in their habits, meaning they live in large groups or flocks. These groups have been known to include up to 10,000 individuals. The exception is the great spa., which prefers small family groups and breeds only in pairs. These birds often nest on buildings, finding protected areas to build a nest and lay 4 to 5 eggs. Eggs hatch after 10 to 14 days. Both parents feed the babies, and each baby leaves the nest in about two weeks. In many species, these birds mate for life and continue to use the same nest site, clutch after clutch, baby after baby. If a sparrow’s mate dies, it typically finds a new one within a few days. The house sp. is thought to be the most abundant bird in the world, with an estimated population of 1.6 billion individuals. When combined with nearly 200 additional species, there are no doubt many more of these birds than humans in the world! Some species of sparrows are in decline due to habitat loss. For example, the chipping sparrow, savannah sparrow, song sparrow, vesper sparrow, field sparrow, and Italian sparrow are all in cecline. You can see the full list here .",
        "score": 0.73126805
    },
    {
        "Name": "Black Capped Chickadee",
        "Genus": "Poecile",
        "Text": "The Black-Capped Chickadee is a popular and easily recognizable North American songbird. These birds travel together in small flocks, using their calls to signal where food can be found, the presence of danger, and “all clear” signals. Many other small songbirds, such as warblers , nuthatches , and titmice, travel with chickadees in order to benefit from their vigilance and warnings. Chickadees are considered to be friendly birds, getting along well with other small songbirds and showing little fear of humans. Black-Capped Chickadees are native to North America . Their range stretches north to Alaska and Canada, south to New Mexico , west to California , and east to New York . Since Black-Capped Chickadees do not migrate, they can be observed in these areas during winter, spring, summer, and fall. The best place to view these birds is at a backyard bird feeder. They can also be seen flitting between tree branches or shrubbery. Black-Capped Chickadees nest in tree hollows or birdhouses with small openings, located 1 to 10 feet off the ground. They build the cup-shaped nest from loosely woven feathers, moss, grasses, and other plant fibers. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Black-capped Chickadee is classified under the Latin name Parus atricapillus in most reference guides. This name was given in 1760. Occasionally, the alternate scientific name Poecile atricapillus appears, assigning the bird to a different genus. This alteration in relationships to other, similar birds has been proposed due to DNA research. Either way, it is recognized by the shortened form P. atricapillus. It belongs to the class Aves (birds), the order Passeriformes, and the family Paridae. The Black-Capped Chickadee is a small bird, weighing less than half an ounce. It is less than 6 inches in length and has a wingspan of 6 to 8 inches. The Black-Capped Chickadee is named for its striking color pattern. It has a black head and neck, with white patches on the sides of the face. Its back, wings, and tail are gray with black and white markings. Its belly is white with reddish-brown patches near the wings. Males and females display the same markings. Black-Capped Chickadees are social birds, often seen in male/female pairs or small flocks of up to 12 individuals. They may travel with small birds of other species as well. Chickadees are highly communicative. While foraging together, they concentrate their efforts in locations where one flock member has found success. They also look out for dangers, such as predators. When a potential threat is spotted, the bird utters a warning call. Its companions freeze and imitate the call, which may confuse the predator. When the danger has passed, the birds utter an “all clear” call. Chickadees do not migrate. Black-capped chickadees forage in small groups for insects , insect eggs and larvae, berries, and seeds. They frequent manmade seed feeders as well. Hawks , owls , and cats are common hunters of chickadees. Snakes and raccoons may eat chickadee eggs. The biggest threats to chickadees come from people. We use pesticides that may poison them through biomagnification. We have taken their habitat and built cities on it. It is estimated that the United States can only support large songbird populations because so many people maintain seed feeders. The Black-Capped Chickadee is not an endangered species. It is listed as an animal of Least Concern by the International Union for Conservation of Nature (IUCN), Red List of Threatened Species. Black-Capped Chickadees lay 5 to 10 eggs each spring. The eggs hatch after 11 to 13 days of incubation. The young birds molt in less than 2 weeks and leave the nest 14 to 18 days after hatching. In the wild, chickadees usually live less than 3 years. The oldest known chickadee was a male who lived 11.5 years. The Black-Capped Chickadee population is estimated at 41 million individuals, with regional population increases over the past few years.",
        "Diet": "Omnivore that eats insects and enjoys berries, and seeds",
        "Behavior": "They can be characterized as sociable flock.",
        "Features": "Striking color pattern",
        "Fun_Fact": "Black-capped chickadees weigh less than half an ounce!",
        "score": 0.73062205
    },
    {
        "Name": "Rufous Hummingbird",
        "Genus": "Selasphorus",
        "Diet": "Omnivore that eats some insects and enjoys red flowers",
        "Behavior": "They usually live in pairs and can be characterized as solitary.Their aggression level is medium.",
        "Features": "Reddish-orange coloring.",
        "Fun_Fact": "The males have a glowing iridescent orange patch on their chests.",
        "Text": "This hummingbird has brilliant coloring and can travel from Alaska to Mexico in one migration. As one of nine species of hummingbirds in its genus, the Rufous hummingbird is named for the reddish-orange coloring that most males have on their heads and chests. They favor red-colored flowers but also eat insects. Learn more about these fascinating birds . The Rufous hummingbird is native to North America , from Alaska to Mexico. They breed in Alaska and the Western parts of Canada and the United States during the spring and summer. They take advantage of native wildflowers in these regions as a reliable source of food. For the winter, they travel almost 4,000 miles to migrate to parts of Mexico. They need a warm climate to survive and cannot overwinter in the northern parts of the continent. This little hummingbird is known by the scientific name Selasphorus rufus . It is one species within the Selasphorus genus. There are nine species within the genus, which was established in 1832. The Rufous hummingbird is the type species. Previously, it was placed in the Trochilus genus along with other hummingbirds when it was discovered and described in 1788. The Rufous hummingbird is part of the Trochilidae family. It includes all hummingbirds, around 360 species in total. Hummingbirds are recognized by their ability to hover and feed on nectar, although they also eat insects . They were given the name hummingbird due to the humming sound that their fast-beating wings make when they hover. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Hummingbirds belong to the Apodiformes order of birds, which also includes Swifts and Treeswifts. It is one of the most diverse orders of birds and has more than 450 species. They are part of the Aves class, which includes all birds. Birds are characterized by the presence of feathers, toothless beaks, a heart with four chambers, a high metabolism, and a lightweight skeleton. All birds also lay eggs to reproduce. Hummingbirds are part of the Chordata phylum and Animalia kingdom. While the Rufous hummingbirds are native to North America, they are part of a larger species of hummingbirds that began in Europe around 42 million years ago, when they began to diverge from their closest living relatives, the swift. The oldest known fossil is from southeast Germany, around 30 million to 35 million years ago. However, this species became extinct in Europe, it is still unknown how or why, and eventually migrated to North America and South America. The hummingbird of today evolved in the Americas about 22 million years ago. The Rufous hummingbird is in a genus that includes eight other species. This genus, Selasphorus , has the following hummingbirds: These tiny hummingbirds are around three inches long. They are not the smallest of all hummingbirds but do represent a good example of these interesting animals. The males are brightly colored, with a reddish-orange face. This gave them their name, Rufous, based on this coloring. They have white breasts and an iridescent orange patch on their throat. In fact, the Audubon Society Guide to North American Birds describes it as “glowing like a copper penny.” This helps bird watchers spot Rufous Hummingbirds easier, although this coloring is unique to the males. Some males also have green coloring on their backs or at the crown of their heads. Females more often have green coloring and are slightly larger than the males. They look similar to the Allen’s hummingbird, which also lives in many of the same places. Like other species of hummingbirds, the Rufous hummingbird eats nectar from flowers. It uses a long proboscis and tongue to access the nectar buried deep in the flower’s structure. It also eats insects that it catches on its wings. They tend to feed on red flowers , including penstemons, red columbines, paintbrush, scarlet sage, and gilia. When feeding, the Rufous hummingbird hovers in mid-air using its wings. They use downstrokes to generate lift at a greater rate than upstrokes. When feeding on sugar substances at hummingbird feeders, they do perch when given the chance. This helps them conserve energy, although they do not perch for long periods of time. Because they are small, Rufous hummingbirds can be prey for other larger birds and animals. Snakes in particular are quick to make a meal out of an unsuspecting Rufous hummingbird. Other threats include changes to their habitat and food sources. Pesticides can impact the availability of insects that make up a critical part of their diet. They are not picky when it comes to the type of insects that they eat, although there does need to be a ready supply. Early blooming of their flower food source can also make it hard for them to get enough to eat. They migrate and if the flowers have already bloomed by the time they get to their destination, Rufous Hummingbirds are not able to get the nectar inside. Like all other birds, the Rufous hummingbird lays eggs . The females build nests in trees and shrubs that are protected and hidden from predators. She uses moss to help the nest blend in better. They can also use old nests and refurbish them with additional grass, moss, and plant matter to make it sturdy and soft. The males will mate with more than one female, who then looks after the eggs until they hatch. This typically takes around two weeks. The females feed the young hummingbirds, who eventually leave the nest and fly around three weeks old. They typically stay around the Pacific Northwest when breeding, including Oregon , Washington , and Canada. They can travel as far north as Alaska, although they are less common in this area. Scientists are watching the Rufous Hummingbird population, which has been declining in recent years. While not listed as endangered, the International Union for Conservation of Nature did upgrade it to Near Threatened in 2018 based on population numbers and observations. The Nature Conservancy Canada estimates that its numbers have declined by as much as 60% since data was collected in the mid-1960s. The change in climate and temperature are thought to be the biggest threats to this hummingbird. As migratory birds , they rely on the seasons to dictate not only their nesting habits but also make their food sources available. If these change, it can have long-term effects on the Rufous Hummingbird population. Allen’s Hummingbird : This hummingbird, known by its scientific name Selasphorus sasin , is closely related to the Rufous Hummingbird and has similar coloring. It tends to stay near California , however, and has a more limited geographic range. Ruby-throated Hummingbird : The Archilochus colubris has a brighter patch of ruby-colored feathers at its throat, which makes it easy to spot. It lives in similar climates to the Rufous Hummingbird but also goes to the Eastern United States to breed.",
        "score": 0.7287852
    },
    {
        "Name": "Parakeet",
        "Diet": "Omnivore that eats insects, sometimes",
        "Behavior": "They usually live in swarms.",
        "Features": "Their feathers, which come in many bright colors",
        "Fun_Fact": "Monk parakeets are the only parakeets that actually build nests. They’re also the only parakeets to nest in great colonies.",
        "Text": "The little Parakeet has delighted people with their intelligence, playfulness, and their plumage of fancy colors for hundreds of years. Not only that, they are easy to care for and low cost. You can check out more incredible facts about parakeets . Besides the plain old local pet store , budgerigars are found in the drier habitats of Australia , while rose-ringed parakeets are found in cities and have indeed become invasive in cities such as London. These birds are also found in grasslands, farmland, forests, and wet places such as bogs and swamps. Besides Australia, they are native to South America and Asia . The now extinct Carolina parakeet with lovely green, yellow and orange plumage was one of the rare species native to the United States . These birds belong to the family Psittacidae, which also includes Old World parrots, New World parrots such as macaws , extinct birds such as the Carolina parakeet, caiques, and parrotlets. Some of them belong to the Arinae subfamily, including the golden-plumed -, the Carolina -, the golden -, small, long-tailed parakeets including the sun -, the golden-capped -, and the nanday parakeet. The family and subfamilies are further divided into many genera. The common budgie belongs to the Melopsittacus genera. The green-cheeked parakeet belongs to the Pyrrhura genus along with Todd’s -, the blue-throated -, and the blaze-winged parakeet. The rose-ringed parakeet is a member of the Psittacula genus along with the Mauritius -, Newton’s -, and the plum-headed parakeet. These birds are basically small to medium-sized parrots. They are lithe, have long tails, and are mostly granivores. Their plumage is far from plain and often brilliantly colored in shades of green, blue, yellow, or orange. Some species have been bred to have fancy and unusual colorations, such as albino. An albino is not just a white bird but a bird that lacks the normal amount of pigmentation and often has pink eyes. Budgerigar males and females can be told apart by the color of the cere, which is the fleshy patch at the top of the upper bill. The female’s is tan, and the male’s is blue. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . These birds are famous for being gregarious, affectionate, monogamous, and playful. They can form flocks of hundreds of thousands of birds that fly from their roosting areas to places where food is abundant. Many wild birds are not at all shy around humans and will perch on a human’s head or readily take food from their hands. They are also known for producing a great variety of sounds, though they are surprisingly quiet when they are feeding. However, when they’re roosting or flying parakeets can be noisy and produce sounds such as squawks, screams, whistles, wheezes, chuckles, chirps, and chattering. Budgies are able to imitate human speech. These birds are granivores, which means they mostly eat seeds. They’ll also take fruits and nuts, flowers, and the occasional insect and insect larvae. On the other hand, sometimes flocks of birds can strip farmlands of crop seeds such as corn or wheat. These birds have surprisingly few predators. Biologists believe the reason for this is that they fly and congregate in such large flocks that predators are either confused or scared away when a bird sees them and makes an alarm call. However, they are subject to diseases and parasites. Pet birds that are carelessly bred can inherit genetic disorders, and if they are not well cared for, the lifespan of a captive bird can be diminished. This is sometimes seen in neglected green-cheeked parakeets. These birds can live 30 years in the wild, but their lifespan in captivity is sometimes as short as 10 years. With the exception of the monk parakeet, these birds don’t construct their own nests but use a nesting box, nests that were once used by other animals, or lay their eggs in tree cavities. Monk parakeets build a complex communal nest that acts very much like an apartment building, with each pair having its own apartment with rooms for different functions. Most species are monogamous. Females lay between three and eight eggs per clutch. In some species such as the budgie , the female exclusively incubates the eggs while the male feeds her. In other species such as the green-cheeked parakeet, the parents take turns. Pet birds happily use a nesting box. A baby is plain and helpless at first and must be cared for by its parents. It can take about two months for the baby to fledge, and it can take as long as two years for it to become independent, depending on the species. The population of these birds is in the millions. The population of Melopsittacus undulatus alone is said to be 5 million birds. But the population also depends on the species. The Carolina parakeet is now extinct , and the Malherbe’s parakeet, which is found only in New Zealand , is critically endangered . There are only about 1000 of these birds left in the wild.",
        "score": 0.7274711
    },
    {
        "Name": "Annas Hummingbird",
        "Genus": "Calypte",
        "Diet": "Omnivore that eats tiny spiders and insects and enjoys nectar",
        "Origin": "Pacific Coast",
        "Behavior": "They can be characterized as solitary. Their temperament can be characterized as solidary.Their aggression level is medium.",
        "Features": "Rosy Red Crown",
        "Fun_Fact": "Anna's Hummingbird wings beat 40-50 times per second during normal flight",
        "Text": "Anna’s Hummingbird’s tiny legs neither help them walk nor hop. Instead, they’re utilized for scooting side to side when perched. Anna’s Hummingbird is one of three species that are permanent residents of Canada and the United States . They are considered the fastest and some of the largest of all Hummingbirds . With a growing population and ever-increasing non-breeding range, Anna’s Hummingbird can be found from Canada to Mexico . You will mainly find Anna’s Hummingbird along the Pacific Coast, which includes California and Oregon , where they breed; however, they also reside as far south as New Mexico . They change their location with the season and will move to a higher altitude during the summer months, and lower elevations during winter. Suppose you want to catch a glimpse of this speedy bird. In that case, it’s as simple as supplying sugar water in hummingbird feeders or providing flowers , such as Azaleas and Honeysuckle , that will provide the nectar they need. They will often nest in trees or shrubs and can often be seen in gardens, parks , and backyards. The diameter of Anna’s Hummingbird nest is approximately the size of a ping-pong ball. The female will construct the nest around her while sitting on a tree branch high off the ground. Her construction materials usually include spider webs, small feathers, leaves, and vines. Additionally, the female will embellish the outside of the nest with moss or lichens which may have been confiscated from another nest. The scientific name of Anna’s hummingbird is Calypte anna . The word “Calypte” most likely is derived from the Ancient Greek Kaluptre meaning “Head-dress” or “Woman’s Veil.” Male Anna’s Hummingbirds have vibrant, red rose-colored iridescent gorget. In contrast, their body is mostly grey, their backs bronze and green. Their tail feathers are white-tipped, with a metallic green center and exterior tail feathers transitioning to black. Both juvenile males and females will share the same dull brown body with green and bronze backs. Once adolescent males reach sexual maturity, after a year, their feathers will shed their plumage and begin to display the vibrant colors they’re known for. Additionally, their crown may appear with dark shades of orange, pink, brown, and green. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Anna’s Hummingbirds are very territorial and will fiercely protect the area they feed and sleep. The threat of losing their resources emboldens their instincts and they’ll often be seen diving at anything which enters their territory. Between summer and winter, Anna’s Hummingbirds will migrate and today they have the northernmost year-round range of any Hummingbird. Additionally, they can slow their metabolism down significantly at night in comparison to their normal daily range; this ability allows them to live in cooler areas. You can easily find Anna’s Hummingbirds along the Pacific Coast in states like Oregon, California, and also New Mexico. They often reside in open woodlands, parks, and backyards; however, they can be found anywhere they can establish a safe territory with access to water or nectar-feeding plants. During the breeding season, they will change climates and move to higher altitudes, whereas in winter they’ll reside in lower elevations. The female will prefer wooded areas with trees such as oak and evergreens. The males will prefer a more open setting like a hillside or canyon. Despite being introduced in the nineteenth century, you can often find Anna’s Hummingbirds in Eucalyptus trees enjoying nectar from their vibrant flowers. The main source of food for hummingbirds is nectar from plants that flower such as gooseberry and eucalyptus, as well as sugar water from feeders and tree sap. They access the nectar by inserting their long and slender bill into the flower and using their tongue to extract the nectar. Surprisingly, they also feed on many small insects and spiders , such as leafhoppers and midges . Depending on the time of year, certain insects may be more abundant than others. Due to their small size, maneuverability, and speed, they can often avoid predators you’d think of like cats . However, birds such as Western Scrub-Jays and Curve-Billed Thrashers do pose a threat. In response to these predators, Anna’s Hummingbird has adapted and will now bombard the predator while quickly beating her wings rapidly and attacking their head and back. Another way to avoid potential predators is to feed from higher food sources such as flowers in trees or hanging feeders. With proven adaptability and a strong breeding population, there is little threat from humans or the destruction of their habitat. The male Anna’s Hummingbird performs remarkable aerial diving as part of their courtship and attempts to attract a female. While diving, they can reach speeds over 60 mph, and can abruptly stop and pull up to avoid colliding with the earth. Upon researching this feat it was found they endure the equivalent of more than ten times the force of gravity, more than any other known living thing on earth. The female Anna’s Hummingbird will raise the chicks alone, and will only come together with a male to mate. The mating season begins in November and lasts until May, during which time the female can produce up to two broods. Each brood usually consists of two eggs, which she will produce a day apart. The female will incubate the eggs for two to three weeks before they hatch, and continue to feed and care for them for another three to four weeks. Chicks will have all their down feathers within their first week and will venture from the nest within a month. They will initially remain close to their mother, however, within two weeks they will be fully independent. The current estimated population for Anna’s Hummingbird is 1.5 million. Their numbers are steadily increasing and will continue to grow as their range also expands.",
        "score": 0.72630394
    },
    {
        "Name": "Northern Bobwhite",
        "Genus": "Colinus",
        "Diet": "Omnivore with no preference",
        "Behavior": "They usually live in flocks.",
        "Fun_Fact": "The northern bobwhite is named for its distinctive whistling call that sounds like ‘bob-white’.",
        "Text": "“The northern bobwhite is named for its distinctive whistling call that sounds like ‘bob-white’.” The northern bobwhite is also known as the Virginia quail or bobwhite quail. Unlike many other species of bird, the northern bobwhite does not migrate . They are found year-round throughout their native habitat in North America . There are some introduced (non-native) populations in other areas of the world as well. As a non-migratory bird species, the northern bobwhite only exists in year-round populations. They are native to the western hemisphere, specifically North America . However, because they are a common game animal and bird species, they have been introduced in other countries and continents throughout the world. Their largest population is in the United States , followed by Mexico . They are also found in Cuba and the surrounding islands. Northern bobwhites prefer open habitats. This is one reason they prefer the American Midwest and South. They are known to live in fields, grasslands, open pastures, and open forests. Although they will avoid mature forests due to the dense vegetation, they do prefer slightly wooded areas during the winter months, especially if snow is present, as it helps maintain their access to food sources. The primary habitat for bobwhites is patchwork locations that feature several different types of open habitats in one location, such as agricultural fields neighboring grasslands and open forests. If you’re looking for the northern bobwhite in these areas, it can be difficult to spot them. This is because their plumage and the patterns they sport are designed to help them camouflage in their natural habitats. However, you may be able to identify them by their tell-tale cry of “bob-white” or their nests. Northern bobwhites can fly, although rather poorly and only for a short distance. They spend the majority of their life on the ground and, as a result, will also build their nests on the ground. They may occasionally venture out to build their nests in low vegetation, but this is not as common. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Both the male and female northern bobwhite will work together to choose a nesting location. These nests, whether on the ground or in low vegetation, are typically close to an open field or even road. Not only do both males and females work together to identify the right nesting location, but they will also work together to create the nest itself. The individuals will dig a small hole in the ground. This is usually around two inches deep and six inches wide. The inside of the nest is lined with grass. Sometimes, this species will also use grass and other types of vegetation to weave an arch to fully hide the nest. The entire nest-building process takes around 5 days. The scientific name of the northern bobwhite is Colinus virginianus . They are in the Class Aves and the Order Galliformes . The Family is Odontophoridae , which includes all species of New World quail. There are 20 different subspecies of northern bobwhite divided into four different groups: the eastern group, Grayson’s group, the black-breasted group, and the masked group. Although there are many endangered species , such as the masked bobwhite (C. v. ridgwayi), there is only one extinct species. That is the Key West bobwhite ( C. v. insulanus ). The Virginia bobtail, or C. v. virginianus , is the nominate species and the most commonly referred to. The northern bobwhite is a small species of quail. They have rounded bodies and wings with small heads and short tails. Adults can grow to be between 9.4 and 11.0 inches in length. They can weigh 4.6 to 9.0 ounces, depending on the location and sex. Bobwhites in the south are smaller than those found further north. Their wingspans range between 13 to 15 inches. Northern bobwhites display what is known as sexual dimorphism. This means that males and females often look different. Males tend to have more vibrant, notable colors. Both sexes have brown, white, and black markings, however. Whereas the female sports brown and black markings on the face, males more often have white and black markings. Different subspecies will have different appearances, however. Females tend to have fewer differences between subspecies than males, which can be striking. For instance, a masked male will have an eye-catching black mask on their face rather than the Virginia subspecies’ brow stripe. The northern bobwhite does not migrate. They exist only in year-round populations where they can be found inside and outside the breeding season. However, there may be slight movement in individuals depending on the season. While they will not fully migrate to a different region, northern bobwhites in the Smoky Mountains may move between high and low elevations depending on the time of year. They often winter in lower elevations and breed in higher elevations. Northern bobwhites are omnivorous. This means that they will eat both plant and animal matter. While they eat both, however, the majority of their diet is made up of seeds and plants. Often, they will only eat animals during the breeding season. During the breeding season, females will eat a larger percentage of animal matter than males. Chicks also eat mainly animals, typically until they reach at least six weeks of age. These grassland game birds can also be seen eating at birdseed feeders. Bobwhites will feed as a group. Together, they will scratch through any decaying grasses and leaves, foraging on the ground for food. The majority of their diet is made up of plant materials. This includes fruits, seeds, and the plants themselves. Some of the most common vegetation parts of their diet include: During the summer and breeding season, bobwhites may supplement some of their diets with: One of the largest threats to the bobwhite is loss of habitat. As human populations expand, so do cities and farmlands. This involves reducing the natural habitats in certain areas to help accommodate these human changes. Because the northern bobwhite is a year-round resident in their range, they lack the flexibility some other migratory species may boast when it comes to their habitats. This is especially true when considering the specific conditions that northern bobwhites prefer for their habitats. Chemicals are also a significant problem for bobwhites. Because they often prefer to live in agricultural fields and areas, they are at risk of being exposed to dangerous pesticides and herbicides. There are also natural threats, such as predators. There are several predators of the northern bobwhites, both adults and their young. Some of the predators of this species include: It was originally thought that the northern bobwhite was a monogamous species . However, it has been since discovered that they have several methods of mating and rearing offspring. Males may mate with multiple females and vice versa. They may also intermingle with other common species, such as ring-necked pheasants and domestic chickens, and share nests. Bobwhites can have up to three broods. They lay between 7 and 28 eggs, each dull-white egg around 1.2 inches in length and 1 inch in width. It takes 22 to 24 days for the eggs to hatch. Hatchlings will be active and covered with down, but they still rely on their parents for warmth, food, and protection. The oldest northern bobwhite was over six years old. Because they are common domestic animals as well as game animals, their lifespan can vary greatly. The northern bobwhite is listed as a near-threatened species. Between 1966 and 2019, these birds faced a population decline of 81 percent. They have a global breeding population of 5.8 million. If their rate of decline from previous years continues, researchers estimate that this number could be cut in half within the next decade.",
        "score": 0.7250685
    },
    {
        "Name": "Red Finch",
        "Genus": "Haemorhous",
        "Diet": "Herbivore that eats grains, seeds, flowers",
        "Behavior": "They can be characterized as social.",
        "Features": "Bright red breast of male",
        "Fun_Fact": "Red finches can form flocks of over 100 birds.",
        "Text": "“Red finches sometimes compete with hummingbirds for nectar at a feeder.” Red finches are birds that live throughout the United States and down into Mexico. These tiny birds have a beautiful song full of trills, chirps, and rolling warbles. The male red finch is notable for the bright red feathers on his head and breast. Red finches are herbivorous birds, eating seeds, grain, flowers, berries, and buds. Red finches can live to be around 11 years old, but their average lifespan is 4 to 5 years. See all of our expert product reviews . The scientific name of this finch is Haemorhous mexicanus. Haem is the Greek word for blood (red) referring to the male’s color. Mexicanus refers to Mexico. These finches live in the United States and Mexico. Another name, used interchangeably for this bird, is the house finch . It is believed that the closest known relative, and oldest ancestor, of the finch, is the grassquit. The ancient grassquit first arrived in South America, most notably in the Galapagos Islands, around 2 million to 3 million years ago. Due to the different environments found on these islands, these ancestors had to adapt and diversify, which eventually led to a different species. The finch has evolved by changing its beak in order to acquire the different food sources available. Although there are 234 recognized species of finches, there are three species of finch that are closely related and are often mistaken for one another. All of these three have streaked feathers and the males are red. These include: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Male house finches have bright red feathers on their head and breast. They have light brown and black stripes on their wings and tail. Alternatively, a female house finch has a light brown head, a white breast with brown spots, and black stripes on her wings. See all of our expert product reviews . Both male and female house finches have a cone-shaped beak perfect for eating seeds and berries. They have two dark eyes as well as small dark legs and feet. These finches are tiny birds measuring 5 and a half inches in length and weighing from .67 to .78 ounces. As an example, if you lined up 2 and a half golf tees on the ground, they would be equal in length to a 5-inch-long red finch. A red finch weighing .78 ounces is equal in weight to a mouse . The heaviest a red finch can be is .78 ounces and that’s still less than one full ounce! The main defense house finch has against its many predators is its coloration. It can blend in with the trees and dry vegetation in its environment. As you may have guessed, a female’s brown and black feathers allow her to blend in better than a male with bright red feathers. House finches can also fly fast so they do have some chance of getting away from predators. House finches are social with other finches. They form male and female pairs. Plus, they live in an area with other red finches. Sometimes they form flocks of up to 100 birds. They use their unique song to communicate with one another over long distances. Due to their small size and vulnerability, these birds try to stay away from both people and other animals. You may spot them in your neighborhood, but it’s rare for them to allow someone to come close to them. These songbirds live throughout the United States, in southern Canada, and in Mexico. They live in temperate to warm climates. The finches that live in northern regions such as the northeastern United States and around the Great Lakes migrate south before winter arrives. Another species, the Cassin’s finch, lives in trees in evergreen forests located in the mountains. Sometimes they live at elevations of around 10,000 feet. These finches migrate to lower elevations when the cold weather sets in. These birds make nests in all sorts of places. They may create a nest on a rock ledge, in a tree, in dense bushes, or even in a hanging planter outside a home. They spend a lot of time perched on the very tops of trees. If a homeowner hangs a wooden finch house in a tree on their property, there is a good chance they will move into it. There are a few things a red finch looks for in a birdhouse. For one, they won’t go into a birdhouse that’s too close to humans. They need to have an escape route before settling into any house. It’s best to hang the birdhouse away from the main house. Also, the birdhouse should be up high enough to where it can’t be accessed by a domestic cat or looked into by a dog. A birdhouse for the house finch must have proper ventilation and drainage. The nest should stay dry at all times. Some homeowners have pairs of house finches that occupy their homemade birdhouses every year. It’s a pleasure to see them return in the springtime! What do red finches eat? These finches are herbivores eating seeds, fruit, flowers, and buds. They even include nectar in their diet. In fact, some homeowners with hummingbird feeders hung in the yard have observed red finches trying to drink from them! Their cone-shaped beak is ideal for consuming small seeds and eating fruit. These birds are a common sight at backyard bird feeders. They enjoy sunflower seeds, thistle, and white proso millet in their seed mixture. Red finches are very small birds so it’s not surprising that they have a long list of predators. Some of those include domesticated cats , skunks , raccoons , blue jays , snakes , and rats . Not only do these animals attack adult finches, but they also steal eggs or hatchlings out of this bird’s nest. The only threat humans pose to red finches is that sometimes they are captured and sold as pets. Despite this, the IUCN Red List of Threatened Species categorizes the red finch as Least Concern. Its population is increasing. These birds are vulnerable to certain parasites known as Plasmodium relictum and Mycoplasma gallisepticum. Breeding pairs of house finches are established in the winter season. To attract a female, a male finch flutters his wings, takes off, and lands on a perch while tweeting a calling song. When he pairs with a female, he will feed her as another sign of his devotion. Interestingly, researchers have found that female house finches prefer to mate with the reddest males they can find. It may be that they believe the most colorful male with help them produce healthy babies. In general, house finches are monogamous. The breeding season for these birds goes from March to August. The finches build a nest made of grass, twigs, scraps of paper, and any other small pieces of material. Some breeding pairs of finches return to the same nest they used the previous spring. Red finches are able to have up to 6 clutches of eggs per breeding season. These birds have 3 to 6 eggs per clutch. Each egg weighs just 2 grams. The incubation period ranges from 12 to 17 days. The male finch brings food to the female while she sits on the eggs. The eggs of a red finch are pale blue with small black spots. After the eggs hatch, the female and male bring the babies, or hatchlings, food. The newborn hatchlings are featherless, and their eyes are closed. In addition, they aren’t able to swallow solid pieces of food so the mother and father birds feed them regurgitated food that they can digest. Their eyes open at around 6 days old as they are getting a thin layer of feathers. The young finches, or fledglings, become independent and leave the nest at about 12 to 19 days old. But, by that time, the female red finch is already building a new nest in preparation for her next clutch of eggs, or she has already laid eggs. The lifespan of a red finch goes up to around 11 years. Like many other types of birds, they are vulnerable to respiratory ailments as they age. Some common ailments include Aspergillus, Avian pox, and mycoplasma. There are an estimated 267 million – 1.7 billion red finches in North America. The conservation status of red finches is Least Concern . This bird’s population is listed as increasing. The Cassin’s Finch has a conservation status of Least Concern with a population that’s decreasing. There are around 3,000,000 mature individuals spread across the western United States, southern Canada, and Mexico. The reason for the decrease in the population of the Cassin’s finch is not clear to scientists. It’s been suggested that climate change is affecting their habitat. Climate change may lead to more fires in the dry habitat of this species. The purple finch is categorized as Least Concern with a decreasing population. But the decrease in population is not significant.",
        "score": 0.7249017
    },
    {
        "Name": "Umbrellabird",
        "Genus": "Cephalopterus",
        "Diet": "Omnivore that eats fruit, frogs, insects",
        "Behavior": "They can be characterized as solitary.",
        "Fun_Fact": "Migrates up and down the mountains!",
        "Text": "Umbrellabirds have an umbrella-like crest on the top of their heads (for which they were named) and a tube-shaped inflatable pouch on their throats. They are the largest species of perching bird (Passerine) in South America, but populations are currently decreasing because of habitat loss. The Umbrellabird is a large, tropical species of bird that is found inhabiting the rainforests of Central and South America. It is a cotinga, a member of the family Cotingidae, order Passeriformes. There are three different species of the genus Cephalopterus, all of which live in slightly different areas but are similar in appearance: Some scientists think that the Long-Wattled and Bare-Necked Umbrellabirds are subspecies of the Amazonian Umbrellabird. The most distinctive feature of the Umbrellabird is the large crest on the top of its head. During mating, the males fan their crest out so that it nearly covers the whole of their head and they then begin to make rumbling sounds to attract a female. All three Umbrella bird species are similar in size and their bodies are covered in mostly black feathers. but each subspecies has unique features. The Long-Wattled Umbrellabird has a wattle on its throat that can grow over 13 inches long; the males of the Amazonian Umbrellabird are thought to be the largest of all three species; the Bare-Necked Umbrellabird is easily distinguished by the reddish, featherless patch of skin on its throat and the small, red wattle. The Umbrellabird is found throughout the sub-tropical belt of Central and South America where they spend the majority of their time hopping between branches high up in the tree canopy. For most of the year, the Umbrellabird can be found inhabiting lowlands and mountain foothills, generally at altitudes less than 500 meters. During the breeding season however, they migrate higher into the mountains where the gather in groups known as a “Lek” where they can find a mate. These breeding sites are usually in cloud forests that are between 800-2,000 meters above sea level. The Umbrella bird is known as an altitudinal migrant as it migrates up and down the mountains rather than across the land. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Umbrellabird is generally a solitary animal that is known to cohabitate areas with other Umbrellabirds and similar species such as Woodpeckers . Its large size makes flying more difficult compared to other species so it generally hops from branch to branch, gripping with its clawed toes. Although the Umbrellabird can fly short distances, it is relatively slow and clunky in the air. During the breeding season, however, these birds migrate to higher altitudes where they gather in small groups to choose a mate. Here the male performs courtship displays for the female to watch before she picks a partner. Mating territories are occupied from March until June. Once paired up, the female constructs a relatively large nest from twigs, moss, and leaves inside a tree that is often far from the ground. This is thought to be to protect the nest from hungry predators that feed on the eggs of the Umbrellabird. The female then lays a single egg which is incubated for only a month before it hatches, with the chick then being fed by its parents before it leaves the nest a couple of months later. Abandoned nests have been found alongside a current nest, indicating that females may even return to the same tree to lay their eggs every year. Umbrellabirds are thought to live for an average of 16 years in the wild. Like many of the world’s tropical perching birds, the Umbrellabird is an omnivorous animal that feeds on what’s available in the tops of the trees. Fruits and small animals are the Umbrellabird’s primary sources of food. It eats a range of invertebrates such as insects and spiders, along with small frogs and birds. The Umbrellabird uses its strong toes to hold onto the branches while it picks fruits and berries with its curved beak. The quite long, black beak of the Umbrellabird is similar to that of a Raven and allows the Umbrellabird to snap up passing insects with ease. Since the Umbrellabird drops seeds from the fruit it eats across the forest, it plays a vital role in its native eco-system. The Umbrellabird spends the majority of its time at the tops of trees, so ground-dwelling predators pose little threat to this unique bird. Arboreal animals, however, are a different story, often preying on the eggs and younger individuals that are a more manageable size. Monkeys and snakes are the primary predators of the Umbrellabird, along with large birds of prey such as hawks and eagles that can hunt from the air. The biggest threat to the Umbrellabird, however, is humans, who clear their native lowland forests, generally for agriculture. Although all three species are being severely affected by habitat loss, the Long-Wattled Umbrellabird is thought to be most under threat as it lives in only a handful of very specific areas. The distinctive throat pouch of the Umbrellabird inflates on the males during the breeding season. The reason for this, it is believed, is to make their rumbling calls louder, making a booming sound that is said to sound like a hippo. The wattle is one of the characteristics that differs the most among the three species of Umbrellabird. The Long-Wattled Umbrellabird has a long black wattle (as its name suggests), while the Amazonian’s is shorter, and the Bare-Necked Umbrellabird’s is red in colour and much smaller than the others. The Umbrellabird’s existence was first recorded by Sir Alfred Wallace, a companion of Charles Darwin’s, in the 1800s while on an expedition to South America. Because the Umbrellabird lives high in the rainforest canopy and is rarely seen in open areas, it can often be hard to spot during the non-breeding season when it is in the lowlands. Higher up in the mountain cloud forests, however, the breeding sites of the Umbrellabird have been known to be targeted by local hunters. It is the deforestation of the lowlands, where they spend most of their time, that has led to drastic declines in their population numbers. These areas are most commonly turned into pineapple and banana plantations that do not accommodate their arboreal lifestyle. Today, the Long-Wattled Umbrellabird is listed as “Vulnerable” while the Bare-Necked Umbrellabird is considered to be “Endangered.” However, the Amazonian Umbrellabird has been classified by the IUCN as Least Concern. All three species are under threat, nonetheless, mainly due to the loss of significant chunks of their natural habitats, with most of the remaining populations now found in protected areas.",
        "score": 0.7236728
    },
    {
        "Name": "Amazon Parrot",
        "Genus": "Amazona",
        "Diet": "Herbivore with no preference",
        "Features": "Their colorful feathers",
        "Fun_Fact": "These parrots can be trained to be talking birds that mimic human speech",
        "Text": "“An Amazon Parrot is a beautiful bird with lots of personality.” Amazon parrots, which are often called amazons, are large members of the Psittacidae family. They are mostly native to South America. There are 35 species and several subspecies, and many can be trained to be talking birds to some extent. Physical features include big, powerful bills to crack the nuts they find in their native habitat and multicolored plumage. Mental features are high intelligence, curiosity, and a bold personality. Read on to learn more about these incredible birds. See all of our expert product reviews . Here are four facts about the amazing Amazon parrot: Amazon parrots are native to South America , the Caribbean, and Mexico , and feral parrots are found in the United States , Europe , and South Africa . These feral populations are thought to be the result of owners finding the needs or behavior of their pet parrots a bit too much to handle and setting them free. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Amazons tend to build their nests in cavities found in trees or cliffs. An exception is a Cuban amazon that lives in Abaco in the Bahamas . These parrots build their nests on the ground . The scientific name of the genus is Amazona , which simply means they are of the Amazon . After this, the epithets have several meanings. The aestiva in A. aestiva, the scientific name of the blue-fronted parrot means “summer.” The epithet of A. brasiliensis means “of Brazil .” The epithet of A. agilis , the scientific name of the black-billed amazon means “agile” and the epithet of A. ventralis means “of the belly.” This is the scientific name of the Hispaniolan amazon, given because of the patch of red on its belly. See all of our expert product reviews . The parrot is believed to have evolved over 59 million years ago, in Gondwana, the once ancient super subcontinent that formed after Pangaea broke up. Although scientists believed that birds evolved from an ancient bird-like dinosaur, Archaeopteryx, which is the oldest known fossil bird and was found in the Gobi Desert and lived during the Cretaceous period, over 100 million years ago. The Amazon parrot was able to spread out to areas of the Caribbean around 3.5 million years ago, which is hypothesized to be because, during this time, the periods of the sea levels were lower, which is thought to have made travel easier from mainland Central America to the islands. The Amazona genus of parrots has over 35 species of birds. Here are just a few of those: Amazon parrots are relatively large birds. They range in size from the 9-inch long white-fronted amazon to the 18-inch long Imperial amazon. They are mostly green but usually come with areas of rich shades of red, blue, maroon, purple, and yellow. Their tails are short compared to other parrots, and their wings are round. Other features include heavy, hooked bills whose purpose is to crack nuts and other hard seeds and zygodactyl feet whose purpose is to cling tightly to branches. The parrots have a naked cere, which is that bit of flesh at the top of the bill. It is difficult for humans to tell some male and female parrots such as the blue-fronted Amazons apart. The difference between males and females in some parrots is only apparent in the ultraviolet range, which humans can’t see. Males might be a bit larger in some species. Amazon parrots are social as a group and travel together in large flocks. They also nest in the same area. The purpose of this behavior is to give the birds protection from predators. They communicate both vocally and through gestures. The vocalizations of Amazon parrots are quite diverse and can be rather loud. Parrots scream, screech, growl, rumble, bugle, and squawk. Amazons are also monogamous, by and large. The main social unit is the pair, which then interacts with the larger flock. Whether an Amazon parrot makes a good pet depends on several factors. The most important is probably the species. Some Amazon parrots even need behavior training, otherwise, they will become unruly or even violent toward their owner. Another thing to consider is the parrot’s conservation status. Some parrots are endangered because their eggs and chicks are collected so the birds can be sold in the pet trade. Since parrots are monogamous, it is ideal to buy at least two, which can be expensive. The price of an Amazon parrot can range between $400 and $1000. They also need a lot of room as they are large birds. There’s not only the price of an enclosure for the birds but the price of their food, their toys, and their veterinary care. Parrots are messy and need to be bathed at least now and then. A potential owner must also remember that a young parrot might outlive them and make arrangements for their care. These parrots are herbivores, and their food includes nuts, seeds, berries, flowers, fruit, and leaves in the wild. In captivity, they can be given pellets formulated for parrots that are supplemented with fresh fruit and vegetables. They shouldn’t be fed seeds and nuts all the time because these items have too much fat, and obesity can be a problem with captive amazons. Of course, the parrot must have access to fresh water every day. Humans are the biggest predators of and threats to Amazon parrots, for grown birds avoid predators by being large and congregating in flocks. Humans hunt parrots and even their eggs for the pet trade and hunt the larger parrots for food. The habitat of these parrots is also destroyed or fragmented by human housing, farms, and industry. In the wild, predators are mostly a danger to chicks and eggs. They include hawks, snakes such as the boa constrictor, and monkeys . The reproductive strategies of many species of these parrots are not well known by biologists, but they do know that parrots are monogamous and breed seasonally. Most breed in spring or late winter, though the blue-fronted parrot breeds in the summer, which probably gives it its scientific name. Most parrots construct a nest in a tree cavity, and the female lays between two and five eggs, which she incubates for about a month. During that time the male feeds her, then helps her feed the chicks, which are born helpless. Chicks are fledged after about two months. Biologists don’t know when many of these parrots reach maturity, but it’s believed that blue-fronted parrots are mature when they’re two to four years old. Amazon parrots are amazingly long-lived and can have a lifespan of as long as 100 years if they are given good care. The conservation status of an amazon depends on its species. For example, the red-spectacled amazon of Argentina is listed as vulnerable . The black-billed Amazon is endangered, the Cuban amazon is near threatened and the white-fronted amazon is of least concern .",
        "score": 0.7226194
    },
    {
        "Name": "Eurasian Collared Dove",
        "Genus": "Streptopelia",
        "Diet": "Herbivore that enjoys grains",
        "Origin": "Bulgaria",
        "Behavior": "They usually live in colonial nests. Their temperament can be characterized as aggressve and territorial.Their aggression level is high.",
        "Features": "Black, crescent-shaped collar around the back of the neck",
        "Fun_Fact": "The Eurasian collared dove has been extensively studied due to its amazing ability to rapidly colonize new territories.",
        "Text": "The Eurasian collared dove has been extensively studied due to its amazing ability to rapidly colonize new territories. The Eurasian collared dove is considered an invasive species in much of its territory. With an estimated population of 100 million or more birds worldwide, and the ability to disperse hundreds of miles in each generation, this dove is an incredibly effective colonizer. This collared dove, Streptopelia decaocto , is similar to several other doves with collars or rings on their necks. The European turtle dove, Streptopelia turtur , and the Barbary dove, Streptopelia risoria , are in the same genus. The expansion of the Eurasian collared dove is concerning because it is an aggressive competitor and highly territorial. After being introduced in the Bahamas in 1970, the dove took up residence all over the Caribbean and throughout much of North America and Central America. As of 2020, it had made its way to the border of South America with no signs of stopping. The Eurasian collared dove originated in what is now Bulgaria . This dove was first described by the Hungarian naturalist, Irme Frivaldszky in 1838. It is not known how or when precisely the bird first arrived in the Balkans. It remained there for some time before beginning a rapid dispersal across Europe and Asia . This determined dove made it all the way to Africa on its own. It now has populations in Morocco and Egypt and perhaps other countries in the northern portion of the continent. The journey to North and Central America required a bit of human assistance. It began in 1970, when a pet supplier in the Bahamas imported a few breeding pairs from the Netherlands . In 1974 several of the birds were accidentally released during a robbery, and the supplier subsequently turned the rest of his stock loose. An estimated 50 or more Eurasian collared doves were then free and breeding in the Bahamas. In an almost frightening display of expansion, the birds took only a few short years to spread from one island to another throughout the Caribbean. By the early 1980s, the doves had taken hold in Florida. Today, the Eurasian collared dove has spread to dozens of countries, including those in Europe and Asia. Its range now covers most of the United States, into Canada, throughout the Caribbean and into Mexico. In 2020, the species was officially listed as present in Trinidad and Tobago. Researchers are watching carefully for the expansion of the species into South America from there. The scientific name of the Eurasian collared dove is Streptopelia decaocto . The word “streptopelia” translates to “collared dove.” It is the name of the genus which includes Eurasian and other species of collared doves, including Streptopelia risoria , the Barbary dove, and Streptopelia turtur , the European turtle dove, among many others. The name “decaocto” was given to the bird in reference to its call. The name is based on an ancient Greek myth about a young servant woman who called out the word in complaint about her poor wages. She was turned into a dove by Zeus so that she could escape her master. The Eurasian collared dove, unsurprisingly, has a mark around its neck. In fact, it was named for the collar and belongs to a genus filled with species of doves with such markings. The crescent-shaped black collar is rimmed in white, and it stands out against the light gray plumage of the bird. This gray is tinged with pink around the head and breast. The doves are about 12 to 14 inches long and weigh less than half a pound. Both the males and females look essentially the same. This dove has a tail that distinguishes it from some similar species in that it is squared off rather than pointed. The underside of the tail is white. Adults have red eyes while juveniles have brown. Adults have a black beak and short, pinkish legs and feet. Juveniles look similar, with darker legs and just a bit of reddish color to their feathers . The juveniles also have a less defined collar until they mature. Two known color aberrations exist within the Streptopelia decaocto species. One is the Ino mutation, which results in a white to blond color. This mutation is also present in Streptopelia risoria . Another rare mutation causes the Eurasian collared doves to exhibit brown plumage. Perhaps the most defining characteristic of the Eurasian collared dove is the process by which the newly independent juveniles disperse from their parents. These birds are known to fly as far as 600 km, or nearly 375 miles, to start their adult lives. This urge to travel so far from their nest of origin is what drives the expansion of the species. Much like a wildfire, the dispersal of the Eurasian collared dove follows a sort of jump and backfill pattern. Like smoldering embers, carried on the wind far ahead of a fire, so are the individual doves making their way as far from home as they can. New territories are claimed, far in advance of the existing population’s range, and the area in between quickly fills in as other members of the species take flight. The Eurasian collared dove is an aggressive competitor wherever it goes. It will attack other birds and chase them from food sources. It has been observed pulling feathers from rival birds, jumping on their backs and pecking at them violently. The dove will even attack crows that try to pilfer eggs from its nest. This dove tends to live close to humans, even nesting on buildings and other artificial structures. They are often found perched high in trees or on utility lines, and they roost together in large colonies. Like many other doves, commercial bird feed is a favorite part of the Eurasian collared dove’s diet. Theyeat primarily grains in the wild, and they have adapted easily to eating from bird feeders. These doves also tend to live near agricultural areas, feasting off the grain that is spilled or left in the fields. They will eat wild grains, berries and even small insects . These doves can eat a large amount of food and store it in their crop. That means they are free to sit on a high perch and avoid predators while they take their time digesting what they have consumed. These doves reach sexual maturity around the first spring after they become independent. The exact age of the birds at that time can vary, because the Eurasian collared dove has multiple broods throughout the year. The doves are monogamous and mate for life. Each of their broods is typically just 1 to 2 eggs, but they can have 3 to 6 broods each year. Both the male and the female take turns watching over the nest and incubating the eggs. Incubation takes about 14 to 19 days. Although the Eurasian collared doves are attentive parents, their nests are not well formed. They are a simple pile of twigs, at least 10 feet off the ground, sometimes in trees or on artificial structures. Eggs and hatchlings often fall from the nests. This may be one reason the birds have so many broods each year. After hatchlings emerge, the parents feed them with a white fluid they produce in their crops. This fluid is called crop milk. Within another 18 days, the offspring, known as either squabs or chicks, are ready to fledge. They are fully independent about 30 to 40 days after hatching, at which time they tend to disperse far from the nest and begin the cycle again. The greatest predatory threats to Eurasian collared doves are owls , hawks and domestic cats . These doves feed on grains and are likely to be found around bird feeders put out by humans. They are most vulnerable when they come to the ground to feed. Crows have been known to take eggs from the doves’ nests. Snakes would also be likely predators if the eggs were left unattended too long. Eurasian collared doves have a few advantages that would help them to either avoid predators or challenge them. First, the pairs of doves mate for life and work together to incubate eggs. This means they are rarely unattended. The birds are also highly aggressive and territorial, and will defend their young even against much larger birds like crows . Finally, the adult doves can avoid exposure for long periods due to their efficient feeding habits, thus reducing the risk of being attacked. The longest recorded lifespan of a Eurasian collared dove in the wild is 17 years, 8 months . This specimen, a banded bird in Europe, was found dead. The longest living captive specimen lived around the same amount of time, 17 years, 9 months. The average life span is much shorter, with relatively few of these birds making it past about 5 or 6 years of age. One of the main concerns regarding the spread of these doves is that they may take up habitat and resources from native birds. Their aggressive nature gives them an advantage at feeders, and their willingness to fight can drive songbirds and even other doves away Eurasian collared doves are listed as a species of least concern on the IUCN Red List. Their population is estimated at up to 75 million mature birds, and up to 100 million overall. The population is relatively stable in Europe, but is increasing at a rapid pace in other parts of the world, including across the United States. Another concern is disease. Eurasian collared doves were recently recognized as carriers of West Nile Virus, a disease that can be deadly to humans. They are also known to carry a parasite called Trichomonas gallinae , a protozoan that causes lesions in the mouth and sometimes the brain and liver of an infected bird. The resulting disease, trichomonosis , can cause a bird to lose weight and eventually die. Sanitation of bird feeders and water sources is necessary to help stop the spread of the disease. Because Eurasian collared doves are not a protected species, they can be hunted in accordance with local laws. Extra care should be taken, though, to prevent shooting similar looking native birds which may be protected species.",
        "score": 0.72167975
    },
    {
        "Name": "Goose",
        "Diet": "Omnivore that enjoys grass and especially likes seeds, berries",
        "Fun_Fact": "During its migration, the goose flies in V formations to conserve energy.",
        "Text": "The goose is among a group of large waterfowl that resides in the Northern Hemisphere. This bird’s loud, aggressive behavior has become something of a running joke in modern media (epitomized by the popular action puzzle video game, Untitled Goose Game ), but as a very caring parent, it is usually just trying to protect its young from danger. The Canada goose is the most common species in North America , but the bird has adapted to live in many different regions around the world. Here are a few amazing geese facts : Here is a full list of all different sub-species of geese: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The goose is a bird that has evolved over millions of years to live near the freshwater rivers, lakes, ponds, and streams of Europe , Asia , and North America . Most species prefer temperate or Arctic climates, but the Hawaiian species is an obvious exception since it lives in tropical climates. The European domestic goose is descended from wild greylag goose. In fact, based on its pink bill, the coloration suggests that it is more likely from the eastern subspecies (Anser anser rubrirostris) than the nominate western subspecies. There are two key types of domestic geese. The first were thought to have origins in Europe. They may have also been descendants of the wild Greylag goose, and the second are suggested to have their origins in Asia, and may be descendants of the wild Swan goose. The bird’s nest is a very simple construction of leaves, grass, twigs, mosses, and lichen in the ground, sometimes near an elevated area. Closely related to ducks , swans , and other waterfowl, these birds belong to the family of Anatidae, which appears to derive from the Latin anas for a duck. “Goose” is not really a single classification at all. Instead, it is generally defined as any member of two different genera: Anser, which includes the grey and white geese, and Branta, which includes the black geese. There are some 16 or 17 recognized species, including Canada, the barnacle , the white-fronted, the snow, the swan goose, and the brant. Several more species (among them the magpie and the pygmy goose) are not true geese at all, despite their names. These birds are very recognizable due to their plump body, slender neck, and humped bill that tapers at the end of the mouth. Although physically similar to the closely related swan, they usually exhibit grey or black feathers all over their smaller body with a black or orange bill. The terms gray, white, and black goose generally refers to the color of the neck and head (the black goose has an additional white mark around the chin as well). The largest species are Canadian geese, which weigh in at about 14 pounds and reach some 43 inches in length. The male gender tends to be slightly larger than the female, but the sexes are otherwise similar in color and appearance. The social life of these birds revolves around large flocks called gaggles (though in the air they’re called skeins). When defending against threats or interacting with other members, these flocks are a loud cacophony of honks and cries. Sometimes, when they are particularly angry, they will vibrate their neck feathers in defiance. After triumphing over a foe, they will emit a kind of victory cry as well. As members of the waterfowl family, these birds are obviously excellent swimmers and flyers, but the more forward position of their feet compared with swans and ducks also makes them better walkers as well. Geese are able to sleep while staying alert by shutting down one-half of their brain. This is called the unihemispheric method and is shared with other animals like dolphins. These birds migrate in V formations, which allow them to conserve energy by taking advantage of the air currents created by the wings of those ahead of them. This is why they constantly trade places: the bird at the front expends more energy than the bird toward the back. Migratory patterns vary by species. Canada geese, for instance, travel as far south as Mexico and the Southern United States in the winter, sometimes up to 3,000 miles along a single route. Hawaiian geese (also called the nene) remain mostly within the island chain of their birth all year round. These birds are mostly herbivorous grazers; the bill and mouth are specially adapted for grasping and tearing at vegetation. The bird’s diet consists of sedges, grasses, grains, seeds, and aquatic plants. It will only sometimes resort to insects and fish . These birds sometimes face threats from hunting, habitat loss, and predation (both natural and introduced species). These threats tend to be localized, however, and affect each population differently, rather than all geese as a whole. Adult birds only have a few natural predators, including coyotes , bobcats , and humans . But eggs and juveniles make a tempting target for skunks , foxes , raccoons , crows, snakes , hawks, snapping turtles , and almost any other carnivorous animal of decent size. Since only the largest carnivores want to tussle with a full-sized goose, most of them resort to subterfuge and guile. These birds form lifelong monogamous bonds with a single partner. Together they produce a single clutch of white eggs (usually up to 10, depending on the species) in the spring breeding season. If one of the birds dies, then the surviving mate will find pair up with someone else within the same season. Once she lays the eggs, the female has sole responsibility to incubate them, while the male gander stands guard to protect against threats. Emerging from the egg with downy feathers, the gosling has the ability to fend for itself almost immediately, but it remains under the protection of its parents for the first summer of its life. The parents will lead the goslings in a single file line and hiss at anything that approaches. Geese have a life expectancy of around 10 to 15 years, but they have been known to live some 30 years in captivity. According to the IUCN Red List, most geese species are considered to be least concern , perhaps because they are rarely hunted enough to be threatened directly. Of the 16 or so true geese species, only the swan, the red-breasted, the Hawaiian, and the white-fronted goose are vulnerable , while the emperor goose is near threatened .",
        "score": 0.71910274
    },
    {
        "Name": "Snow Goose",
        "Genus": "Anser",
        "Diet": "Herbivore with no preference",
        "Behavior": "They usually live in flocks.",
        "Fun_Fact": "The snow goose has a dark line along their beaks known as a ‘grinning patch’!",
        "Text": "“The snow goose has a dark line along their beaks known as a ‘grinning patch’!” Snow geese are an average-size species that comes in two different morphs, or colors. They are found throughout much of North America . They are rarely seen traveling without the presence of a large flock around them. Their population is thriving, a fact which many researchers contribute to their use of agricultural fields. The snow goose is a North American species and can be found from southern Mexico to the Queen Elizabeth Islands (the northernmost islands in the Canadian Arctic Archipelago) depending on the time of year. Despite this, certain varieties may choose to settle on nearby continents. This includes those that winter in the western regions of North America occasionally breeding in Siberia or those in the east breeding in Greenland. Most often, you will see them in migration, as this is when they are settled in the largest range of areas. During migration, they can be seen in the southernmost regions of the United States all the way to the northern coast of Alaska and continental Canada. The majority of the species breeds in the Queen Elizabeth Islands, where there are few human inhabitants to enjoy the sight of these geese and their goslings. Come winter, many will settle in the United States, with large populations dotting the eastern and western coasts as well as being largely abundant in the central region of the county. Some may also winter in central and coastal Mexico. Snow geese will typically nest along streams and ponds, though they may also choose to settle around coastal salt marshes and brackish marshes. Alongside these aquatic environments, snow geese have also taken to agricultural fields and other open habitats for the winter. It is the female that is responsible for choosing the nesting site, although the male will be alongside her for the process. This spot is often hidden by vegetation. When possible, snow geese prefer to build their nest on dry ground. Because they breed in arctic regions, however, this can be difficult, as the melting snow often leaves the ground damp. Sometimes, she will begin several nests before choosing a permanent one. After this, she may begin to lay her first egg within one hour. Along with picking the nesting location by herself, the female builds the nest on her own. As he develops the nest, she lays eggs. Typically, the nest begins as a small scrape in the ground to which she adds down feathers plucked from her own plumage. In areas where there is less vegetation courage and thus less security, the larger and more well-developed the nest will be. Some may include natural materials, such as grasses, twigs, and seaweed. The scientific name of the snow goose is Anser caerulescens . This name originates from Latin, from the words “anser” meaning goose and “caerulescens” meaning bluish, as derived from the word “caeruleus” meaning dark blue. They are in the class Aves and the order Anseriformes . Their family is that of Anatidae , which contains ducks, geese, and swans. The snow goose is a rather large bird, although it is around average size for a goose. They are compact, however, with smaller necks than other species such as the Canada goose. Adults can grow to be 27.2 to 32.7 inches in length, and they can weigh 56.4 to 116.4 ounces. They have a large wingspan, with that of an adult individual averaging around 54.3 inches from wingtip to wingtip. There are two different morphs for this species. The first is the recessive morph which is entirely white with black wingtips. These black markings may not be easy to see on the ground, but they are visible during flight. The second morph is the dominant dark morph. Geese with this morph have dark brown bodies with white heads. The underside of their tail is also white. Regardless of the morph, these geese have pink bills with a black marking known as a grinning patch. This differs for juveniles, however. Juvenile white morph geese are speckled with areas of brown buff, especially on their head. Juvenile dark morphs are dark brown all over, with no noticeable white markings on their plumage. They also tend to have darker bills, though the grinning patch is still visible in many individuals. Snow geese travel together in large flocks. Usually, this includes a few dozen other individuals of the same species. However, it can also include up to several thousand individuals. Snow geese are medium-distance migrants with no notable year-round populations. They winter in the southernmost extents of their range, in the United States and Mexico, before migrating through the countries to settle in the northern region of Canada for breeding. The snow goose is primarily an herbivore, although goslings may consume some animal products. They easily consume the entirety of the plant through a variety of methods, including grazing as well as ripping the plant through the ground. Some of the plants that snow geese will eat include Young goslings may occasionally eat fly larvae. Overall, snow geese face few significant threats outside of predation from both other animals as well as humans. This is because they typically nest in remote areas with little to no interference. However, like all species of waterfowl, they can be threatened by pollution in the waterways in which they live. Because they forage on the ground, they may also occasionally suffer from lead poisoning as a result of consuming dropped lead shots. Some of the predators for these geese and their young include Snow geese mate for life. They will often choose their mate based on morph, preferring mates with the same plumage as close family members. The female incubates the nest while the male stands guard, though he may occasionally leave for short periods of time. This species has one brood per year, usually containing on average two to six eggs. These eggs are white in color and can be easily stained. This helps in identifying the oldest eggs, as they will often possess more stains than those laid more recently. The average incubation period for this species of goose is 24 days. During this time, the female can spend over 21 hours each day in the nest. When they are first born, the young goslings are covered in down with their eyes opened. The nestling period lasts only a day before they are able to leave the nest. The snow goose is a species of least concern . In fact, they have actually experienced impressive population growth in recent decades. Many scientists have attributed this to the fact that the arctic regions of the snow goose’s range are warming. This includes areas where snow geese migrate and breed, creating more inhabitable conditions for these birds. They are estimated to have a global breeding population of 16 million individuals.",
        "score": 0.7177896
    },
    {
        "Name": "American Robin",
        "Genus": "Turdus Linnaeus",
        "Diet": "Omnivore that eats earthworms, caterpillars, grasshoppers, beetle grubs, spiders, and snails",
        "Features": "orange chest",
        "Fun_Fact": "The color “Robin egg blue” is named after the hue of their eggs.",
        "Text": "“Most widespread and abundant thrush in North America” The American robin is a songbird in the thrush family. Thrushes are commonly referred to as “heralds of spring.” American robins have a positive relationship with humans . They are a friendly species that can help control pests. They also benefit the ecosystem by dispersing seeds from the fruit they eat. On the continent of North America , American robins reside in the United States , Canada , and Mexico . They live in a temperate climate in woodland and shrubland habitats as well as open land areas. They commonly have habitats in residential areas also. You can find them in the grass foraging for food when they are not roosting or nesting in trees. You may see them in lawns and gardens, farm fields, city parks, and wooded areas. The best time of year to find this bird relies heavily on the location. Since they migrate, they are found in different areas depending on the season. However, they are active all year long. Females build the nests with no help from her partner. She gathers twigs, grass, feathers, and paper to form the outside structure of the nest. She lines the nest with mud to hold it together. The inside is cushioned with soft materials including grass and other plant matter. When finished, the nesting structure is about three to six inches tall and six to eight inches wide. The nest is located either in the fork of tree branches or in a dense bush. It is typically placed a great distance from the ground, between 4.9 and 14.8 feet high. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The American robin’s scientific name is Turdus migratorius . It is in the thrush family, Turdidae, and the Aves class. Aves is a class of birds . The origin of the scientific name comes from the Latin words “turdus” meaning thrush and “migratorius” which means to migrate. There are seven American robin subspecies. The subspecies are eastern robin ( Turdus migratorius migratorius ), northwestern robin ( Turdus migratorius caurinus ), southern robin ( Turdus migratorius achrusterus ), western robin ( Turdus migratorius propinquus ), Mexican robin ( Turdus migratorius phillipsi ), Newfoundland robin ( Turdus migratorius nigrideus ) and San Lucas robin ( Turdus migratorius confinis ). The English robin formally named the European robin, is where the American robin got its name. Early settlers noticed it had similar features to the European robin, mainly the appearance of its red-orange breast. This, however, seems to be the only comparative similarity between the two birds. These species are not closely related. Though they share the same order and class, they belong to different families. The English robin is native to Europe and is part of the Muscicapidae family, also referred to as Old World Flycatchers. The American robin is actually a thrush that belongs to the Turdidae family. American robins’ anatomy is different so they are also larger than their European lookalikes. American robins are between eight and 11 inches in length and weigh 75 to 77 grams. They have a wingspan of 12 to 16 inches. Their anatomy is typical of a thrush. Their anatomy features include feathers, wings, and a beak. The beak is yellow and the throat is striped black and white. The head is black and the back is gray or black. The chest is a vivid orange color. Males are usually somewhat larger than females and have more colorful features. These birds exhibit social behavior. They tend to live in small groups and flock in larger groups at night. They are diurnal, therefore they are most active during the day. They sing a melodious song. It is often one of the first bird songs you hear in the morning. These birds are fully migratory. They migrate in flocks in the daytime. In the winter, they fly south. In the spring, they head north. In the fall, their migration depends on where there is a decent food supply available. The American robin is an omnivore. It eats both plants and animals. It forages on the ground throughout the day and will also forage at night. About 60% of their diet consists of fruits and berries and these foods are especially important in the winter. Aside from fruits and berries, an American robin eats a variety of invertebrates such as earthworms, caterpillars , grasshoppers , beetle grubs, spiders, and snails . Because American robins frequently spend time in residential backyards, they are sometimes indirectly poisoned by pesticides used by humans and killed by pet cats . They are also preyed upon by several animals in the wild. The American robin’s conservation status on the IUCN Red List is the least concern. The species is stable. Poaching was a problem in the past. They were hunted many years ago but they are now protected by the US Migratory Bird Act. Other than domestic cats , American robins are eaten by birds of prey and snakes . Some birds that prey on American robins are hawks, eagles , snowy owls , and northern pygmy owls. Snake species that regularly eat them include rat snakes and gopher snakes. American robin eggs and young have additional predators due to their vulnerability. Some common animals that eat eggs and chicks are raccoons , squirrels , foxes , crows, common ravens , and blue jays . The breeding season for American robins occurs between April and July. Reproduction is viviparous. The courtship behavior of the male is meant to attract a mate. He shakes his wings, spreads his tail, and sings for her attention. The female usually lays between three and five light blue eggs . It takes 12 to 14 days for the eggs to hatch. When the chicks hatch, they are altricial. This means that they are not independent and require care and feeding from their parents. The chicks leave the nest and begin fledgling about 13 days after hatching. It generally takes them two weeks to get good at flying and be able to sustain flight. Their average lifespan is two years and they molt once a year. The estimated American robin population is about 310 million. Roughly 79% of them are in the United States, 45% are in Canada and 13% are in Mexico. These birds have a huge range and are abundant. The population trend is increasing and there is no current threat to their decline. Their conservation status is the least concern .",
        "score": 0.71657455
    },
    {
        "Name": "Macaw",
        "Genus": "Arini",
        "Diet": "Omnivore that enjoys fruit and especially likes nuts, seeds, insects",
        "Fun_Fact": "The military macaw is named for the green uniforms that many soldiers use in South America.",
        "Text": "There are approximately 17 unique species of Macaw birds in the wild and in captivity today. All these birds are part of the Psittacidae family, which translates to “true parrots.” This parrot family further splits into two subfamilies: the Psittacinae and the Arinae , or Old World and New World parrots, respectively. Old World parrots include the Grey Parrot, the Cape Parrot and the Senegal Parrot, which are found primarily in Africa . In contrast, New World Parrots include six genera of Macaw birds that live and roam in Mexico , Honduras , Brazil and other nations in Central America and South America . These birds include the scarlet Macaw , the blue and gold Macaw , the green wing Macaw, the red-shouldered, or Hahn’s, Macaw, and the harlequin Macaw. See all of our expert product reviews . Unlike their Old-World cousins, these all have bright feathers in varying shades of green, blue, yellow, gold, and red. While these colors are very vibrant and attractive to humans, these colors allow Macaw birds to camouflage themselves in the green leaves of the Amazon rainforest and other forests that they call home. Read other interesting Macaw facts here. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The blue and gold and hyacinth species of these birds are native to Central America and South America . They can be seen in the wild in such countries as Mexico , Honduras , and Brazil . Their unique feathers and bright coloring help them blend into the Amazon rainforest and their other natural habitats. These birds generally live in monogamous pairs but also form families of up to 30 in one flock. They generally settle into the crevices within tall trees or live on cliffsides for protection. They have also been known to dig out depressions in riverbanks or other hills made from soft earth. See all of our expert product reviews . Due to the large number of living species, there are numerous scientific names for these birds. In general, all 17 of these species are found in the Psittacidae, or true parrot family. Further, they are part of the Arinae, or New World parrots , subfamily and the Arini tribe of Macaws and parakeets. The six genera of living Macaws are as follows: Due to their cheerful nature, their vibrant coloring and their ability to learn words, many birds of this species are popular pets. This status has led breeders to create some hybrid species in captivity. For example, the harlequin is a new breed that is a cross between the blue and gold and the green wing species. Harlequins generally have personality and coloring elements from both species. These are generally playful and happy birds. Their owners have described them as clowns or jokers. They are highly social creatures both in the wild and in captivity. Many do well with families where they have more humans to interact with on a regular basis. If they are hand-fed from an early age, then they will become attached to their owners. In the wild, these are curious birds. Scientists and enthusiasts have observed these birds playing with new objects. They will often toss new things into the air and catch them with their beaks or their feet. They also will lick and taste the object to try and get more information about it. While these birds bond in pairs, they also typically seek to form larger flocks of 30 to 40 or more birds. Increased numbers serve to protect themselves from humans, snakes, larger birds, jaguars and other threats. Macaws often shriek or let out loud noises to communicate with or to warn their flock mates. In captivity, they like to learn words and will practice new vocabulary until they master it. As you can imagine, the average size, weight, and wingspan varies widely from species to species. The largest examples are part of the Ara genus. This group includes the hyacinth Macaw, which has a wingspan between three and four feet and weighs up to four pounds. It is also more than 39 inches long. The smallest species is the red-shouldered Macaw (scientific name Diopsittaca nobilis), which is also known as the mini-Macaw. These birds weigh only 5.8 ounces and only 12 inches long. The Hahn’s Macaws and noble Macaws that make up this species are almost identical in appearance. However, the Hahn’s has a black upper mandible. These birds normally nest in the knots or crevices in tall rainforest trees. Some species also make their homes in rotted-out trees on the savannas and plains in South America. Other species will opt to nest on rocky cliffs for protection while some will choose to dig out an area in a riverbank. Macaws primarily eat fruit as their main source of nutrition. However, they do also fly to grassy areas in search of seeds or nuts. Their strong beaks are capable of cracking almonds, brazil nuts, and other similar nuts. Nuts’ higher caloric value and fat content are important to larger species like the hyacinth Macaw. For a complete analysis of the diet of macaws, don’t miss our ‘ What Do Macaws Eat: 11 Foods in their Diet ‘ guide! There are many types of macaws, and here are several of the most popular: These birds are at risk from several native species in the Amazon rainforest and the forests of Central and South America. These predators include snakes , monkeys , and larger birds. Specific threats include pythons, boa constrictors, jaguars , ocelots , eagles , and falcons . Macaws reach sexual maturity between two and 10 years depending upon the species. At that time, they will typically pair up and bond with another bird in their flock. Most clutches have between one and four eggs. If reproduction is successful, then females will generally wait two years to mate again. The eggs normally incubate anywhere between 24 and 28 days depending upon the type of Macaw. Chicks will typically remain in the nest under their parents’ protection for up to three months after hatching. At that point, they will often stay with their parents and siblings for a year and then head off to find their place in a flock. A Macaw’s lifespan varies significantly based upon its species . For example, the blue and gold Macaw will live up to 35 years in the wild. In comparison, the green wing and scarlet Macaws have a lifespan between 70 and 75 years. Overall, these birds average 60 years in the wild, but some individuals do survive into their 80s and beyond. Macaws are known for their brilliant plumage and striking color. But what makes them so colorful? Many other types of brightly colored birds derive their coloration from their diet within their environment. Macaws are that way! They are able to produce those colors through chemical pigments within their bodies and also through structural adaptations of spaced microscopic layers within their feathers. The bright colors are part of their defensive strategy and work well because macaws tend to stay within their flocks for protection. Would-be predators have a hard time visibly discerning body shapes because of the bright plumage. The Macaw population varies significantly depending upon which species you evaluate. Some species, like the Spix Macaw are extinct in the wild. In fact, less than 200 of these birds left in captivity worldwide. In contrast, there are believed to be at least 10,000 blue and gold Macaws left in the wild. This species is labeled as least concern because its numbers, while still declining, have remained relatively stable over the last decade. Other species, like the hyacinth Macaw, are endangered and considered threatened. There are only an estimated 6,500 specimens of these birds left in the wild. Similarly, there are only about 2,000 scarlet Macaws left in the world.",
        "score": 0.71472335
    },
    {
        "Name": "Least Flycatcher",
        "Genus": "Empidonax",
        "Diet": "Insectivore that eats insects",
        "Behavior": "They can be characterized as colonial nesting territorial.Their aggression level is low.",
        "Features": "Bold eyering",
        "Fun_Fact": "They can travel up to 72 miles in a single day.",
        "Text": "The least flycatcher is a small species of bird that mainly eats insects. Despite their size, they are territorial . This means that they are prone to aggression toward other birds, including those much larger than themselves. Least flycatchers, like many other passerines, are a migratory species. These species are common in the western hemisphere. They can be found in several different countries, from Canada to those in Central America . This includes Mexico and the United States as well. Least flycatchers spend the majority of their time in different types of forests and in shrubby fields. The two main forest types where they are found are semi-open deciduous and mixed forests. Least flycatchers of all ages are common here. These habitats are most frequently used during the breeding season. In the winter months, least flycatchers don’t typically stray far from the forests. However, they can be found at the edge of wooded areas, in forested ravines, and in pastures as well. Regardless of the season, least flycatchers tend to avoid higher elevations. Populations settling in Mexico may use tropical forests as their habitat. The breeding pair will work together to choose the right nesting location. Least flycatchers will make their nests in large deciduous trees. They will choose trees with an upright fork anywhere from 2 to 50 feet off the ground. This acts as a means of natural protection and structure for the nest. Female least flycatchers will build the nest. Nests can be made of plant materials such as bark, grasses, and fibers, and they can also feature animal components like spiderwebs, dragonfly wings, and animal fur. The final nest is small, averaging around 2.5 inches wide and 2 inches tall. It takes five to seven days for the female to finish building the nest. During this time frame, you may be able to see her flying to and from the nest in pursuit of materials. The scientific name of the least flycatcher is Empidonax minimus . It is in the Class Aves . This is the scientific class that includes all species of bird. It is in the Order Passeriformes and the Family Tyrannidae . This family, along with Muscicapidae , contains all species of flycatchers. Its genus is Empidonax , of which the least flycatcher is one of the smallest. The least flycatcher is the smallest species of Empidonax in the eastern region of North America. Adults grow to be between 4.7 and 5.5 inches and weigh between 0.3 and 0.8 ounces. Their wingspan measures an average of 7.9 inches. Overall, lest flycatchers have a greyish olive coloration. They have a faint yellow coloring on their chest and belly. Their most notable figures are the bold white eyerings and wing bars they sport. Least flycatchers tend to gather in large flocks within the forest. They tend to be rather vocal, spending the summer months singing as fly from perch to perch. There are little to no significant year-round populations of the least flycatcher in the western hemisphere. During their nonbreeding season, they are found in the southernmost areas of their range. This includes southern Florida , coastal and southern Mexico , and Central America . They are long-distance migrants. During their migratory period between breeding seasons, they can be spotted through central Mexico and the central and eastern United States. Much of their breeding range lies in the northernmost United States and Canada. Insects make up the largest portion of the least flycatcher’s diet. They are known to catch their prey either midair or by plucking them off vegetation. While insects are the main component of their diet, least flycatchers may occasionally eat plant materials as well. Least flycatchers eat a wide variety of insects that are common to their native areas. This includes ants , beetles, butterflies , flies, and leaf hoppers. Nesting material has shown that they may also hunt dragonflies. For the vegetative part of their diets, least flycatchers will eat blackberries, elderberries, and the seeds of different grasses. One of the largest threats to the least flycatcher population is disturbances in the forests they inhabit. This can be both human-influenced, such as logging, or natural, such as excessive grazing from animals like deer. The main characteristic of these disturbances is that they either change the forest canopy or result in large clearings. There are many animals that prey on the least flycatcher. This includes adults, juveniles, and their nests. Some of the many predators of least flycatchers include: Least flycatchers nest in clusters once they reach their breeding grounds. They are not monogamous species. Instead, they participate in a mating style known as extra-pair matings. This means that males and females will find other mates outside of their initial pairing. Cluster nesting is thought to aid in the search for mates and in adding protection for nests inside the cluster. The female will lay three to five eggs. Four eggs are the most common number per brood. The female incubates the eggs for 13 to 16 days while the male defends the territory and brings food to the nest. Once the young hatch, they are completely helpless. It takes 12 to 17 days for them to fledge and fly for the first time. In the meanwhile, both parents will take turns bringing food to the young least flycatchers. This will also continue for up to three weeks after the young fledge. The oldest least flycatcher known in the wild was at least 8 years old. The least flycatcher is a species of least concern . They have a relatively healthy population throughout their range, although it has declined nearly by half in the past half-century. There are an estimated 27 million adult individuals.",
        "score": 0.71395886
    },
    {
        "Name": "Thrush",
        "Diet": "Omnivore that eats insects, worms, snails, spiders",
        "Features": "Their songs",
        "Fun_Fact": "The American robin is called the robin because its red breast reminded European settlers of the robin back in the old country.",
        "Text": "The Thrush is called “Heralds of spring” Thrushes are smallish to medium-sized passerines or songbirds. They have a stocky build and large eyes, sometimes with rings around them. Thrushes are found all over the world and though most of them have rather drab plumage, they are known for the bluish color of their eggs and loved for their beautiful songs. Thrushes are found around the world in woods, the edges of forests and roadsides, and scrubland. It’s also common to see some species in public parks, gardens, orchards, and backyards. Some species of thrush migrate while others don’t. The American robin lives in most of the United States and southern Canada and spends its winters as far south as Guatemala . The common blackbird often migrates from the south of Norway down to Scotland or Ireland , Varied thrushes, which breed in Alaska , Canada , and down to northern California and the mountain states, migrate to southern California during the winters. These birds are known for their cup-shaped nests. the female builds them out of twigs, feathers, grasses, mosses, and bits of paper. She’ll line them with mud then add moss or soft grasses. Thrushes tend to build their nests in trees or shrubbery or even building ledges, but some build their nests on the ground. Most thrushes have two or three broods during their breeding season, and some species use the old nest for the next batch of chicks. Others, like robins , build new nests. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Thrushes belong to the Turdidae family. Turdidae is from the Latin word for thrush, which is turdus . There are at least 20 genera in the family and these genera encompass hundreds of species and subspecies. Genera include: Most thrushes are compact birds that range from the little forest rock thrush of Madagascar to the great thrush of Central and South America . Most species have gray or brown plumage with speckled breasts and bellies, though this is not true for all of them. The male mountain bluebird is a cerulean blue all over and China’s blue whistling thrush has white tips on its purplish-blue feathers that make them seem iridescent. Common blackbirds are completely black, though male ring ouzels are black with a white crescent on the chest. These birds also tend to have large eyes with eye rings, medium-length tails, and long, sturdy legs that allow them to run or hop over terrain as they look for food. Birds that migrate have pointed wings and an ample wingspan that allows them to be a bit more aerodynamic as they fly to and from their wintering grounds. Those birds that live in warmer climates tend to stay there all year, while those who breed in colder climates migrate to warmer places during the winter. Despite the sweetness of their songs, their small size, and their bright eyes, they can be rather aggressive, especially during the breeding season. Thrush parents have no problem seeing off larger predators, including humans. Both male and female birds fight over the best nesting sites and defend their territories with vigor. Outside of the regular season, many species of thrushes can form huge flocks. This includes the fieldfare, which is found in the United Kingdom . This thrush can form flocks of thousands of birds, and they are so in sync that they actually sleep facing the same direction. These birds are omnivores, with a diet of insects and other small invertebrates as well as berries. While they’ll eat the animals on the ground, they will land on trees and shrubs to get at the fruit. A bird that’s hunting for prey on the ground often uses a technique called run and stop. It’ll run or hop little ways, listen for the sound of prey, then zero in on it. They’ll also rummage through fallen leaves and probe rotting wood for prey. The bird eats worms, beetles , grubs, grasshoppers , wasps , caterpillars , and other insect larvae, snails , and slugs. Thrushes have also been known to eat small reptiles and amphibians . They eat soft fruits such as blackberries, raspberries, blueberries, the berries of pyracantha bushes, and rowan trees. A great variety of creatures prey on both adult and baby birds. They include snakes , squirrels , raccoons , weasels , chipmunks , mice, and the scourge of songbirds, the pet cat . These birds are also preyed upon by other birds, including species of jays , crows , ravens , and birds of prey such as owls and sharp-shinned hawks. Even humans used to eat thrushes. These birds are also subject to parasites such as mites, ticks, lice, and louse flies. These parasites can spread Spirochaetes bacteria, which can cause a type of septicemia in birds. These birds start to reproduce in spring, and the song of the male robin who has returned from his winter retreat can be heard even in late winter. Male birds set up a breeding territory and will see another male off of his territory. He may even be aggressive toward an interested female until he realizes her intentions. Other kinds of these birds go through elaborate courtship rituals which include singing and feeding each other. After this, the female builds the nest, either on the ground, in trees, or, in the case of bluebirds , tree cavities. The eggs of thrushes are famously colored shades of blue and may have brown freckles. Most species seem to be monogamous, at least for the breeding season. In most species, the incubation period is about 12 to 14 days. As the female incubates the eggs, the male brings her food. The chicks are helpless when they hatch and are fed by both parents. In some species, the male brings food to the female, who in turn feeds it to the chicks. The parents take care to remove the chicks’ fecal sacs from the nests. The chicks start to fledge when they’re 10 to 15 days old in most cases, but even then they will still follow their parents around and beg for food. Two weeks after they fledge, the chicks can fly reasonably well. In some species, the fledglings remain in their parents’ territory for some weeks. The lifespan of these birds varies. The lifespan of most robins is about two years, but this takes into account the fact that most won’t survive their first year. Some of them have been known to live a decade or more. The population of many of these birds is stable or increasing, and in some species, the population is quite large. Besides the hundreds of millions of robins in the world, there are about 70 million hermit thrushes. However, other species of thrushes have declined, such as the wood thrush. Others have gone extinct, largely due to habitat destruction or overhunting. One was the Grand Cayman thrush of the Caribbean, which was basically hunted to death and probably went extinct in the late 1930s or early 1940s.",
        "score": 0.7133993
    },
    {
        "Name": "Scarlet Macaw",
        "Genus": "Ara",
        "Diet": "Omnivore that enjoys fruit, nuts, nectar, and insects",
        "Features": "Brightly colored plumage",
        "Fun_Fact": "Like many parrots, the scarlet macaw is capable of vocal mimicry.",
        "Text": "Prized for its exceptional beauty and astonishing vocal mimicry, the scarlet macaw is one of the most iconic and beloved parrots around the world. They make their home in the dense rainforests of the Americas , where their loud squawking can be heard for miles around. But despite being a species of least concern, the destruction of the American rainforests is threatening to put this macaw in danger. The scarlet macaw is indigenous to the tropical regions of Central and South America and prefers to inhabit moist evergreen forests situated at elevations between 1,000 and 3,000 feet, primarily residing in the upper layers and canopies of trees in their natural habitat. Through the use of high-accuracy accelerator mass spectrometry (AMS) to date skeletal remains of scarlet macaws (Ara macao), researchers have obtained the initial direct proof originating from Chaco Canyon located in northwestern New Mexico, that Pueblo individuals acquired these Neotropical birds from Mesoamerica, dating as far back as around 900-975 AD. The macaw family encompasses scarlet macaws, which can be categorized into two subtypes, and are capable of imitating human speech, while being the biggest species of parrot and identified by their brightly colored feathers; despite the reduction in their habitat, they are not considered an endangered species. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The scarlet macaw is endemic to the rainforests of Mexico , Central America , and South America , with the greatest concentration living in the Amazon basin . The scarlet macaw makes its nest in the hollow areas of the upper canopies of large trees. The scientific name of the scarlet macaw is Ara macao (the now obsolete Portuguese word from which the name macaw derives). The scarlet macaw is a large bird with a strong, curved beak and brightly colored plumage. It is composed of three distinctive color bands: red on the head and shoulders, yellow on the back and mid-wing feathers, and blue on the wingtips and tail. The face has a patch of black and white skin as well. The scarlet macaw is one of the largest parrots in the world. It measures about 33 inches on average from head to tail; half to a third of this is composed of just the tail. The two sexes are almost completely similar in size and appearance, but males tend to have slightly larger tail feathers and bills. The macaw’s social life revolves around small family units consisting of a mating pair and multiple offspring; they also congregate together in large flocks at night to sleep. These birds show affection for their mates by mutual licking and preening, which can last for hours at a time. They also have the ability to communicate with each other through a large variety of different sounds and postures. Despite their reputation for mimicry, the standard sound of the scarlet macaw is a harsh screeching, squawking, or screaming that can carry for miles. Among the most interesting facts is that the beak functions as a vital instrument of the bird’s survival. It enables the bird to climb trees like a third limb and also crack open tough shells. The macaw has special structures in its mouth that can hold food against the tongue and grind down hard shells and skin. The scarlet macaw is an omnivore; it can eat either meat or plant matter. But perhaps a more accurate description is an herbivore with some specialized carnivorous tendencies. These birds are major consumers of fruits, seeds, nuts, and nectar; it then supplements this with insects and larvae during the breeding season for extra protein. It is believed that these birds gain a competitive advantage over other species by being able to peel away the tougher skin and pulp of unripened fruits with their large, powerful beaks. Its competitors would need to wait until the fruit has ripened before feeding. The bird may consume a lot of toxic plant matter throughout the day; hence why it’s been speculated that the macaw eats clay to counteract the toxins. The number of scarlet macaws appears to be in decline from the loss of the rainforests due to logging and land clearing. This loss is bolstered by the frequency with which it’s poached for sale on the international pet trade and, less commonly, hunted for the value of its feathers and meat. An adult scarlet macaw is sometimes preyed upon by jaguars , eagles , and hawks. Baby macaws are also put in danger by snakes , monkeys , and other carnivores. These birds’ mating strategy involves the formation of very close pair bonds that last for life. This allows both parents to maintain a nest and invest enormous resources into the care of each baby. After mating, the female produces a clutch of two to four white eggs that need to be incubated by her for about three to four weeks. The parents feed the baby chicks by regurgitating liquefied food (sometimes up to 15 feedings a day). The chicks will grow their full-flight feathers in about three or four months, but they won’t actually leave the nest until about one or two years of age, perhaps because of the extra time it requires to teach the young the nuances of macaw life. The couple won’t reproduce again until the previous chicks have left the nest. These birds will begin reproducing on their own after about three to four years. They typically have a lifespan of some 40 to 50 years in the wild, but some have been known to survive up to 75 years in captivity. It is estimated that there are some 20,000 to 50,000 of these birds remaining in the wild. The IUCN Red List currently classifies this as a species of least concern, but habitat loss has caused numbers to decline precipitously. Already, the northern populations are becoming endangered in Mexico , Panama , Belize , and Costa Rica , and it is almost completely gone from El Salvador . Some of the Amazonian populations are under strain as well. In order to halt this decline, it will be necessary to slow the loss of rainforests and engage with local communities to end poaching. This will need to be done in conjunction with the reintroduction of macaws into former parts of their territory.",
        "score": 0.71219575
    },
    {
        "Name": "Carolina Parakeet",
        "Genus": "†Conuropsis",
        "Diet": "Omnivore that enjoys fruits, seeds, flowers, and insects",
        "Features": "The brightly colored plumage",
        "Fun_Fact": "The Carolina parakeet is one of the few parrots that lived as far north as the United States",
        "Text": "Dazzling in its brightly colored plumage, the Carolina parakeet was one of the few parrot species native to the United States . Sightings were once fairly common in the east, but population numbers dwindled rapidly over the centuries from a combination of different factors, many of them human-induced but some natural. The last recorded specimen died at the Cincinnati Zoo in 1918 before it was declared officially extinct in 1939. Much of what we know about this species is based on anecdotes or the study of captive or dead specimens. The Carolina parakeet was once found across parts of the eastern United States . Woodlands next to swamps or rivers were its preferred habitat. There is still some debate about its true range, however. It was once believed that the fringes of its natural habitat extended as far west as Colorado and as far north or east as New York. But this map was based upon only a few known historical sightings in certain states. A reconstructed map from 2017 suggests a more constricted range. One subspecies probably inhabited Florida and the surrounding coasts, while the other subspecies were shifted toward the interior of the United States, from Kansas to Ohio. This species constructed its nest in small tree hollows out of basic plant materials. The scientific name of the Carolina parakeet is Conuropsis carolinensis . Carolinensis is obviously a Latin version of Carolina. The genus name Conuropsis , of which this species was the last living member, appears to derive from the term conure, which describes several species of small to medium-sized parrots. Some people use conure and parakeet interchangeably to mean the same thing, but conure is a bird-keeping term more than an actual scientific term. This species belonged to the family of true parrots, Psittacidae, which also includes the iconic Scarlet macaw . When it was still alive, the Carolina parakeet could claim to be one of the most colorful native birds in all of the United States. They had bright green or blue plumage on the body, yellow around the neck, and red or orange around the face. Males were slightly larger than females, potentially measuring nearly 14 inches from head to tail, but otherwise, their plumage was exactly the same. This species also had a big, sharp beak, well-adapted for cracking open nuts and seeds. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Carolina parakeets traveled in flocks of 100 to 1,000 birds at a time. They were not known to be migratory over long distances, since they mostly stayed within 30 miles of their home range, but some populations may have moved around slightly to cope with the harsh winter. Social cohesion was an important aspect of their behavior. They were known to engage in mutual preening and scratching to reinforce their bonds with each other and keep clean. Foraging for food occurred near the onset of sunrise and sunset, while most of the daylight hours were spent resting, roosting, and bathing. The Carolina parakeet was known to emit a harsh shrill as a warning call in the presence of nearby predators. It was mostly silent while roosting, but it did make quite a loud cacophony of noises while in flight. The Carolina parakeet was an omnivorous species. It held food in place with its claws and tore it apart with the beak. The Carolina parakeet consumed the fruits and seeds of many different plants and trees, including the beech, elm, sycamore, maple, oak, and pine, which it then supplemented with insects for extra protein, but the cocklebur appeared to be their favorite food. Carolina parakeets also apparently consumed salt licks and possibly saline water in order to add a bit of salt to their diet. This parakeet is completely extinct in the wild. Deforestation and hunting are blamed as the primary culprits; the arrival of European settlers marked the beginning of the end for them. But the spread of diseases and other natural problems may have played a secondary role as numbers declined and the species became more susceptible to negative shocks. This parakeet was preyed upon by hawks, eagles , and other birds of prey. Eggs and chicks were often the targets of raccoons , skunks , squirrels , and snakes . Many facts about the bird’s reproductive habits were poorly documented at the time. Some contemporary sources claimed this species was monogamous, but there were also reports that multiple birds shared nests together. What we do know is that the Carolina parakeet mated in the spring and produced between two and five eggs at a time. The chicks were born with entirely green plumage and pale underparts. After about 20 days, the young parakeets would gain their full-flight feathers and be ready to fly. It was believed that both parents played an important role in raising and feeding the young. After a year, the young parakeet would develop its adult plumage and become sexually mature. The species was relatively long-lived. It could survive up to 30 years in captivity. No members of this species are currently alive today. Because of deforestation, hunting, and other factors, it entered a precipitous period of decline in the 18th and 19th centuries from which it never could recover. By the end of the 19th century, populations appeared to be in a state of total collapse. The last known member of the species died in 1918.",
        "score": 0.7117715
    },
    {
        "Name": "Dark Eyed Junco 2",
        "Diet": "Omnivore that eats plants, small fruits, and grains, spiders, insects",
        "Behavior": "They usually live in flocks.",
        "Fun_Fact": "They are called snowbirds because many subspecies reappear in the winter.",
        "Text": "The Dark-Eyed Junco is also known as the Snowbird in the United States . They’re in the sparrow family, and the resemblance is clear, though they’re smaller than most sparrows. It has an extensive list of sub-species found in various regions and their range of colors is quite diverse as well. You would find them in various shades, spread all over the country. They often reappear in the winter, which is why they are called the Snowbird. If you are seeking a Dark-Eyed Junco, the most ideal location is the forests that are spread across North America. However, you may find them in various woodland areas. To be more specific, you will need to explore the coniferous forests and the deciduous forests . These forests include pine, Douglas-fir, spruce, fir, aspen, cottonwood, oak, maple, and hickory trees. A common way to identify these birds is by their white outer-tail feathers. They frequently perch atop trees or are found high up in the sky, at an elevation of 11,000 feet above sea level. But you can also spot them walking on the ground. All you need to do is listen out for their twittering call. The noise is a high-pitched but sweet trill that seems similar to a Chipping Sparrow . You might not even have to pick up your bags for a hike in the forests. If you are lucky, you can find them in parks , roadsides, gardens, and even fields during the winter season. But the best time to find them is during the month of October when they are together in flocks. The nest of the Dark-Eyed Junco is created by the female but guarded by a male . It is made up of fine grass, weeds, leaves, and sometimes, hairs and feathers. You will have to do a bit of work to find them because they are always well-hidden. Either the nest is behind hanging grass, tucked away in shallow holes, or behind rocks. However, in some rare cases, you may find the nest in buildings or a tree but it won’t be much higher than 10 inches above the ground. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . They generally lay 3 – 6 eggs that have a whitish, grayish, or pale bluish appearance. The eggs hatch after 9 to 13 days and the young are protected and fed by both parents. The Dark-Eyed Junco, also known as the Snowbird, was previously named Fringilla hyemalis . But since 1831, it is now called the Junco hyemalis which is Spanish in origin. It belongs to the Class Aves and the Family Passerellidae . It has a number of sub-species, 15 to be exact. Out of them, six were regarded as different species until they were found mating. There are five main groups; the White-winged group, the Oregon group, the Red-backed group, the Grey-Headed group, and the Brown-Backed group. Here is the list of the sub-species of the Dark-Eyed Junco; These birds resemble a medium-sized sparrow that has a short head and body but a long and slender tail. It measures up to 5.5-6.3 inches in length and weighs around 0.6-1.1 ounces. As for its wingspan, it may spread up to 7.1-9.8 inches. It is present all over the continent in various colors but the most common is the one that is grey with a white stomach. There is no obvious difference between males and females but the latter is somewhat paler than the former. They are easily identifiable due to the white feathers on their tails. However, its tail opens up during flight which the average person may not notice. The migration season begins around October and lasts till March or April. It is usually carried out around nighttime so it might be harder to spot. But one thing that remains a fact is that females tend to migrate longer distances than males. The mortality rate, however, is more or less the same because females do survive the migration season with ease but are unable to cope during the winters. They do not travel in groups. You will find flocks of them gathered pre-flight or even post-flight but they are never together during the flight. The diet of a Dark-Eyed Junco mainly includes seeds and insects . Like any other sparrow , the diet and foraging behavior is almost similar. The foraging methods include gleaning, pecking, and scratching. During the breeding season, you will find these birds gobbling up seeds from grassy plants, small fruits, and grains. But during the breeding season, they prefer to eat arthropods like spiders and other insects, depending upon availability. They do this to maximize protein intake for stronger babies. These little birds have many predators. Some of them are sharp-shinned hawks , shrikes, and owls . But cats , either domesticated or wild, also have a liking for eating Dark-Eyed Juncos. Climate change is one big threat to the bird , as it is to all wildlife. With an increase in temperatures, the population of the Dark-Eyed Junco will be a big target during the summer season when the temperature can increase by 1.5 degrees to 3 degrees. As a result, throughout Northern America, half of its population may be lost. The Dark-Eyed Junco does not face any current threats to its population size. It belongs to the Least Concern category in its conservation status. The mating is usually done on the ground by a little dance of hopping around here and there. The males usually end up singing to attract the females. The mating behavior of the Dark-Eyed Junco is quite different. Neither gender pairs and mates with just one partner. Rather, females breed with neighboring males that stand guard on nests. Males will also mate with other females and are also found protecting babies that are not their own. The Dark-Eyed Junco lay three to five eggs per the breeding season. Very rarely, you will find a sixth egg in the bunch, too. They are white to blue or grey in color and hatch after 11 to 13 days of the incubation period. After hatching, the young may be reliant upon both parents for food. The male stands guard near the nest. The young leave the nest after 9 to 12 days after hatching. They are called fledglings. The oldest Dark-Eyed Junco to date is of 11 years and 4 months. However, they may live anywhere between 3 to 11 years. The population size of the Dark-Eyed Junco, at an estimate, stands proudly at 630 million individuals. They are also considered in the Least Concern category of Endangered Species . They are one of the most common birds in North America and are found to a large extent, either migrating or residing in forests and woodland areas. It cannot be determined whether they are decreasing or increasing in number but a big threat of climate change looms over their population. Have a look at a few of our other bird articles!",
        "score": 0.71134025
    },
    {
        "Name": "Western Kingbird",
        "Genus": "Tyrannus",
        "Diet": "Omnivore that eats insects, arachnids",
        "Behavior": "They can be characterized as solitary except during mating season.",
        "Features": "Yellow belly",
        "Fun_Fact": "Western kingbirds have hidden red crown feathers that they can raise when threatened!",
        "Text": "“Western kingbirds have hidden red crown feathers that they can raise when threatened!” The western kingbird is a large species of tyrant flycatcher native to North America. They are aggressive when necessary and are known to chase away other birds that tread too close. This includes larger birds of prey, like red-tailed hawks. They are common in rural backyards, and, though they typically eat a diet of invertebrates, they may occasionally eat berries as well. The western kingbird is native only to North America. They reside in the western region of the continent, although they winter as far east as Costa Rica and Florida. During the breeding season, you can find them in the northernmost extent of their range, from northern Mexico up to southern Canada. They winter in Florida and along the southernmost coasts of Mexico and Central America, with their migratory locations spanning the gap between winter and breeding grounds. This species is often found in open grasslands, or on woodland edges near these habitats. However, they also have a tendency to reside in human structures, building their nests on utility poles, fence posts, and similar areas. As of now, it is unclear whether the male or the female in the breeding pair will choose the nesting location. However, what is known is that both individuals will visit potential nesting locations. Typical areas for the western kingbird to build its nest include different trees, such as cottonwood or pecan trees, as well as man-made structures. While it isn’t known which of the pair chooses the nesting location, the female is responsible for constructing the nest. She weaves together a variety of different plant materials, including bark, rootlets, and stems, to create an open cup. Once the skeleton of the nest is made, the female will line the inside of the nest with soft material. This includes wool, feathers, and cloth. The final nest measures around 6 inches wide and 4 inches deep, although the usable, inner cup of the nest is half that size. The scientific name of the western kingbird is Tyrannus verticalis . It is in the class Aves , which contains all species of birds, and in the order Passeriformes . It is in the family Tyrannidae , which is the family of tyrant flycatchers. The western kingbird is a large flycatcher lacking sexual dimorphism. This means that males and females of the species look the same. They sport grey heads, with pale throats and a yellow belly. The tail is black with the outer feathers being white. Both sexes of this species sport a reddish-orange crown. These colorful feathers are located around the top of the head and are often concealed by the outer grey feathers. The adult western kingbird will grow to be 7.9 to 9.4 inches in length. On average, they weigh 1.3 to 1.6 ounces. What is most impressive is their wingspan, which is often between 15.0 and 16.1 inches. These birds are most often seen perching. Weather on natural structures, such as trees or shrubs, are man-made structures such as fences, they often sit and watch for nearby prey and predators. They capture their prey while flying, whether that includes capturing a nearby, airborne insect or plucking one from the ground or plants while hovering. They are aggressive only in that they are territorial. They will defend their territory using a variety of calls and gestures. When necessary, they may also attack intruders in their territory, as is often the case when encountering crows. The western kingbird is a medium- to long-distance migrant with no significant year-round populations. They begin their southward migration at the end of the summer period. This species winters most often in Mexico and Central America, along with the southernmost tip of the Florida panhandle. Prior to arriving in their winter grounds, they will stop along the route, appearing in states such as New Mexico and Arizona. Come spring, these birds will migrate north again for the breeding season, often appearing in the same migratory states as they did when traveling southward. Like other species of tyrant flycatchers, the western kingbird is primarily an insectivore. They hunt in the air during the day, often catching more than one insect to return to their perch with. Not only do they catch insects in flight, but they may also occasionally pluck terrestrial prey from the ground as well as from plants while hovering. Although insects make up the majority of their diet, they may also eat certain plant materials, namely berries. Other invertebrates, such as arachnids, are often consumed. Some of the plant and animal matter western kings will consume include: Although western kingbirds gain benefits from human influence, such as additional perching and nesting locations, there are also several threats they face as a result of humans. One of the main threats is agricultural pollution. As insectivores, these flycatchers consume a large number of invertebrates, and their fondness for open spaces often leaves them hunting near crop fields. This can result in these kingbirds consuming animals affected by pesticides. There are also natural threats. This includes those such as storms and predators. Western kingbirds may fall prey to a variety of different animals. This includes Western kingbird pairs are monogamous. Males will arrive at the breeding grounds first, and, once mated, will defend the territory with the female. Together, the pair will protect and raise their young, remaining nearby to help the fledglings up to three weeks after they leave the nest. For the rest of the year, western kingbirds are solitary. These birds can lay anywhere from 2 to 7 eggs. These eggs are small, averaging at 0.9 inches in length and 0.7 inches in width. The outer shell of the egg is white or pinkish, with large blotches in colors such as brown, black, or even lavender. The incubation period for the western kingbird is 12 to 19 days. The hatchlings will emerge with their eyes closed and only a sparse covering of down, rendering them helpless without their parents. The nesting period lasts 12 to 19 days, after which the young fledge and leave the nest. However, as mentioned above, the parents will continue to help the young kingbirds for up to three weeks after this point. During their southward migration to their wintering habitats, adults will undergo a complete molt. This species has an average lifespan of around 6 years. The western kingbird is a species of least concern . Between 1966 and 2019, they maintained an overall stable population with no significant, long-term inclines or declines. It is estimated that the global breeding population totals around 30 million. The largest changes in this species’ population are often seen on a local level rather than global. Temporary changes, such as an increase in predation or natural disasters, can impact birds in that area without harming the total population. Western kingbirds have also proven an ability to rebound quickly after declines, allowing them to maintain their population.",
        "score": 0.71133965
    },
    {
        "Name": "Northern Pintail",
        "Genus": "Anas",
        "Behavior": "They can be characterized as social.",
        "Fun_Fact": "Northern pintails migrate at night with speeds reaching 48 miles per hour!",
        "Text": "“Northern pintails migrate at night with speeds reaching 48 miles per hour!” The northern pintail is a species of dabbling duck native to the majority of the world. Despite having such a large range of migration, there are no known geographical subspecies. They are known for their long necks and tails. It is not uncommon to find large groups of northern pintails flocking together. The pintail is common in North America, Europe, Africa , and Asia. They can also be found in the northwesternmost region of Colombia. During the breeding season, pintails flock together in Canada as well as the northernmost regions of the United States and Europe. This includes countries such as Sweden, Russia, and Denmark. Outside of the breeding season, you can find them throughout North America, excluding Canada, Colombia, western Europe, the central regions of Africa, and the southern regions of Asia. This species of duck thrives in a variety of habitats. Overall, however, they prefer rather open areas with water. This includes wetlands, wet meadows, and agricultural fields. They may also breed in grasslands and other areas with short vegetation. Outside of the breeding season, once they move further south, you can find northern pintails in lakes, estuaries, and bays, along with wetlands and agricultural fields. Although they may be seen swimming with other species of waterfowl, you can also expect to see flocks of pintails foraging along the shallow water they inhabit. Northern pintails nest on the ground. During the breeding season, both the male and female of the breeding pair will search for the right nesting location via flight. This includes seasonal wetlands and even tilled croplands, which is rare for different species of ducks. Once the pair have decided on the right place to build their nest and rear their offspring, the female begins constructing the nest. She digs into the ground to create a small depression. She will then begin to add grasses to create a shallow nest. Once finished, the pintail’s nest is up to ten inches wide, and it is around two to four inches deep. The scientific name for the northern pintail is Anas acuta , as first described by Carl Linnaeus in 1758. Both words are of Latin origin, with anas meaning ‘duck’ and acuta meaning ‘sharp.’ As a result, their scientific name refers to their elegant, elongated appearance and the male’s pointed tail feathers. The pintail is in the Class Aves , and they are a part of the Order Anseriformes along with all other waterfowl. They are in the Family Anatidae , which includes ducks, geese, and swans. The pintail is a medium-sized duck, one that is larger than green-winged teal but smaller than a mallard. Adults of both sexes can grow to be between 20.1 to 29.9 inches in length. Their wingspan is only slightly larger than their body length at 34 inches from wingtip to wingtip. Adults can vary greatly in weight depending on their size, habitat, and diet. Most adults average between 17.6 and 51.1 ounces. Northern pintails are known for their long necks and slim facial profiles. They have a sleek, sloped beak that is black. In both sexes, the tail is long and comes to a defined point, although the latter is more noticeable in males of the species rather than females. Breeding males have a chocolate-brown colored head with a bright white chest and neck marking. Their green speculum is visible in flight, though it is bronze in females. Both sexes sport a grey and white back, although females and males that are undergoing the molting process will sport an unmarked grey or tan face instead of the male’s striking brown plumage. As dabbling ducks, pintails can often be seen floating along the surface of the water. When hunting, they will duck their heads into the water, leaving their tail feathers in the air. Out of the water, they can be seen waddling along the edge of their preferred water source. Northern pintails readily form large flocks with each other, as well as with members of other species outside of the breeding season. As social birds, confrontation is rare. However, males may break out into occasional fights involving a pecking attack and chasing on the water’s surface. Northern pintails will migrate to and from their breeding grounds in large groups. In the sky, they make a notable wavy line. They are long-distance migrants, spending their breeding summers in the far north of the North American continent and the rest of the year in the southern regions. This is also true for other continents, where they breed in the same period before migrating to the south. One individual once migrated and traveled 1800 miles without stopping. Not only are they a long-distance migratory species, but they are also a rapid migrator. They are one of the first species of ducks to migrate south to the winter region during the appropriate time following the summer breeding season. This species is made up of omnivores. As dabbling ducks, they dip their heads into the water to skim for small animals. They will also eat different types of plants and plant parts. These are often picked up while the northern pintail is walking, although they may also eat aquatic plants in shallower areas. Northern pintails are not apex predators. However, they are still effective hunters with a wide variety of prey. Some of the animals that northern pintails will eat include: As for the plant matter aspects of their diet, northern pintails eat: One of the largest threats to the pintail population is avian diseases. These conditions, such as avian botulism, can cause significant creases in population, especially in the United States. These species may also become prey to a variety of different predators. Living both inland and on water, the pintail, as well as their young, may be exposed to a variety of different predators. Some of the animals that may eat the pintail include: The female northern pintail will produce one brood per year. However, the male may also breed with other females nearby in their breeding territory despite forming a breeding pair with a specific female. Pairs will only stay together for the breeding season. Each brood can contain between three and twelve eggs. These eggs are rather large in size compared to other birds, with some measuring over two inches in length. Incubation of these eggs takes between 22 and 24 days. Once the young northern pintails, known as ducklings, hatch, they are covered in down. Often, they are able to leave the nest soon after they emerge from their eggs. The northern pintail can live to be up to 22 years old. They molt in the late summer as adults, rendering them flightless. The northern pintail is listed as a species of least concern , despite having significant declines recorded in their populations in recent decades. There is a global breeding population of around 5.1 million.",
        "score": 0.71106076
    },
    {
        "Name": "Mockingbird",
        "Diet": "Omnivore that eats insects, spiders, land crabs, snails, earthworms, other invertebrates, lizards, baby turtles and enjoys besides , berries fruits",
        "Behavior": "They usually live in pairs and can be characterized as solitary.Their aggression level is high.",
        "Features": "Ability to sing many songs and mimic birds and other animals.",
        "Fun_Fact": "Mockingbirds are incredible mimics that can learn hundreds of songs!",
        "Text": "Mockingbirds are incredible mimics that can learn up to 200 songs! There are 14 different species of mockingbirds, including the Northern Mockingbird, which lives in the United States, southern Canada, Mexico and parts of the Caribbean. The rest live further south, from Mexico through Central America, the Caribbean, and South America. Some live on islands and others on the mainland. These birds are mostly the same shape, and close to the same size. Most of the species are shades of gray with accents of white. One species is brown on its back, while two other species are mostly blue. They are all proficient singers, mastering the songs of other birds and composing tunes of their own. They are also aggressive fighters, ready to take on anyone or anything that invades their territory. These songbirds live in the Western Hemisphere. The Mimus varieties range from Mexico through Central and South America. Some live in the Caribbean. Most are named for where they live or what they look like. The Northern Mockingbird, for instance, ranges from southern Canada through the United States and into Mexico and the Caribbean. It has the northernmost range of all the Mimidae species. The Bahama Mockingbird, not surprisingly, lives in the Caribbean, primarily in the Bahamas. Meanwhile, the Patagonian Mockingbird lives primarily in the Patagonian region of Argentina and Chile. The Chilean Mockingbird lives only in Chile, west of the Andes. The Tropical Mockingbird lives in the tropical regions of Central and South America and on the coast of Brazil. And the critically endangered Socorro Mockingbird lives on the tiny Mexican island of Socorro. The Galápagos Mockingbird, the endangered Floreana Mockingbird, the vulnerable Española Mockingbird and the near threatened San Cristobal Mockingbird all live in the Galápagos Islands. The Chalk-browed Mockingbird, the Brown-backed Mockingbird, the White-banded Mockingbird and the Long-tailed Mockingbird are all Mimus species native to South America. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Melanotis genus includes the Blue Mockingbird, which lives in Mexico, and the Blue-and-white Mockingbird, which lives in Mexico and Central America. Mockingbirds inhabit a variety of habitats. They often live in forest edges, but not deep within dense forests. They frequently make their homes in desert scrublands, savannas and grasslands, amongst shrubs and thickets, farms, open pastures, and parks. Mockingbirds prefer sparse trees and open areas with shrubs, hedges, or other cover. These birds are just as comfortable in rural and remote areas as they are in suburban or even urban settings. These birds build their nests from materials easily found in their environment. They are generally cup shaped with a loose base made of twigs. The birds line the nests with whatever softer materials they can find, including grasses, rootlets, cotton or other soft fibers, and even bits of paper. Mockingbirds belong to the Mimidae family. This family also includes catbirds, thrashers and tremblers, all of which somewhat resemble one another. Mockingbirds all originally belonged to the genus Orpheus , as described by Swainson in 1828. Today they belong to either the genus Mimus , meaning mimic, or the genus Melanotis , meaning black-eared. Four species from the Galápagos Islands belonged to a separate genus, Nesomimus , for a long time, but they were absorbed into the Mimus genus in 2007 . Within the genus Mimus , there are 14 different species. The Northern Mockingbird, Mimus polyglottos , is the only one that is regularly seen in the United States. This bird’s scientific name is Latin, meaning many-tongued mimic. Mockingbirds all look similar, at least with regard to their shape. They are a bit larger than the average passerine, with lengths ranging from about 8 to 11 inches. They have a somewhat sleek appearance, probably due to their long, pointed bills and their tails, which can be as long as the rest of their body. Their legs are on the lengthy side as well. Most of the Mimus species are shades of gray with various markings, including white stripes and bands. The Brown-backed Mockingbird is similar, but it has a brown back. The Melanotis varieties are similarly shaped, but they differ in color from the Mimus birds. The Blue Mockingbird is, you guessed it, blue. And the Blue-and-white Mockingbird has blue feathers on its upper parts and white plumage below. Both have black masks that extend from their bills, covering their lores, to well past their eyes. Mockingbirds are known for their songs. They are incredible mimics and can actually learn up to 200 songs! They sing throughout the day, and sometimes into the night. Interestingly, they do not just mimic other birds. They can also mimic such animals as cats, dogs, and even frogs . People have long marveled at the vocal repertoire of these remarkable birds. Mockingbirds engage in defensive posturing with raised wings and make alarm calls to try to frighten away potential threats. According to Dave Gammon, a professor who studies these birds extensively, the Northern Mockingbird uses different alarm calls specific to different predators. “Specifically, mockingbirds ‘chat’ for the cats, ‘scream’ at the crows and ‘chuck’ for the snakes,” Gammon explained. These birds are aggressive, especially when defending their nests. They will even chase other birds and dive bomb humans and other animals to drive them away from their nests. They are also quite intelligent; they can recognize human faces , and react more aggressively to people who have invaded their space before. Mockingbirds do not tend to flock together. They are mostly solitary except when they are engaged in a breeding pair. Some of these birds migrate, but many, even within the same species, stay in the same place year-round. Some are endemic to very small areas and do not migrate at all. Mockingbirds are omnivores. Depending on their location, the widespread species eat a variety of different foods. Northern Mockingbirds eat many types of invertebrates, including insects, spiders, earthworms , crustaceans, snails, and more. They also eat small lizards. During the fall and winter, especially, they eat more seeds, berries and other fruits, both wild and cultivated. Some species have a more varied diet than others. Several species eat the eggs of other birds and lizards. A few, such as the Bahama Mockingbird, supplement their diet with nectar. The Socorro Mockingbird eats terrestrial crabs in addition to more common invertebrate prey. And the species native to the Galápagos Islands eat baby turtles, the blood of injured birds, and just about any kind of dead animals they can find. Mockingbirds form mostly monogamous pairs based on mutual selection. Sometimes the birds are polygynous, and sometimes they switch mates between clutches during a breeding season. These birds build their nests low in trees, usually no higher than 10 feet, and sometimes in a cactus or a shrub. In some species both males and females work together to build the nest. In other species the female does the work alone. The female lays her eggs in the cup-shaped nest with a base of twigs and lined with softer materials. Different species of mockingbirds lay different numbers of eggs. The average seems to be 3 to 4 eggs. Females incubate the eggs, while males often assist with feeding the nestlings. Incubation takes 12 to 13 days in Northern Mockingbirds, and the chicks fledge after about 12 more days. The male cares for the young for a while after they leave the nest while the female begins building a new nest. This species reaches sexual maturity in about one year, and usually has 2 to 4 broods each year. Not as much is known about the reproductive behavior of the other species. A study from 2011 revealed that cats are the greatest threat to Northern Mockingbirds in urban areas by far. Domestic cats accounted for 70 percent of the attacks in areas with a high human population. Of course, other animals also prey on mockingbirds. Hawks , owls , snakes , and crows are frequent predators. Eggs and chicks are also eaten by a number of nest predators, including snakes, jays , raccoons , and squirrels . Other threats include habitat degradation and fragmentation, especially for species with smaller ranges. Storms, fires, and other natural events are particularly threatening to species that live in already troubled ecosystems. Accidents, such as window strikes, can take a toll on birds in urban areas. And human persecution is a factor, perhaps due to the territorial aggressiveness and fruit-loving nature of these birds. Little is known about the lifespan of most of the mockingbird species. The Northern Mockingbird lives approximately 8 years in the wild. It lives as long as 20 years in captivity. The IUCN Red List for Threatened Species lists the majority of these birds as species of least concern. These species have strong numbers and at least an adequate range to overcome habitat fragmentation and other pressures. Unfortunately, some of the species are not doing as well. The San Cristóbal Mockingbird is near threatened with a stable population but a range limited to a single island. Endemic to two small islands, the Española Mockingbird is vulnerable with a population of only 600 to 1,700. The Floreana Mockingbird is currently endangered, but has spent much of the last 20 years listed as critically endangered, its population perilously low. And the Socorro Mockingbird is critically endangered, with a tiny range and possibly fewer than 200 mature individuals remaining.",
        "score": 0.70998573
    },
    {
        "Name": "White Crowned Sparrow",
        "Genus": "Zonotrichia",
        "Diet": "Omnivore that eats seeds, vegetation, and insects",
        "Behavior": "They can be characterized as social.",
        "Features": "Black and white stripes on their head",
        "Fun_Fact": "Males learn distinct songs from the community they grew up in and continue to sing in the same dialect as adults.",
        "Text": "“They have different song dialects and prefer to sing the one they grew up with.” The white-crowned sparrow ( Zonotrichia leucophrys) is a medium-sized New World sparrow native to North America. It inhabits alpine meadows and tundra in Alaska and Northern Canada but chooses to stay in thickets and backyards in its US and Mexico wintering homes. These birds have interesting songs, can fly long distances, and have social personalities. Discover everything there is to know about the white-crowned sparrow! The white-crowned sparrow lives in at least five countries in North America, including Canada , the United States , Mexico, the Bahamas, and Cuba. Some populations are year-round residents in their Pacific Coast homes in the US, while those who breed in Alaska and Northern Canada migrate south to the United States and Mexico. They inhabit open spaces like tundra, alpine meadows, and forest edges during breeding. In the winter, you can find them in thickets, backyards, and agricultural fields. Look for them hopping about on the ground or tree branches, often in flocks during the winter. And listen for their sweet whistles. The nest is placed on the ground in a shallow depression near the base of shrubs or grass in the northern regions. Populations further south tend to put theirs in shrubs a few feet off the ground. Females build the nest by forming an open cup made of grass, twigs, weeds, and bark. They line the inside with soft grass, feathers, and animal hair. The white-crowned sparrow ( Zonotrichia leucophrys ) is from the Passerellidae family, a group of New World passerine birds. Its genus, Zonotrichia, contains five American sparrows, four of which are in North America . Zonotrichia is Ancient Greek for “band” and “hair,” and Leucophrys means “white” and “eyebrow.” There are five recognized subspecies of white-crowned sparrows. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The white-crowned sparrow is a medium-sized New World sparrow featuring a small bill and a long tail. They measure 5.9 to 6.3 inches long and weigh 0.9 to one ounce, with an 8.3 to 9.4-inch wingspan. Their wings and upper body parts are brown and heavily streaked, while their undersides are gray. They have black and white stripes on their heads, gray faces, and pink or yellow bills. These sparrows spend their days hopping around on branches or the ground near bushes and trees. They are relatively social, forming pairs during the breeding season and foraging in flocks in winter. They are strong fliers that can travel 300 miles in one night! Their songs are thin, sweet whistles followed by buzzy notes. Males learn distinct songs from the community they grew up in and continue to sing in the same dialect as adults. Some males can be bilingual, singing in two dialects. White-crowned sparrows are residents or medium-distance migrants. Those that breed in Alaska and Northern Canada migrate to most of the US and Mexico during winter. Populations along the US Pacific Coast and the interior west stay year-round in their environments. White-crowned sparrows are omnivores who forage in flocks. They primarily eat seeds, vegetation, and insects. This sparrow mainly eats weed and grass seeds during the winter and insects and spiders in the summer. Throughout most seasons, they feed on buds, moss, flowers, berries, and small pieces of fruit. They forage in flocks outside the nesting season and find their food by hopping and running on the ground. Occasionally, you will find them in low-lying shrubs or mid-air as they jump out to catch flying insects. The IUCN lists the white-crowned sparrow as LC or “least concern.” Due to its extensive range and extremely large and stable population, this species does not meet the thresholds for “threatened” status. While nothing immediate threatens their population, the white-crowned sparrow could suffer the effects of climate change in the future. They are highly susceptible to habitat loss from wildfires and endangered young from spring heat waves. Their primary predators include large birds like crows , jays, owls, and hawks. Snakes are also known to steal eggs from their nest. These sparrows are naturally alert birds who rely on camouflage and their flying ability to defend themselves most of the time. Males are typically more aggressive towards different bird species than their own. They may fly towards intruders with their crown feathers erect and chest puffed out while singing loudly. White-crowned sparrows are monogamous during the breeding season, and some may partner with the same mate during the following season. Females lay between two and six (four to five on average) pale green eggs with reddish brown spots. Females incubate by themselves for 11 to 14 days, and both parents assist in feeding the nestlings (mainly insects). The young fledge the nest seven to twelve days after hatching, but the males continue to care for them while the females begin their second nesting attempt. Populations in the northern regions typically only lay one breed per year, but those further south can have up to four. These sparrows are sexually mature by one-year-old. They have an average lifespan of 2.6 years in the wild but can live up to 13. The global white-crowned sparrow population is estimated to number 79 million mature individuals. From 1970 to 2017, their population underwent a slight decline of 0.3% per year. However, their numbers have been considered stable for the last ten years, with no extreme fluctuations or fragmentations.",
        "score": 0.7098723
    },
    {
        "Name": "Sandhill Crane",
        "Genus": "Antigone",
        "Diet": "Herbivore that eats occasional small mammals",
        "Behavior": "They usually live in family units flock.Their aggression level is low.",
        "Text": "They’re best known for their huge annual migrations that can blot out the sun. Whether they’re elegantly hunting in a stream or migrating by the thousands, the Sandhill Crane is a beautiful and elegant bird that is sure to draw your eye. Their tall, grey bodies stand out against the green meadows they’re commonly found in. During migration season, nearly 450,000 of these birds fill the sky. Because Sandhill Cranes are so large, they are easy to find. You can spot them throughout North America if you go to the right spot. They are pretty populous, though some isolated populations in Cuba are endangered. During the summer, they spend a lot of time in marshes and bogs across the southeastern United States . In winter, they form very big flocks and travel to places like Texas and New Mexico. You can often hear their sounds from miles away, so you’ll know when a population is close. These cranes prefer to isolate in isolated wetlands, which is why they are common in bogs and marches. They will nest within 300 yards of a larger wetland or within shallower areas. Often, they will nest in standing water on vegetation, though some will nest on dry ground. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . However, we don’t know much about why different birds choose different sites. We also don’t know if males or females choose the site. With that said, we do know that a crane may re-use a nesting site with a new mate if their old mate dies. The nests are built from vegetation, including sedges, cattails, bulrushes, and grasses. Early in the season, they use mostly dried plant materials. However, some birds add green materials as the season progresses to repair the nest. Using these larger materials, the birds will make a bowl-like nest, which they then line with smaller stems and leaves. Both mates build the nest, though the female arranges the materials carefully. (In comparison, most males just make a mound.) The Sandhill Crane belongs to the genus of large birds calls Antigone. This genus comprises four different species, which are all larger cranes. This genus spans the world, with species as far as China and Australia. As you’d guess, this species belongs to the larger crane family called Gruidae. This family contains three genera with 15 different species. This family does not include herons , despite the fact that herons and cranes look similar. They aren’t super related. Cranes belong to the order Gruiformes, which contains a number of different bird families. All of these species are “crane-like,” though that doesn’t mean that they are technically cranes. Overall, the adult Sandhill Cranes are grey. However, they are usually stained with mud due to their tendency to stay near water, so they often look ochre. Usually, males weigh around 10 pounds, while females weigh closer to 9 pounds. However, certain birds can range from 6 pounds to 15 pounds. Their bills are very dark, long, and pointy. They look, for lack of a better description, like cranes. In flight, you’ll notice their long, black legs trailing behind their body. These cranes are well known for their loud, trumpeting calls. They have a unique windpipe that makes this sort of call possible. Mated pairs will call in unison to help them stay together and communicate. Often, these pairs are known for singing “duets” as well. These cranes have pretty long wingspans at around 5 feet 5 inches to 7 feet 7 inches. Of course, larger birds will have larger wingspans. These birds are extremely prone to soaring – not flapping. They fly similarly to hawks and eagles. They expend little energy for this reason. Migratory flocks often contain hundreds of birds, and they can create clear outlines of the wind currents they are riding. Sandhill cranes are fairly social. They live in pairs and family groups throughout the whole year, migrating together. During migration, cranes will form even larger groups with “strangers” to help ensure survival. These groups will forage and roost together. Often, they will continue to congregate in these groups in the thousands. Sandhill Cranes are mostly herbivores. They eat many types of food, though, depending on what is available. These birds usually eat with their bills in the ground, as they search for seeds and other foods. They find foods in shallow wetlands most commonly, though they will also look in other habitats. These cranes will commonly eat cultivated crops, including wheat and corn. Often, they consume lots of corn to prepare for migration, which helps them make the long journey. When possible, these birds will also eat small mammals, insects , reptiles, and other small animals. In the 1930s, the Sandhill Crane population was threatened. However, the population has since increased substantially. Today, they are considered Least Concern . However, certain subspecies are quite rare, as well as some isolated populations. The species as a whole is prosperous, though. Many subpopulations are threatened by habitat loss as they lose the ability to choose suitable breeding grounds. Non-migratory birds are at a higher risk than migratory populations for this reason. The species is also threatened by snow geese, which compete with them directly for corn that these cranes depend on for migration. Furthermore, these cranes can be hunted legally in many states. Therefore, hunting can be an issue, as well. However, despite this, the species has increased its range and population over the last few decades. Sandhill cranes are ground birds, which makes them very prone to predation. All sorts of mammals will prey on this bird, including coyotes, cougars, bobcats , raccoons, and foxes. Usually, these predators mostly hunt young, inexperienced cranes. Corvids and raptors may also eat young cranes and eggs. In some areas, the alligator and crocodile become major predators, as well. Of course, this is only true where these animals are located. Usually, these birds evade attack by taking flight. However, nesting birds may become aggressive and defend themselves against predators to protect their chicks and eggs. This bird’s bill is enough to pierce the skull of a small predator, so they aren’t to be trifled with. These cranes raise one brood per year. Exactly when they lay eggs depends on whether they migrate or not. Non-migrating populations lay their eggs early than migrating populations. Females will lay one to three eggs after they have built their nest. The eggs are dark brown with red markings, though there is a bit of variance from bird to bird. Both parents sit on the eggs for about 30 days. When the chicks hatch, they are covered in down. Usually, the chicks stay in the nest for a week or so. However, there are some instances of them leaving before that. The chicks tend to be more capable than other species. The chicks do feed intensively in the first few weeks. These birds will remain with their parents for about a year. They usually leave just as the parents lay their next brood. After leaving their parents, the chicks form groups with other young birds and nonbreeders. They form mated pairs between two to seven years of age. The Sandhill Crane once had a decreasing population. However, today, it is increasing by a lot. Some subspecies are rare and struggling though. Non-migratory birds tend to do worse than those that migrate, likely because they are more affected by habitat loss. We know that about 450,000 of these birds migrate yearly. However, we don’t know much about the non-migrating populations, as they are usually very isolated.",
        "score": 0.70847964
    }
]