[
  {
    "Name": "White Tail Deer",
    "Text": "The white-tail deer, also called Virginia deer, live from Southern Canada to South America. This deer that has a white tail is bigger the further away from the equator it lives. They are a favorite target for hunters, but wolves , mountain lions , bears , jaguars , and coyotes also love to dine on them. White-tail deer are herbivores who often swim to get away from their predators. These animals that have been clocked running up to 30 miles per hour give birth typically to one fawn each year. Odocoileus virginianus is the scientific name for white-tail deer. The genus name means hollow tooth. They are mammals in the Artiodactyla order. Knowing the scientific name is essential because it allows people to use the scientific name to talk about the animal worldwide. This order also includes moose , elk, and caribou. Members of this order are found throughout the world. The word deer is an Old English word that means beast. Like sheep , moose, and buffalo , the word deer is both singular and plural. The story of white-tail deer begins as the tale of all other deer species: with a tusked mammalian ancestor which existed during the Eocene era between 34 – 56 million years ago. These mammals diversified extensively owing to the emergence of the Himalayas and the Alps during the Oligocene era 23 – 34 million years ago. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The very first cervids capable of sporting antlers appeared during the Miocene era approximately 5.333 – 23.03 million years ago. During the Middle of the era, about 8 – 11.5 million years ago, the Capreolinae, the ancestors of the modern-day white-tail deer, elk, and moose emerged in Central Asia. Their populations increased significantly along with those of other cervids during the Pliocene era (2.6 – 5.3 million years ago) owing to an abundance of food encouraged by the cooler climate which prevailed. Most white-tail deer are tan or reddish-brown in the spring. As the days get longer, its coat starts changing to a deeper brown. White-tail deer have white on their throats, under their eyes, and the underside of their tail. There are white white-tail deer. While a select few are albino, most have inherited a recessive gene leaving them with leucism. Some will be white all over while others have brown spots. These deer have black noses. About 10% of all white-tail deer are born with this condition. Herds often are found in Texas’ Edwards Plateau and New York state, but they can be found anywhere. White-tail deer stand from 1.7-to-3.9-feet tall. White-tail deer are smaller than elk or moose . A small white-tail deer is about the same height as a pony. Most white-tail deer will reach about 27% of their adult size during the first year, grow to be about 57% of their adult size during the second year and about 80% of their adult size during the third year. They do not reach their full size until they are about 8 years old. Male white-tail deer grow antlers, which they lose annually. They grow in the spring and summer and are cast off during the fall or winter. The antler tissue is some of the fastest-grown tissue found on any animal. While the antlers are growing, deer have feeling in them to help them realize how big they have grown when going under objects. The biggest antler racks are found on animals over 4.5 years old because of the amount of energy needed to produce them is twice as much as that required to grow the skeletal system. How big the antlers grow and when they are lost is controlled by how much testosterone is in the buck’s body. While it is unusual, females can grow antlers, but they do not lose theirs. While the antlers are growing, they are covered with a fine substance called velvet. The velvet helps provide nourishment to the antler’s cells. The velvet falls off by mid-summer. The hair on a white-tail deer is relatively short. In the animal’s northern rangers, it has a hollow shaft that fills with hair. This helps to keep the animal warm in the winter. Different types of hair growth occur across the deer’s body. The hair on the deer’s back is usually the longest hair on its body, and it usually has a black tip. The hair on the side of the deer’s body is shorter, but it often still has a tiny black tip. Longer twisted hair grows on the deer’s underside. This deer takes its name from its white tail. If the deer is standing peacefully, you may not even see the white hair because the tail is covered in brown hair on its top. Once the deer starts moving, it raises its tail, and you will see the beautiful white hair on its underside. The tail is generally between 3.5-and-14-inches long. One of the heaviest white-tail deers killed by hunters was harvested in Ontario, Canada , in October 1977. Wildlife officials believe that the deer weighed more than 540 pounds when alive. It weighed 431 pounds when field dressed. White-tail deer are often compared to mule deer . While White-tail deer are found across the Eastern seaboard of North America and into Mexico, their range does overlap in some western states, across the Great Plains, and into Mexico. The easiest way to tell mule deer and white-tail deer apart is antlers. Mule deer antlers are generally larger and each species of deer have a unique shpe. Beyond that, white-tail deer are more reddish and normally slightly smaller. White-tail deer, like bears , skunks , bobcats and possums , are most active at dawn and dusk. Deer usually live in an area covering less than 1 one square mile. During the summer months, herds are generally of one sex. Once fall arrives, bucks move in to try to claim the right to the area. Then, they breed all the does in that region. Within herds, deer fight for dominance. This is especially true during the rut. This season usually starts as the days begin to get shorter in the fall and continues until the antlers fall off and testosterone levels are at their lowest. Males will push and shove each other initially. At the peak of the breeding season, these fights may escalate to total out antler wars. At the same time, bucks will start rubbing against trees. Scientists are not 100% sure why, but they believe this is to leave their scent. Within a few days, bucks will also start leaving scrapes. They will paw the soil until it becomes bare soil. Then, they will urinate in that spot and rub the urine into the ground. These areas are usually located under a broken tree branch. While some bucks use tree branches that are already broken, others pull on the tree branch with their mouths or hit it with their antlers until it breaks. Then, they mark the branch with their scent using their foreheads. Often, bucks create rubs and scrapes during the middle of the night. Many other animals, including sheep , camels , goats , pronghorns, bison , giraffes and antelope , have a similar rutting behavior. Like dogs , you can learn a lot by watching the body language of white-tail deer. Ears are usually held in an upright position, but if they drop them so that they become more horizontal, then they are conveying that they are not happy with how a fawn is behaving. It is like the same look that many people have received from their mothers. If the ears move to a forward position, then the deer is listening intently. The chances are that it thinks a predator is in the area and is trying to determine its exact location. White-tail deer are not very picky when it comes to their habitat. They have made adaptations that allow them to live almost anywhere. In an ideal world, the white-tail deer biome would be filled with grassy fields and meadows. The biome would be near a broad-leaved or coniferous forest. During the cooler months, the biome would be a thicker forest to protect it from winter winds. White-tail deer prefer to dine on grass, weeds, and flowers. They will eat corn, nuts, and fruit during the warmer months. Both bucks and does often eat a diet that is higher in fat during the fall. Food can be challenging to find in the wintertime, so this helps them store up the needed fat to survive. Rutting requires a lot of energy, and it is not unusual for a buck to lose up to 25% of their body weight during the fall and winter. White-tail deer can eat very tough plants because they have a four-chamber stomach. They swallow plants without chewing them. Then, they process the food at a later time. Cattle, sheep, goats, buffalo, and camels all have this four-part stomach called a ruminant stomach. The most significant threat to white-tail deer is hunters. The largest number of deer hunters is found in Texas, where about 840,000 white-tail deer are killed annually. Bobcats , wolves , and coyotes also kill white-tail deer, but their numbers are down significantly in the areas where white-tail deer live. Most white-tail deer will not breed until they are two years old, but some breed as early as seven months. They are short-day breeders who get pregnant in the fall. Then, approximately 205 days later, they give birth to a fawn. This cycle ensures that the fawn is born when the grass is greenest in the early spring, so the doe can get enough milk to take care of the fawn. While most do only have one fawn, some does have given birth to twins or triplets. Fawns stay hidden in the beginning because they are not strong enough to run from predators. The doe comes back to the hiding spot regularly to feed her fawn. Before fall, the mother forces male fawns to leave their side and join bachelor groups. When the breeding season occurs, bachelor hoods will break up, with each deer going off on its own, searching for females to breed. Most of these groups are from two to six animals. Female fawns may stay with their mothers and join the same maternal herd. These herds are often much bigger than bachelor herds. One of the adaptations that you may see if you watch white-tail deer is that does will flash their white stomachs up in the air when running away from predators. Scientists believe this adaptation is so that it is easier for their fawns to see and follow them. No one knows how many of these deer are in the world. There are between 35 -36 million white-tail deer in the United States . Additionally, there are at least 14 subspecies of these deer living in Central and South America . There are also white-tail deer in Canada . It is estimated that at least 40,000 white-tail deer live in Ontario, with more found in other providences. In most of its regions, this species is the deer with the largest population. The population of white-tail deer has swung over history. They were almost hunted into extinction in the late 1800s and early 1900s. Since the passage of state hunting laws, white-tail deer numbers have rebounded throughout more recent history. Depending on the location, history also shows that there are more deer during wetter periods and fewer deer during droughts. Facts are evident that you may be able to watch the number of white-tail deer born and tell what will happen long-term in the weather. The population of white-tail deer has swung over history. They were almost hunted into extinction in the late 1800s and early 1900s. Since the passage of state hunting laws, white-tail deer numbers have rebounded throughout more recent history. Depending on the location, history also shows that there are more deer during wetter periods and fewer deer during droughts. Facts are evident that you may be able to watch the number of white-tail deer born and tell what will happen long-term in the weather.",
    "Similarity": 5
  },
  {
    "Name": "White Tailed Deer",
    "Text": "The white-tail deer, also called Virginia deer, live from Southern Canada to South America. This deer that has a white tail is bigger the further away from the equator it lives. They are a favorite target for hunters, but wolves , mountain lions , bears , jaguars , and coyotes also love to dine on them. White-tail deer are herbivores who often swim to get away from their predators. These animals that have been clocked running up to 30 miles per hour give birth typically to one fawn each year. Odocoileus virginianus is the scientific name for white-tail deer. The genus name means hollow tooth. They are mammals in the Artiodactyla order. Knowing the scientific name is essential because it allows people to use the scientific name to talk about the animal worldwide. This order also includes moose , elk, and caribou. Members of this order are found throughout the world. The word deer is an Old English word that means beast. Like sheep , moose, and buffalo , the word deer is both singular and plural. The story of white-tail deer begins as the tale of all other deer species: with a tusked mammalian ancestor which existed during the Eocene era between 34 – 56 million years ago. These mammals diversified extensively owing to the emergence of the Himalayas and the Alps during the Oligocene era 23 – 34 million years ago. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The very first cervids capable of sporting antlers appeared during the Miocene era approximately 5.333 – 23.03 million years ago. During the Middle of the era, about 8 – 11.5 million years ago, the Capreolinae, the ancestors of the modern-day white-tail deer, elk, and moose emerged in Central Asia. Their populations increased significantly along with those of other cervids during the Pliocene era (2.6 – 5.3 million years ago) owing to an abundance of food encouraged by the cooler climate which prevailed. Most white-tail deer are tan or reddish-brown in the spring. As the days get longer, its coat starts changing to a deeper brown. White-tail deer have white on their throats, under their eyes, and the underside of their tail. There are white white-tail deer. While a select few are albino, most have inherited a recessive gene leaving them with leucism. Some will be white all over while others have brown spots. These deer have black noses. About 10% of all white-tail deer are born with this condition. Herds often are found in Texas’ Edwards Plateau and New York state, but they can be found anywhere. White-tail deer stand from 1.7-to-3.9-feet tall. White-tail deer are smaller than elk or moose . A small white-tail deer is about the same height as a pony. Most white-tail deer will reach about 27% of their adult size during the first year, grow to be about 57% of their adult size during the second year and about 80% of their adult size during the third year. They do not reach their full size until they are about 8 years old. Male white-tail deer grow antlers, which they lose annually. They grow in the spring and summer and are cast off during the fall or winter. The antler tissue is some of the fastest-grown tissue found on any animal. While the antlers are growing, deer have feeling in them to help them realize how big they have grown when going under objects. The biggest antler racks are found on animals over 4.5 years old because of the amount of energy needed to produce them is twice as much as that required to grow the skeletal system. How big the antlers grow and when they are lost is controlled by how much testosterone is in the buck’s body. While it is unusual, females can grow antlers, but they do not lose theirs. While the antlers are growing, they are covered with a fine substance called velvet. The velvet helps provide nourishment to the antler’s cells. The velvet falls off by mid-summer. The hair on a white-tail deer is relatively short. In the animal’s northern rangers, it has a hollow shaft that fills with hair. This helps to keep the animal warm in the winter. Different types of hair growth occur across the deer’s body. The hair on the deer’s back is usually the longest hair on its body, and it usually has a black tip. The hair on the side of the deer’s body is shorter, but it often still has a tiny black tip. Longer twisted hair grows on the deer’s underside. This deer takes its name from its white tail. If the deer is standing peacefully, you may not even see the white hair because the tail is covered in brown hair on its top. Once the deer starts moving, it raises its tail, and you will see the beautiful white hair on its underside. The tail is generally between 3.5-and-14-inches long. One of the heaviest white-tail deers killed by hunters was harvested in Ontario, Canada , in October 1977. Wildlife officials believe that the deer weighed more than 540 pounds when alive. It weighed 431 pounds when field dressed. White-tail deer are often compared to mule deer . While White-tail deer are found across the Eastern seaboard of North America and into Mexico, their range does overlap in some western states, across the Great Plains, and into Mexico. The easiest way to tell mule deer and white-tail deer apart is antlers. Mule deer antlers are generally larger and each species of deer have a unique shpe. Beyond that, white-tail deer are more reddish and normally slightly smaller. White-tail deer, like bears , skunks , bobcats and possums , are most active at dawn and dusk. Deer usually live in an area covering less than 1 one square mile. During the summer months, herds are generally of one sex. Once fall arrives, bucks move in to try to claim the right to the area. Then, they breed all the does in that region. Within herds, deer fight for dominance. This is especially true during the rut. This season usually starts as the days begin to get shorter in the fall and continues until the antlers fall off and testosterone levels are at their lowest. Males will push and shove each other initially. At the peak of the breeding season, these fights may escalate to total out antler wars. At the same time, bucks will start rubbing against trees. Scientists are not 100% sure why, but they believe this is to leave their scent. Within a few days, bucks will also start leaving scrapes. They will paw the soil until it becomes bare soil. Then, they will urinate in that spot and rub the urine into the ground. These areas are usually located under a broken tree branch. While some bucks use tree branches that are already broken, others pull on the tree branch with their mouths or hit it with their antlers until it breaks. Then, they mark the branch with their scent using their foreheads. Often, bucks create rubs and scrapes during the middle of the night. Many other animals, including sheep , camels , goats , pronghorns, bison , giraffes and antelope , have a similar rutting behavior. Like dogs , you can learn a lot by watching the body language of white-tail deer. Ears are usually held in an upright position, but if they drop them so that they become more horizontal, then they are conveying that they are not happy with how a fawn is behaving. It is like the same look that many people have received from their mothers. If the ears move to a forward position, then the deer is listening intently. The chances are that it thinks a predator is in the area and is trying to determine its exact location. White-tail deer are not very picky when it comes to their habitat. They have made adaptations that allow them to live almost anywhere. In an ideal world, the white-tail deer biome would be filled with grassy fields and meadows. The biome would be near a broad-leaved or coniferous forest. During the cooler months, the biome would be a thicker forest to protect it from winter winds. White-tail deer prefer to dine on grass, weeds, and flowers. They will eat corn, nuts, and fruit during the warmer months. Both bucks and does often eat a diet that is higher in fat during the fall. Food can be challenging to find in the wintertime, so this helps them store up the needed fat to survive. Rutting requires a lot of energy, and it is not unusual for a buck to lose up to 25% of their body weight during the fall and winter. White-tail deer can eat very tough plants because they have a four-chamber stomach. They swallow plants without chewing them. Then, they process the food at a later time. Cattle, sheep, goats, buffalo, and camels all have this four-part stomach called a ruminant stomach. The most significant threat to white-tail deer is hunters. The largest number of deer hunters is found in Texas, where about 840,000 white-tail deer are killed annually. Bobcats , wolves , and coyotes also kill white-tail deer, but their numbers are down significantly in the areas where white-tail deer live. Most white-tail deer will not breed until they are two years old, but some breed as early as seven months. They are short-day breeders who get pregnant in the fall. Then, approximately 205 days later, they give birth to a fawn. This cycle ensures that the fawn is born when the grass is greenest in the early spring, so the doe can get enough milk to take care of the fawn. While most do only have one fawn, some does have given birth to twins or triplets. Fawns stay hidden in the beginning because they are not strong enough to run from predators. The doe comes back to the hiding spot regularly to feed her fawn. Before fall, the mother forces male fawns to leave their side and join bachelor groups. When the breeding season occurs, bachelor hoods will break up, with each deer going off on its own, searching for females to breed. Most of these groups are from two to six animals. Female fawns may stay with their mothers and join the same maternal herd. These herds are often much bigger than bachelor herds. One of the adaptations that you may see if you watch white-tail deer is that does will flash their white stomachs up in the air when running away from predators. Scientists believe this adaptation is so that it is easier for their fawns to see and follow them. No one knows how many of these deer are in the world. There are between 35 -36 million white-tail deer in the United States . Additionally, there are at least 14 subspecies of these deer living in Central and South America . There are also white-tail deer in Canada . It is estimated that at least 40,000 white-tail deer live in Ontario, with more found in other providences. In most of its regions, this species is the deer with the largest population. The population of white-tail deer has swung over history. They were almost hunted into extinction in the late 1800s and early 1900s. Since the passage of state hunting laws, white-tail deer numbers have rebounded throughout more recent history. Depending on the location, history also shows that there are more deer during wetter periods and fewer deer during droughts. Facts are evident that you may be able to watch the number of white-tail deer born and tell what will happen long-term in the weather. The population of white-tail deer has swung over history. They were almost hunted into extinction in the late 1800s and early 1900s. Since the passage of state hunting laws, white-tail deer numbers have rebounded throughout more recent history. Depending on the location, history also shows that there are more deer during wetter periods and fewer deer during droughts. Facts are evident that you may be able to watch the number of white-tail deer born and tell what will happen long-term in the weather.",
    "Similarity": 5
  },
  {
    "Name": "Deer",
    "Text": "Foraging languidly among forests and plains, the deer is one of the most familiar and recognizable sights in all of nature. The deer is an animal that has proliferated across the globe and evolved many adaptations to help it cope with the rigors of a hostile world. Its regal antlers are some of the most notable characteristics in the animal kingdom, used for defense and sexual signaling. When it is disturbed, it can spring into action with its remarkable speed, agility, and finesse. And it has evolved a unique ability to digest all kinds of vegetation. The deer is a kind of evolutionary success story. You can check out more incredible facts about deer . Cervidae is the scientific name for all species of deer. It derives from the Latin word Cervus, which simply means stag or deer. The Cervidae family belongs to the order Artiodactyla, which represents all even-toed ungulates or hoofed animals with a certain kind of foot. The order includes giraffes , bison , hippos , pigs , camels , sheep , and cattle . More recent evidence suggests that cetaceans are also members of the order since they evolved from the even-toed ungulates tens of millions of years ago. Taxonomists generally agree that there are three subfamilies of these animals. Capreolinae, which includes reindeer , white-tailed deer, and moose , is known colloquially as the New World deer. Cervinae, which features the elk, the red deer, the tropical muntjacs, and the tufted deer, are known as the Old World deer. The third subfamily, Hydropotinae, is represented by just the water deer. The terms Old World and New World do not designate the deer’s current range but rather how they evolved. They can be distinguished from each other by key differences in their skeletal morphology. For most people, the Cervidae family is associated with white-tailed deer, red deer, mule deer, elk, caribou , and moose. But the entire family actually contains a massive amount of diversity. Taxonomists seem to disagree on the exact number of species, but by most counts, there are at least 40 still living, each one unique in its own way. Some sources put the number at more than 50 species. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Evidence from the fossil record suggests that these animals likely evolved around 20 million years ago. The earliest species were probably small creatures (much like the present-day mouse deer) with simple, rudimentary antlers and canine tusks. Many species flourished during the recent Pleistocene era, including the truly massive Irish elk, whose antlers may have weighed up to 90 lbs. Most deer species share in common a basic set of characteristics: two hooves on each foot, a four-chambered stomach, long and spindly legs, short tails, and a coat color that usually varies between brown, red, or gray. They also share a proclivity for the twilight hours. But the most prominent and conspicuous characteristic is the set of antlers on the head. This large ornamentation reveals a clear delineation between the males and the females. All males possess antlers, while females lack them. Only in caribou (or reindeer) do the females grow antlers as well. The water deer is the lone aberration where neither gender grows antlers. Instead, both male and female members grow tusk-like canines instead of the elegant network of antlers. This appears to reflect an earlier pre- antler state of their evolution. The antlers are composed of simple bone (and thus well-preserved in the fossil record) with a coat of skin and blood vessels called velvet to help them grow. It takes several months for the antlers to reach their full efflorescence, upon which time the deer will slough off the layer of velvet. The antler’s main purpose is to assist the animal in combat and reproduction. As antlers require such a large investment of energy to grow, their size signals to females the reproductive fecundity and overall health of the males. They also help to establish social status and hierarchy in the group. The size, curvature, and structure of the antlers are a source of immense variation between species. Some of them have a large central palmate (like moose antlers), while others have long single beams with varying numbers of branches. Some deer have nothing more than simple spikes for antlers. The reindeer have the largest antlers in relation to body size, but the moose can rival them in absolute terms. Deer are social animals. They usually congregate into small groups for feeding, mating, and protection. In the most densely packed areas, truly massive herds can form, depending on the abundance of food and the makeup of the population. Some species are migratory in nature and will travel hundreds of miles with the herd. To delineate social arrangements, they rely on their acute sense of smell and vocal communication. Many deer have a facial gland near the front of the eyes. The gland can release a strong pheromone for marking its territory when the animal rubs its body against trees or shrubs. Other glands reside on the legs and feet. The smallest species of deer is the humble pudu. It can range anywhere between one and three feet in length. The largest species of Cervidae is the moose. It can reach 10 feet long and weigh up to 1,800 lbs. In between these two extremes lies the common white-tail deer, whose height and weight are about the same as a human. Males tend to be larger than females in almost every species. These animals are present on nearly all continents on earth, including large unbroken expanses of North America, South America, Europe, and Asia. It contains only a single species of native deer, the Barbary red deer. Australia has no native species, but several have been introduced into the wild. These animals thrive in deciduous forests, tropical rainforests, wetlands, and grasslands. A few species inhabit the cold tundra of the north, feeding on the sparse vegetation. They are most frequently found in the areas between forests and open plains. They are also capable of adapting to urban and suburban settings, which means that some species can thrive despite human encroachment. These animals’ diet consists almost entirely of leaves, grass, lichen, buds, fruit, and herbs. The deer family is a type of ruminant — a mammal that has the capacity to break down and ferment plants with its four-chamber stomach. Each chamber contains various microbes to assist with this task. After the food is processed by the first stomach, the animal will then regurgitate it as cud and attempt to chew through the tough plant material. The food then proceeds through the remaining chambers of the stomach for digestion. However, unlike many other ruminants such as sheep and cattle, their palate is more selective. They prefer high-quality food that’s easier to digest. This is due to the large amounts of energy and nutrition needed to grow antlers. These animals are a critical food source for many predators in the wild, including bears , mountain lions , jaguars , tigers , lynxes , coyotes, wolves, and large raptors. Birds and small mammals may feed on the carcass of a deceased deer. Individual animals, especially young fawns, are susceptible to predation. They aren’t completely defenseless against ferocious predators, but when given the choice, they will usually prefer to run. White-tailed deer have the ability to sprint up to 30 MPH. They can also leap immense distances up to 30 feet. If a nearby threat is spotted, deer may attempt to warn nearby members of the herd. The more solitary moose are protected by virtue of their size. Since humans first evolved, deer have been historically an important source of food, clothing, and material to most societies. Modern hunting and habitat loss have threatened some species of deer, particularly in South Asia and the Pacific region, but with responsible stewardship, deer numbers can be maintained at healthy numbers. Climate change presents an acute problem as well. As the deer’s natural habitats change, it will force many of them to venture farther to the north. Other sources of danger include ticks, lice, parasites, and disease. Some of these diseases can be passed on to other types of animals, particularly livestock. The deer’s breeding season takes place every year for only a short amount of time. Most species pursue a reproduction strategy known as polygyny in which a single dominant male will have multiple female partners. Only a few species prefer to be monogamous. Because competition can be fierce, males tend to exhibit aggressive tendencies throughout the mating season, as they try to guard their territories and mate against potential rivals. As mentioned previously, antler size is a significant determinant of reproductive success. Once a female deer is impregnated, the gestation period can last anywhere between six to eight months. Mothers will tend to produce one or two offspring at a time. Less commonly, the doe will produce three offspring. The young deer are known as fawns or calves, depending on the size of the species. While out foraging, mothers will hide the fawn in nearby vegetation until the young animal is strong enough to begin walking on its own power. The fawns are often born with white spots to provide camouflage from predators. The offspring are weaned at two to five months, but they may stay with the mother for up to a year. Males often play minimal roles in raising young fawns. After the first year of life, males will begin to grow their antlers on an annual basis. Deer can live around 12 years in the wild, give or take a few years, but hunting, predation, and vehicle collisions can greatly truncate the length of their lives. Many do not live beyond their fifth year of existence. Due to commercial exploitation, populations of many deer species fell in the early and mid-20th centuries. But thanks to conservation efforts, populations have rebounded. Some estimates put the population size of the common white-tailed deer at around 30 million. Overpopulation has actually become a significant problem since humans have hunted many of the predators that keep the deer population in check. Therefore, regulated hunting is encouraged in many states as a means of population control. The Americas are rich in several species of deer. The white-tailed deer occupies a large range between the South American coast, Central America, the eastern United States, and parts of Canada. The mule deer tends to occupy the western United States and overlaps with the white-tailed deer in some places. Enormous clusters of deer, including white-tail deer, mule deer, caribou, moose, and elk, congregate in the national parks of western Canada. Despite their ubiquity, many species and subspecies of deer are under threat. The Persian fallow deer, Chilean huemul, Kashmir stag, Indian hog deer, Bawean deer, and Eld’s deer are either endangered or critically endangered. The reindeer, water deer, barasingha, and others are approaching vulnerable status. Pere David’s deer , which is native to China, was declared extinct in the wild, but attempts have been made to reintroduce them back into their natural habitat. The following list includes the most well-known deer species throughout the world: Chinese Water Deer – A native of the river bottoms of Korea and in the Yangtze River Valley of China, the Chinese water deer is the only species of deer whose males don’t grow antlers. Instead, these deer grow 2 inch tusks that protrude from the sides of their mouths. Irish Elk – The Irish Elk is an extinct species and one of the largest deer to ever live. During the Pleistocene, its range extended from Ireland to Siberia. This magnificent giant stood at 7 feet tall at the shoulders and weighed over 1,500 pounds!",
    "Similarity": 5
  },
  {
    "Name": "Coues Deer",
    "Text": "Coues deer are a diminutive subspecies of white-tail deer . They are found in Arizona and New Mexico , but their range is more extensive in western and central Mexico . Coues deer are subspecies of the white-tail deer of the Genus Odocoileus, meaning “hollow tooth.” White-tail deer carry the species name Odocoileus virginianus , the Virginia white-tail. Coues deer, named after the doctor who discovered them, are Odocoileus virginianus couesi . Odocoileus virginianus couesi are smaller than the rest of the white-tail subspecies, measuring about 30 inches tall at the shoulder and seldom reaching 100 pounds. Female adults only average about 65 pounds. Because of their more diminutive stature, their ears and tails seem more prominent than most white-tail deer. Their large ears are crisscrossed with a network of blood vessels that carry blood through the ears to cool before returning to the circular system. The tail of the Coues deer has the distinctive white underside belonging to all white-tail deer, flashing white as it is raised when alarmed to alert the rest of the herd. A white halo also surrounds each eye. Their coat is lighter in color and duskier than the coat of its Virginian cousin, allowing it to blend in better with its sandy scrub brush habitat. It changes its coat in winter to a darker gray which then becomes more reddish in the spring and summer. Its undercoat in both seasons is lighter in color. Coues are notoriously wary, nicknamed “the grey ghosts.” Although they habitually use the same routes when eating, getting water, or bedding down, they will abandon those paths for a while if disturbed. After a few days, they will return to their habitual trails. Some white-tail will graze with other animals, like cattle or sheep, but the Coues deer will avoid any areas inhabited by livestock. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Coues deer inhabit high elevations of the American southwest and Mexico. During the rainy season, they frequent slightly lower elevations seeking out grasslands and scrub oak. They move to higher elevations when the dry season hits, seeking oak groves and pine forests. They are comfortable in vegetation with interspersed clearings. They seem to be most numerous in territories with pine, juniper, and various evergreen plants, but they can also be found in Sonoran Desert regions. Coues deer feed on various grass, seeds, acorns, weeds, shrubs, and cacti fruit. They will feed mainly on flowering shrubs and trees, known as “forbs.” Forbs are found in semi-arid areas and grow along the edges of woodlands or patches of juniper, frequently along with long grasses. Though they have their preferences, they will focus on diverse plants rather than staying in an area with only one or two types of vegetation. The shrubs they will eat from include false mesquite, buckwheat, and mountain mahogany. The types of predators Coues deer face are pretty typical. The dry patches of the southwest and Mexico are favorable to mountain lions , coyotes , and bobcats known to prey upon Coues. An occasional bear will also hunt Coues. Small fawns and older deer are particularly vulnerable to all of these predators, as well as dogs and golden eagles . Coues deer “rutting” occurs in the winter, with peak breeding season in December and January. Bucks will mate with many does, which means if bucks are in short supply, the population will still carry on. About 200 days after conception, does will give birth. Most of these births will occur in August. These births happen after the summer rains, providing deer with the benefits of food and cover resulting from new growth. Does will leave their fawns bedded down while they go to feed. Coues stay with their fawns longer than mule deer will. The first birthing for a doe will be one fawn; afterward, they may birth twins. Coues deer have a lifespan of 9-11 years in captivity, though in the wild, these numbers are impacted by disease, elements, and predation. Coues are a subspecies of white-tail deer, and the IUCN lists them as “Least Concern.” Some estimates of Coues in Arizona and New Mexico place the population at about 100,000. In contrast, the population in Mexico is believed to be larger than that, as their range is more extensive. If you want to see a Coues deer in person, two parks in Arizona have them in captivity. Bearizona Wildlife Park has a variety of animals, including Coues deer . Grand Canyon Deer Farm also has a collection of deer, including the Coues. Check their sites for costs and hours.",
    "Similarity": 5
  },
  {
    "Name": "Sika Deer",
    "Text": "“Sikas can make 10 different sounds, from soft whistles to loud screams.” The sika deer is closely related to the fallow deer and the red deer . The scientific name of the sika deer is Cervus nippon. Cervus is Latin for “deer” or “stag,” and nippon is a Japanese word meaning “where the sun rises”—a Japanese name for Japan. The common name sika comes from the Japanese word for “deer.” In Chinese the species is known as the “plum blossom deer.” Other names for this species are the Northern spotted deer, Japanese deer, or Asian elk. The sika are part of the class Mammalia and the family Cervidae. Sikas are similar to the red deer but are smaller. Those in Russia, China, and Taiwan are the largest and heaviest, while the smallest subspecies is found in the Ryukyu Islands southwest of Japan. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . They range from 20-45 inches tall at the shoulder and 35-70 inches in head and body length. Their tails measure 3-5 inches long. Stags (males) are larger than hinds (females). Stags can weigh anywhere from 150-350 pounds and hinds anywhere from 70-110 pounds. The largest stag on record weighed 440 pounds. Sikas are one of the only deer species that do not lose their spots when they reach maturity, although the spots are nearly invisible in adults in some subspecies. In color, sikas have a more chestnut or yellowish-brown color spotted with white and a white patch on their hindquarters. In winter their coloration changes to dark grey-brown and loses its lighter markings. They have a white rump patch that flares out when they are startled. Stags have smaller and less complex antlers than their red deer cousins. Their antlers can range from 11 to 30 inches in length but have no more than four tines each. The hinds have black bumps on the forehead. Sika have an energetic, boisterous disposition. When alarmed they often display a flared rump like the American elk. They run away by bouncing, like mule deer . They are a highly vocal species, communicating with over 10 individual sounds from soft whistles to loud screams. They are excellent swimmers and sometimes jump in water to get away from predators. Sikas can be active in daytime but in areas where there is a lot of human activity they become nocturnal. They usually feed from dusk to dawn. Some of them live alone while others stay in single-sex groups. Males spend most years alone but occasionally form herds. Large herds gather in autumn and winter. Sikas can potentially make good pets because they are small and have a gentle disposition. Researchers in the Netherlands named the sika as one of five mammals other than traditional pets that might be suitable as human companions. Sika deer have already been domesticated in China and Japan. In the city of Nara, Japan , sika are honored as messengers of the Shinto gods and allowed to wander through parks and temples. Some people treat them to special “deer cookies” and bow to honor them. Because the deer often appear to bow their heads in response, they are known in Nara as “bowing deer.” However, like goats, sika see a bowed head as an invitation to play or as a challenge and will bow their heads in preparation for a headbutting charge. The sika originated in East Asia with a large range from northern Vietnam to the Russian Far East. It is now rare in all these areas except Japan, where it is overpopulated. It has been introduced into numerous European countries, the United States , Canada, Australia, New Zealand and the Philippines. They like dense temperate and subtropical forests with some clearings for foraging, where there is no more than 4-8 inches of snowfall. In the Japanese summer sika deer live in the mountains up to a height of 8,202 feet. During the thick snowfalls of the winter they descend to lower pastures as much as 2,300 feet lower in elevation. Sika deer are herbivores. They eat grass, fallen leaves, shrubs, herbs, fruit, fungi, ferns, and bamboo. They will even eat poison ivy. In farming areas they raid corn and soybean fields. The largest sika population is in Japan, numbering over 3 million and increasing, due to conservation efforts and the extinction of its main predator, the Japanese wolf, 100 years ago. Sika are now overpopulated there. Only a few hundred to a few thousand remain in the wild in China, Taiwan, and Russia. It is unknown whether the species survives in North Korea, but in South Korea they are extinct. In the United States, a herd of 4-5 sika was introduced to an island in Maryland in 1916. They escaped to the mainland and their population in the state is now estimated at 12-15,000. Their rapid multiplication in Maryland has created environmental and agricultural damage. Sikas have also been introduced in Virginia, Texas, Oklahoma, and Wisconsin. In parts of China and Russia, sika are hunted by wolves, bears, tigers, leopards, and brown bears. Fawns are also hunted by lynx and golden eagles . In Japan, their main predator was the Japanese wolf, until it went extinct 100 years ago, so sikas have become overpopulated there. Humans are the main predator of sika. In Europe, they are valued for hunting, especially as they use different survival and escape techniques than the red deer, making them more challenging prey. Sometimes they will even squat and lie on their bellies when threatened. Velvet antlers (dried immature antlers) of stags are a popular ingredient of Chinese traditional medicine. Sika have been domesticated in China to provide a steady source of velvet antlers. Another threat to sika from humans is the loss of habitat. The sika’s preferred habitat in temperate forests is also highly valued for agriculture and human settlement, in some of the most heavily populated areas of the world. The global conservation status of the sika is “least concern.” While in specific countries sika have gone extinct due to overhunting and loss of habitat, overall the worldwide numbers of the species are increasing and they are overpopulated in some areas, including Japan and in the Eastern Shore area of Maryland and Virginia in the US. Sikas cross-breed with red deer in areas where they have been introduced, such as the Scottish Highlands, threatening the red deer gene pool. In fact, research on the negative impact of introduced mammals in Europe found the sika to be one of the most damaging species, along with the brown rat and the muskrat. The sika deer mating season is called the “rut” or the “rutting season.” In Japan it takes place from September to October and their fawns are born the following May or June. During the rut Stags grow distinctive manes. They are highly territorial and keep a harem of females they defend from rivals. They mark their territory, which can be up to 5 acres in size, by digging holes with their feet and antlers and urinating into them. Males have long, brutal, and sometimes deadly fights over territory. Hinds usually congregate in small family groups with their babies and sometimes with offspring from the previous year. Hinds bleat and whistle softly to communicate with their herds. In case of danger, they sound the alarm with a short, high-pitched bark. Gestation takes 7 months after which the hind usually gives birth to one, or on occasion two fawns. Fawns weigh 10-15 lbs. at birth and nurse for up to 10 months. Fawns have an instinct to stay perfectly silent hidden in thick underbrush until the mother returns to nurse them. Fawns become completely independent at 10-12 months and both sexes become sexually mature at 16-18 months. On average, sika deer live 15-18 years in captivity. The oldest recorded sika lived 25 years and 5 months.",
    "Similarity": 5
  },
  {
    "Name": "Mule",
    "Text": "“A stupid mule is still smarter than a good horse or a bad man.” What is a mule? Mules are a genetic hybrid that has been the workhorse of human civilization for millennia. Stronger than a horse , but gentler than a donkey , the mule combines all the best elements of both breeds into a package that is a staple of agricultural pursuits across the globe. These animals are members of the family Equidae of the genus Equus . Their scientific name is Equus mulus , and that stands true for both the male and female of the species despite their different names. The mule is a hybrid of a male donkey , called a jack, and a female horse , called a mare. Equus is the Latin word for horse, and mulus is Latin for a mule. Mules have a long and storied history and have played important roles in civilizations all over the world. Horses originated in Central Asia around 3500 BC and extended their range across the world – eventually extending into the range of the donkey – which originated in Africa. It is known that mules were bred in Mesopotamia before 1,000 BC. There is evidence in art and ancient writings that mules were present at many important events – they are illustrated in a painting in the Tomb of Nebamun at Thebes, dating from around 1350 BC. Mules were present in Israel in the time of King David and were mentioned by Homer in the Iliad in 800 BC. George Washington bred mules at Mount Vernon. Mules pulled wagon trains across the American plains and could travel 30 miles a day to a horse’s five. The mule is famous the world over for its great strength and gentle manner. Mules are animals that look exactly like what they truly are, the resulting genetic hybrid of a stallion and a donkey . While generally brown or gray, they can come in any coat and color found on both horses and donkeys. They are larger and leaner than jacks and smaller but stouter than colts. Their heads are shorter, thicker, and more closely resemble that of a donkey while their ears are longer than a horse’s but shorter than a donkey’s. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The average size of these animals is between 50 and 70 inches in height, and their weight can range between 600 and 1,500 pounds. Miniature animals weighing only 50 pounds have been bred, and the largest recorded male weighed in at a massive 2,200 pounds. That weight ranges from an average-sized male bulldog up to the weight of two grizzly bears put together. Apollo, the largest and heaviest mule, also stood an impressive 19.1 hands high, about 77 inches! These animals’ temperament was the ideal that breeders were trying to reach when combining the qualities of colts and jacks . In them, you have the strength and hardiness of a donkey mixed with the combined temperaments of both parents. Stallions have a tendency to be flighty, or easily spooked, and jacks are known as stubborn and difficult to manage. The mule is a stolid, patient, and generally even-tempered beast. Mules are found throughout the world. They are located on every continent but Antarctica and their breeding has left them well-suited to handle almost all climates. With their tougher skin, when compared to a stallion , they are less likely to overheat, and they need less food than a horse making foraging easier. Mules are a human-created species and, as such, they have no natural habitat. They can be found anywhere that humans have brought them. With respect to its diet, the mule is no different than its parents. They eat a wide variety of grasses and small shrubs. If they do not have a large enough area to forage successfully, generally one to two acres, then their diet may be supplemented by hay, grain, or pelletized food. Another result of the hybridization of the species is that, although they have retained the size of the colt , they only require a fraction of the amount of food necessary to feed a stallion. When not working, they spend the majority of their day eating or resting. The principal threat mules face is a disease. Stallions , donkeys , and mules all face similar diseases such as tetanus, Eastern equine encephalomyelitis, and equine influenza. Appropriate care for the mule, frequent veterinary checkups, and vaccination programs all help to prevent the contraction of these illnesses, or at least to mitigate the effects. Being that they are wholly domestic animals, they do not typically face a threat from any predator. As mentioned above, mules are bred by cross-breeding a mare with a jack . The mare gives birth to a baby, called a foal, after a gestational period of 11 to 12 months. The average mule lives approximately 30 years, but there have been mules that have lived well into their 40s. Because mules have the odd number of chromosomes, 63, in fact, they are often infertile. However, there have been instances of female mules giving birth. These animals exist on six of the seven continents with Antarctica being the exception. They live almost exclusively in human care as, due to the above-discussed fertility issues, they are largely unable to breed in the wild to sustain a feral herd. Reliable population numbers are nearly impossible to come by; however, the U.S. Department of Agriculture reported approximately 200,000 mules residing within the United States alone as of 1998. The mule is categorized as a species of the least concern . These animals are common sights in zoos all across the United States. They are frequently found in petting zoos as well because of their even temperament. The San Diego Zoo has several mules, and they recently donated several to CalFire for use as pack animals in remote wilderness areas of the state to assist in combating wildfires.",
    "Similarity": 2
  },
  {
    "Name": "Nyala",
    "Text": "“The Nyala is one of the oldest antelopes in Africa.” Scientists believe that this shy member of the Bovidae family has been around for close to 6 million years and has been a separate species since the end of the Miocene era, which makes it only second to the lesser kudu when it comes to species longevity. Because of this, some believe it’s high time to put the nyala in its own genus, but for now, it remains a member of Tragelaphus . For even more information about this stunning antelope , read on: Here are some amazing facts about T. angasii : The scientific name of this antelope is Tragelaphus angasii. Tragelaphus comes from the Greek words trágos , which means “billy goat” and élaphos , which means “deer.” It was once placed in the genus, Nyala , but it currently remains in the genus Tragelaphus. The British zoologist John Edward Gray bestowed the name Angasii on this species, naming it after George Fife Angas, who was the father of the naturalist, George French Angas, who first described the animal in 1849. There are no subspecies, and the animal called the mountain nyala is only distantly related. A female nyala looks very much like a deer . She does not have horns and stands a little less than 3 feet tall at the shoulder. She has a reddish-brown coat, at least 10 white, vertical stripes along her sides, and a crest of dark hair that runs all the way down her back. The males begin life with the same colors as their mothers. Biologists believe this saves them from aggression from older bulls. As they grow their coats turn a dark, almost bluish-gray, and their stripes start to fade. Bulls also have spiraling horns that can grow as long as 2.6 feet and are tipped with yellow. The bull’s lower legs are also yellow. The ears of both sexes are large and call to mind the mule deer. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Along with the hair down the spine that they share with the females, male nyalas also have a fringe that begins in the middle of their chest and moves down their belly. Both males and females have white spots on their faces, throats, knees, and thighs, including a white chevron-shaped patch between the eyes. The tail is bushy, medium-long, and has a white underside. Identification of T. angasii and identification of the kudu can be a little tricky, for both antelopes live in southern Africa and both are members, for the time being, of the Tragelaphus genus. The greater kudu is Tragelaphus strepsiceros and the lesser kudu is Tragelaphus imberbis . Both nyalas and kudus have vertical stripes down their sides, white “V”s between their eyes and the males of both species have spiraling horns. One characteristic that helps in the identification of the kudu (Pronunciation: KOO doo) is that it is a much bigger antelope than the nyala. The greater kudu can be from 6.5 to 8.25 feet long, stand 5 feet tall at the shoulder and weigh between 260 and 690 pounds. Indeed, the greater kudu is one of the world’s tallest antelopes. Even the lesser kudu is taller than the nyala at 4 feet tall. The horns of the kudu are even larger in size than those of T. angasii or any other antelope and their spiraling is even more spectacular. The kudu’s horns can be 5.5 feet long. The color of the adult kudu male’s hide is also different than that of the T. angasii bull. The colors range from chestnut to blue-gray, but its stripes do not fade like the stripes of the nyala bull. Kudu males also have beards, which isn’t seen in T. angasii . Kudus are also herbivores, but they live in more locations and habitats than nyalas. They’re not only found in southern Africa but in eastern Africa, and they’ll live wherever there’s good cover. They’re also seasonal breeders in their southern range where nyalas can breed all year. Nyalas, especially females, live in loose groups that can range from two to 30 antelope, but old males are solitary. They are wary animals and graze and browse during the evening and at nighttime. During the day they hide in the bush to avoid the heat as well as predators. When they sense danger they give out a peculiar barking call, and they can also understand the alarm calls of other types of antelopes as well as baboons. They’re often seen around baboons because the primates toss down the leaves and fruit that the nyala like to eat. They are found in savannas that give them lots of coverage and are near fresh water and lush grass. These locations can be found in South Africa, Zimbabwe, Mozambique, southern Malawi, and Swaziland . They are also found in game reserves such as Kruger National Park . If the antelopes have territories, they overlap and are not well defended. Like most antelopes, the nyala are herbivores. Their diet is made up of a variety of plants, and they consume flowers, fruit, leaves, and twigs. When the grass is lush during the rainy season they eat grass, and though they can go a long time without water, they prefer to live near a freshwater source. Despite its magnificent looks, T. angasii isn’t a very big antelope. Indeed, lions tend to disdain it, and it is taken by prides of bachelors who don’t have females to hunt for them and find the nyala easy pickings. The antelope is just right for the leopard , for it is small enough to be cached in a tree. Other predators are wild dogs and hyenas . Baboons and birds of prey snatch babies, and of course, humans hunt the antelope for its meat and beautiful horns. Other threats to the antelope are poaching and habitat loss due to agriculture. They are also vulnerable to parasites such as nematodes, trematodes, lice, and disease-spreading ticks . They can also suffer from heart disease. T. angasii can breed all year, but breeding usually peaks in the spring. The female’s estrus cycle is a bit odd, for estrus lasts for 19 days and she’s only receptive for about six hours. Since she’ll be courted by a male for only two days, he needs to court her during the few hours that she’s ready. Bulls sometimes fight over females. Given the size and power of their corkscrew-shaped horns, they will occasionally fight to the death. Usually, the smaller of the two will give up and walk away. After mating, the cow is pregnant for about seven months and gives birth to a calf. The calf weighs about 11 pounds and is birthed in a hidden place that protects it from predators. It will stay there for about 18 days, and its mother comes back now and then to nurse it. Calves are weaned when they’re about seven months old, and male calves stay with their mother until she’s ready to have another baby. At that time the bull drives him away, but females tend to stay with their mothers even after they’ve had their own calves. Females are ready to breed when they’re about a year old and males are ready when they’re a year and a half, even though they are not really mature until they’re five years old. If they survive poachers and predators, a nyala can have a lifespan of about 19 years. There are an estimated 30,000 wild T. angasii in the world, and most of them live in protected areas. Their conservation status is least concern .",
    "Similarity": 2
  },
  {
    "Name": "Mountain Lion",
    "Text": "The mountain lion is a large, tan colored cat species native to North America, Central America and South America. In the United States, these cats live primarily in western states and Florida . Also called by the name cougar, puma, catamount and panther, mountain lions are animals that thrive in many habitats. They live in more geographies than any other Western Hemisphere mammal, besides humans. Want more mountain lion facts? Give ‘ 11 Incredible Mountain Lion Facts ‘ a read for a deep dive into the most incredible facts about these majestic animals! The mountain lion’s scientific name is Puma concolor , from the Spanish word puma of Latin origin. The name translates to mean “mountain lion” in Spanish, French, German and other Latin-based languages. The big cat’s phylum is Chordata , in the class Mammalia , order Carnivora , family Felidae and genus Puma . Early Spanish explorers of the Americas called the cat “leon,” meaning lion and “gato monte, meaning mountain cat. Incas called it “puma,” while early South American Indians called it “cuguacuarana,” from which the word “cougar” comes. Most scientists prefer to call these cats “pumas.” These cats have about 40 names in the English language, including panther, puma, cougar , catamount, painter, mountain screamer, red tiger, Mexican lion and American lion. Six subspecies live in North America, Central American, eastern South America, northern South America, central South America and southern South America. There are two main mountain lion subspecies: These predators look very much like over-sized short-hair house cats. They have small heads with short faces. Ears are rounded and small. Their bodies are long and sleek, with long necks and tails. Puma legs are powerful, suited to rapid increase of speed and made for pouncing. The cats’ teeth seize their prey, tearing and slashing the meat. The average mountain lion is an animal that ranges from about 3’3″ in length to about 5’5″. But with their tails, some males measure as long as nine feet and females up to seven feet. The cats stand between two feet and 2’6″ from the ground to their shoulders. In adulthood, females weigh from 80 to 100 pounds and males from 125 to 160 pounds. Mountain lion color in the United States is most commonly tan. Throughout the Americas, their color ranges from a tawny color to a bluish gray. Their bellies, inner legs and throats are always lighter in color, with their noses and tails having black or dark edges. Babies are born with spots to camouflage them in the wild. These spots fade at about six months. Their blue eyes also change to yellow by the age of 16 months. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Mountain lions are solitary by nature. They sometimes share territory with one other puma, but prefer a 30 square mile range to call their own. Some mountain lions maintain a territory of up to 125 square miles. They live in habitats of all kinds in the Western Hemisphere, from mountainous regions to the swamps of Florida. Humans rarely see mountain lions, as they are nocturnal and prefer to remain hidden. But they are stealthy creatures that stalk their prey. Pumas are very intelligent. They avoid humans whenever possible. Mountain lions are at the top of the food chain. They keep deer populations in balance and even help reduce the number of vehicle accidents involving deer. Although brown bears will kill and eat mountain lions, sometimes the lions win in fights against these giant bears . Humans and domestic animals must watch out for mountain lions, when we cross into their habitats. Puma avoid humans whenever possible. But people sometimes cross their paths on hiking trails or out in the wilderness. To know how dangerous mountain lions are, read here . Experts assert that the mountain lion’s ancestor first appeared in Asia about 11 million years ago. Three million years later, it would cross the Bering land bridge to North America. In its new home, it would differentiate into different genetic strains, including those responsible for wild and domestic felines, ocelots, oncillas, lynxes, and mountain lions. About 2 – 4 million years ago, these cats entered South America, crossing the Isthmus of Panama. However, the population of mountain lions in North America diminished, and those which are found there today are actually their relatives which returned to their original home from the southern part of the Americas. Between 6 to 4 million years later, these felines would make their way to South America by way of the Isthmus of Panama. It is worth noting that certain experts believe that the North American population of pumas eventually dwindled and that present-day cougars are actually arrivals which retraced their steps from South America to North America at a later date. Mountain lions live throughout the Americas, from the Yukon of Canada to the subtropics of South America. No other American mammal, except humans, spans such a wide land range. They can live in almost any type of habitat, such as mountains, wetlands, forests and deserts, also from sea-level areas to the highest snow-covered mountain peaks. Although they prefer 14 western states of the United States, puma in the U.S. are also found in low numbers in Florida. These cats also roam as far as the northeastern states from time-to-time. Mountain lions live in areas with dense shrubbery, undergrowth and other plant life for cover. If they feel threatened, they leave the area. The average lifespan for a wild mountain lion is about ten years. But in zoos, many live for 20 or more years. Because of sport hunting in some regions, the cats in those areas only live to about five years of age. Throughout their lifetime, mountain lions prefer to live alone. Only for mating and parenting do they break this rule. They mark their territory by urinating on piles of leaves, pine needles or grass and clawing trees. This tells other lions to stay away. If another lion crosses into the territory, the two will fight to their death if necessary. The cats’ coat color varies from region to region. Where they live determines this color. With the ability to blend into their surroundings, mountain lions easily prey on deer and small mammals. They eat coyotes, raccoons, rabbits and porcupine. To preserve their killed prey and protect it from scavengers, they bury it and return to feed off of it for several days. Mountain lions’ large hind legs have greater muscle mass than their front legs. This enables them to jump up to 18 feet into a tree and 20 feet up or down a hill. They run very fast, with their flexible spine allowing them to change direction and move around obstacles quickly. Their large paws keep them steady, with sharp claws for defense and attacking prey. Keen eyesight helps them find their prey. The biggest threats to mountain lions are humans. These cats are apex predators, near the top of the food chain. They are sometimes killed by brown bear or as part of territory fights with other mountain lions. Mountain lions once lived from the east coast of America to the west coast. But people feared the big cats and believed them to be predators of livestock. So by the 1940s, many states paid bounties for killing of the lions. Each pelt once brought a reward of $25 to $35. This reduced their numbers by far, restricting the cat population mostly to the western coast and a small number in Florida. Despite laws in place to protect them in many parts of the U.S., some people still illegally trap, poison and shoot the lions on sight. Hunting is still legal in some form in many states, such as Utah, Idaho, Wyoming, Montana, Colorado , New Mexico, Nebraska, North Dakota, South Dakota, Nevada, Arizona, Texas, Washington and Oregon. Mountain lions are carnivores that are apex predators across much of their environment. Their favorite meals include mule deer, badgers, raccoons, and other mammals. For a complete analysis of their diet, give our ‘ What Do Mountain Lions Eat? 20 Animals in Their Diet ‘ page a read! Mountain lion females can mate with several males in one reproductive season, called estrus. Typically, the female prefers to mate with a male from an overlapping territory. The three to 10 days of a mating period is the only time humans see males and females together. Otherwise, they remain solitary animals and avoid contact. For both females and males, sexual maturity occurs at about one to 2.5 years old. Females do not try to reproduce until they have established their own territory. Females with cubs move from one place on their territory to another every few weeks. This helps her protect the cubs from roaming males and other predators. Mating occurs throughout the year, when the female is in estrus. But most litters are born during the warm months of summer, particularly July to September. Females produce a litter every 1.5 to two years, on average. But if she loses a litter, she quickly enters estrus again. Gestation, also called pregnancy, for a mountain lion is about 90 days. Gestation for a mountain lion is short compared to other large land animals. But it compares closely to other lions and their tiny cousins, domestic house cats. Most litters include two to three spotted, blue-eyed cubs, sometimes called kittens. Sometimes only one or as many as four are born. By six months of age, the fur has changed to a tawny, unspotted coat like adults. Their blue eyes change to yellow by the age of 16 months. Kittens nurse for three months. They start eating a meat at one and a half months, then eating meat exclusively after weaning. As they grow in their adult coats at six months, they start hunting with their mother. Babies are cared for by their mother until one to two years of age, when the cubs must strike out on their own. Where hunted, such as in U.S. states that permit some hunting of mountain lions, the average lifespan for one of these cats is about five years. Left to live a natural lifespan in the wild, most live about 13 years. The average lifetime for these big cats in zoos is about 19 years, although some live beyond 20. As of 2015, the existing mountain lion population is listed as decreasing due to diminishing habitat, but stable. Overall, the species is not endangered . This is with a few exceptions, including the subspecies of Florida panthers and the now extinct eastern cougar. The eastern cougar was declared officially extinct in 2011 by the U.S. Fish & Wildlife Service. In Florida, only 160 panthers remain. One of the biggest problems in mountain lion conservation is the lack of clear lion counts over the past decades. States and other countries are working now to establish clear counts, such as in California. But thousands of these cats are known to exist in the U.S., as well as throughout Central America, Canada and South America. In California, the Fish and Wildlife’s Wildlife Investigations Laboratory has set a goal to know a precise statewide mountain lion count by 2022. Additionally, there are 15 US states that have a stable breeding population of mountain lions.",
    "Similarity": 1
  },
  {
    "Name": "Archaeotherium",
    "Text": "Archaeotherium (Archaeotherium mortoni ) is an extinct artiodactyl. That means it was a member of the mammalian order Artiodactyla of even-toed ungulates. These animals put their weight on an even number of toes (in this case, two toes, the third and fourth) when they walk. The other toes might or might not be present or functioning. Among even-toed ungulates are pigs, hippos, deer, giraffes, camels, llamas, sheep, goats, cattle and the like. Odd-toed ungulates that bear weight on an odd number of toes also exist and include animals such as rhinos, zebras, mules, donkey, and horses. The ancestry of the Artiodactyla order is not known exactly, but fossils show that even-toed ungulates existed as far back as 53 million years ago in the early Eocene period. Fossils of the same age have appeared in Europe, Asia, and North America. Getting more specific, the Archaeotherium is a member of the Entelodontidae family. Entelodonts included mammals much like today’s pigs , sheep , camels , and cows , but they lived between 38 and 19 million years ago. All Entelodonts, including the Archaeotherium and another pig-like dinosaur called Daeodon , are now extinct . The name Archaeotherium comes from Greek and means “ancient beast,” but Archaeotheriums are commonly referred to as “hell pigs” or “hell hogs.” However, they are actually not related to today’s pigs. Surprisingly, they are more closely related to whales and hippos . There may have been several species, but mortoni is the type species (the example), and also the largest. Archaeotheriums were about the size of modern cows. On average, they stood about 4 feet 11 inches at the shoulder. From nose to tail, they were about 6 feet to 7 feet long. The largest discovered Archaeotherium was 5 feet 3 inches tall at the shoulder. They weighed up to 1,300 lbs., but averaged 1100 lbs. The skull of the largest specimen was 31 inches long. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Measurements of Archaeotherium include: Scientists believe that males and females were about the same size. But it is difficult to know for certain because skulls are more commonly found than the mammal’s complete skeleton. These creatures also had very large heads (but small brains) in proportion to the rest of their bodies, making size estimation even more complex. From discovered bones, scientists believe that this animal looked like a cow with its hoofed feet. But it had a longer face than a typical cow, also with wider cheekbones and humped shoulders. Like warthogs , the Archaeotherium had bosses on the face, the large bumps that gave warthogs their “wart” name. Despite being called hell pigs, Archaeotherium did not have a pig-like nasal disc. What did Archaeotherium eat? The hell pig’s diet was omnivorous . This means they ate both plants and animals. They had teeth well-formed for eating even tough plants like stems and hard fruits. These same teeth enabled the animal to chew up bones. The Archaeotherium’s teeth and jaws were quite unique to this prehistoric family. In fact, its oral features are unlike any living animal. But there are parts of its mouth that seem similar to modern pigs, rhinos , bears , and other meat-eaters. Still, the hell pig could not chop up or tear meat with its teeth. It had to use its well-formed neck muscles and motion of its whole head to tear off chunks of its prey. In its North American territory, Archaeotheriums hunted prehistoric camels, Poebrotherium. They ran alongside their prey like a lion , then bit the neck of the animal to bring it down. In many instances, the hell pigs did not eat their fallen prey right away. Instead, they would move the kill to a cache to eat later when unable to hunt or locate their prey. Scientists have found fossilized remains of multiple pre-historic camels in caches like these. When it was time to eat the meat, Archaeotheriums tore the body in half and swallowed a foot-long rear section first. Other animals they hunted included prehistoric horses and rhinoceroses. Scientists believe Archaeotheriums chewed on one side of the mouth. This theory comes from the hell pigs teeth being more worn on one side. Their mouths also indicate that they used the front teeth to strip foliage from above-ground plants. Hell pigs often ate smaller mammals and fed on other predators’ leftover carcasses. Archaeotheriums lived in North America 35 million to 25 million years ago for a period of about 9.1 million years. Their eras included the Eocene and Oligocene epochs of the Paleogene Period . In North America , they lived in forested and riverbank areas of Colorado , South Dakota , North Dakota , Wyoming , Nebraska , and Texas before grasslands had developed. Remains have also been found in southern Canada , specifically in Saskatchewan. It is believed that predators of Archeotherium are responsible for the animal’s extinction . But little else is known about why they became extinct after 9.1 million years on Earth. Other threats included the hell pigs’ own argumentative nature toward each other. They fought amongst themselves often and are believed to have displayed their widely-gaping jaws in aggressive displays of dominance, just like a hippo . Adult fossils from this family show bite marks on their skulls that likely occurred during biting fights. Fossilized bones for Archaeotherium are most often discovered in the Great Plains’ White River Formation. However, they have been uncovered in multiple U.S. states, including South Dakota, North Dakota, Texas, Nebraska, Colorado, Wyoming, Oregon , and Saskatchewan. In the Toadstool Geologic Park of Nebraska, a set of Subhyracodon tracks show the animal was walking, then stopped and looked over its shoulder at Archeotherium stalking it. The Subhyracodon then ran at a high speed as an Archeotherium’s tracks joined it, indicating the hell’s pig was chasing the rhinoceros-like creature as prey. Other animals’ bones have been found cached in North America, presumably by Archeotherium. Archeotherium’s unique bites have also been discovered in other fossilized animals’ bones in the floodplains of North America. Scientists have not yet discovered what made the Archeotherium go extinct. However, they believe it was likely due to predation by bigger dinosaurs like the “bear dog” Amphicyon. Overall, the animal lived for about 9.1 million years from 35 million to 25 million years ago. This was during the Eocene and Oligocene epochs of the Paleogene Period of the Cenozoic Era . Similar dinosaurs to the Archaeotherium include:",
    "Similarity": 0
  },
  {
    "Name": "Donkey",
    "Text": "While donkeys are thought to be stubborn, they are actually highly intelligent creatures that can form tight bonds with humans. Donkeys are members of the horse family, although donkeys and horses represent two very different species. After domestication in Egypt and North Africa, where they were used for meat and milk, they evolved to become working beasts used to carry people or packages. They are slower than horses but are more surefooted. Historians believe that the domestication of donkeys increased the mobility of pastor cultures in the ancient world. Equipped with a social and calming nature, donkeys get along well with other domesticated mammals and can also be excellent companions for people with physical or mental disabilities. You can read more incredible facts about donkeys . See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The classification of these animals is within the family Equidae and the genus Equus – meaning horse in Latin. There are two main types of wild donkeys: Asian donkeys, whose range stretches from the Red Sea to Northern India and Tibet, resulting in several subspecies, and the African branch of the species. Among the Asian subspecies in the classification are Equus hemionus hemippus (Syrian Wild ass) and E quus hemionus khur (Indian wild ass). All modern domesticated donkeys have the scientific name Equus africanus asinus and have descended from African wild asses located primarily in Northern Africa between the Mediterranean Sea and the Sahara Desert. The African wild ass which is also known as the Equus africanus is the wild ancestor of the donkey we known today. Because some of the eaiest donkeys were found in ancient Egypt, archaelogists have concluded that these donkeys were domesticated from the Nubian Wild Ass or the E. africanus africanus by the villagers who lived in the Egyptian Nile Valley. Donkeys evolved and began to become domesticated about 5,000 years ago. Donkeys and Horses also share a common ancestor that dates about to close to 4 million years ago. These animals come in many different sizes and colors. Wild species grow to about 49 inches from hoof to shoulder and weigh about 551 lbs. Domesticated donkeys come in different sizes, depending on how they are bred. They are typically 36 inches to 48 inches from hoof to shoulder, weighing from 400 to 500 lbs. The Sicilian donkey is the smallest, reaching only 24 inches while the ass of Mallorca is about 62 inches. The Mammoth Stock, the largest domestic breed, is 56 inches from hoof to shoulder and weighs about 950 lbs. Color ranges for these animals range from white and gray to black. Grey is the most common color, followed by brown, black, and roan (white with a mixture of other pigmented hairs). Most usually have a dark stripe of fur down their backs from mane to tail and across their shoulders. They have short, upright manes with a tail that is more similar to that of a cow than that of a horse. They have very long ears that are dark at the tip and the base. Their large ears also help cool donkeys by using them in a fan-like manner. These animals enjoy the company of other donkeys and often bond with other individuals. When their kind is not present, they will often bond with horses, mules, and other small stock. Once a human has earned their confidence, they are often willing and companionable partners. Because of their ability to form strong bonds, separating a bonded donkey pair can cause stress leading to hyperlipidemia, a blood condition that can result in a heart attack or stroke. Although they have a reputation for stubbornness, this trait is a self-preservation characteristic, which is why it is difficult to force a donkey into doing something that it perceives as dangerous. Their body language is also less expressive than those of horses, so they can be hard to read. A slight widening of their eyes can be misread as a curiosity when it means stress or fear. A lack of movement when viewing an object that they fear is part of their reduced flight response. They will often defend themselves by biting, striking with the front hooves, or kicking with the hind legs. These animals are known to be intelligent as well as cautious, friendly, playful, and eager to learn, which usually begins from the moment they’re born and continues throughout their lifetimes. Domesticated donkeys are more territorial than horses, which is why they are sometimes used to guard herds of sheep and goats against predators, often stomping on anything that they feel is a threat. In many parts of the world where horses cannot easily survive or where there is extreme poverty, they are the primary beasts of burden and sources of transportation. They rest during the hottest part of the day and are more active in the morning and evening when they travel with the herd and eat. Domesticated donkeys are found all over the world in many different cultures, but if given their preference, they are best adapted for warm, dry areas – particularly marginal desert areas. This adaptation has provided them with hardy immune and digestive systems. Wild donkeys are usually solitary and do not form harems, with each adult establishing a home range. One jack may dominate breeding over a wide area. If a domesticated donkey becomes feral and can choose its home, it will look for a warm place to live. Wild donkeys live in deserts and savannahs in northern Africa , the Arabian Peninsula, and the Middle East. These animals also live in Turkey, China, and in northern areas of Pakistan, India, Nepal, and Bhutan. Their loud calls, also known as bray, and be heard over three kilometers and may act as a way for donkeys to keep in touch with each other in the wild. These animals are herbivores, meaning they eat no meat. They enjoy a variety of foods, including hay, oats, grains, and grasses, but they will also eat shrubs and desert plants in certain areas. Their large lips allow them to grab plants and pull them into their mouths where they rip them apart with large front teeth and grind them before swallowing. These voracious eaters can consume as much as 6,000 lbs of food each year. Their immense appetites can become a problem if they become feral and take over the food supply from local creatures. Some estimate that the world’s donkey population could fall by half within the next five years to meet the rising demand for donkey hides used in traditional Chinese medicine. In 2006, the world had a donkey population of approximately 41 million. The worldwide number appears to continue to decrease even among domesticated donkeys as some poachers have raided domestic herds in some areas to satisfy the need for donkeys to create the gelatin-based traditional medicine called ejiao. In the wild, donkey predators include foxes , wolves , and lions . A female donkey, called a jenny, is pregnant for about 12 months; however, gestation varies among different species from 11 months to 14 months. Jennies usually birth a single foal, with twins being rare. Although jennies come into heat within about 10 days of giving birth, their reproductive tract is not normal at that point, and they usually don’t breed again until one or two cycles have passed. Some breeds do not come into estrus (also known as heat) when they have a foal at their side. The average reproduction rate for domesticated donkeys is three foals over four years. Foals weigh between 19 and 30 pounds (about as heavy as a small dog) and can stand and nurse 30 minutes after birth. Jennies are very protective of their foals, who are weaned at about five months. A donkey can mate when it reaches two years of age. Donkeys are picky about who is in their herd, yet they don’t care who they mate with and often breed with other members of the Equus family. The offspring between a jackass and a mare is called a mule, which is also valued as a working and riding animal. Less common is the offspring between a stallion and a jenny, known as a shiny. Both types of crossbreed are usually sterile. Donkeys can also breed with zebras with the offspring most often called a zonkey . The average lifespan for a donkey is 27-40 years, however, they can live for much longer. The oldest donkey on record was a female domesticated donkey in the U.S. who lived to be 54. More than 50 million donkeys inhabit the world with most of them domesticated, living primarily in underdeveloped countries where they work or carry cargo. Despite their great numbers, few animals within each breed are purebred. Several wild donkey species are on the edge of extinction. The International Union for the Conservation of Nature (IUCN) , indicates that the African wild ass is critically endangered , with only 23 to 200 adults remaining. Asian wild asses (also known as Asiatic wild asses) are classified as near threatened , with a population of about 28,000. Most threats come from humans, either directly or through indirect habitat loss. American Mammoth Donkey: The American Mammoth donkey was created by crossbreeding several different imported breeds of donkeys which includes the Marjorcan, Catalan, and the Andalusian. Standard Donkey : Interestingly enough, the standard donkey is known to fight off predators and guard other animals. Miniature Donkey : Miniature donkeys are good companion animals. They can live over 35 years old and their short height makes them easy to handle and care for. American Spotted Ass : Many donkeys don’t have spots, however, there is one breed that does and they are a result of various breeds of donkeys. Andalusian Donkey : These types of donkeys were actually so treasured in their home country of Spain that they were only allowed to export them in 1785 and not sooner like many other breeds. Catalan Donkey (Catalonian) : This breed of donkey is endangered and there are now only 851 left in Spain. Balearic Donkey (Majorcan, Mallorquin) : The Balearic donkey or sometimes called the Majorcan or the Malloriquin, is lighter and smaller than the Catalan African Wild Ass : This breed of donkey is known as the modern donkey and are often grouped into the donkey category. Poitou Donkey : There are very few of this breed of donkey found in North America. Actually, there are only about 400 of these donkey still alive today. Burro : The burro population in Mexico is plenty, and there are about 3 million burros in Mexico! The term burro actually means donkey in Spanish. Maltese Donkey : Maltese donkeys were brought to America and were important to the establishment of the American mammoth donkey. Donkeys are one of the most frequently used draft animals, history shows them going back to ancient Egypt around 6000 years when they were used for milk and meat. However, the first hybrid donkey shows up in history in the 3rd millennium BCE. The first hybrid was called Kunga and was believed to have been bred during the time of the Syrian and Mesopotamian dynasties. Kunga was a crossbreed between domesticated females and a wild Syrian Ass. At the time, they were supposedly considered to be a symbol of wealth and even used to pull battle wagons and even the chariots ridden by the kings. They were even given as gifts and buried with their owners. However, with the domestication of wild horses and their subsequent breeding with donkeys, Kungas slowly faded from history. Similarly, there are many donkey hybrids that are used as draft animals: It’s important to note that these cross-bred species are sterile and do not produce offspring. They are very useful as draft animals because most of the time the mules and zonkeys inherit their strength from the male horses.",
    "Similarity": 2
  }
]
