[
    {
        "Name": "Western Tanager",
        "Genus": "Piranga",
        "Diet": "Insectivore that eats bees, wasps, grasshoppers, ants, beetles, cicadas, stinkbugs, and termites and especially likes insects",
        "Behavior": "They can be characterized as mainly solitary pair.",
        "Features": "Contrasting black and yellow color",
        "Fun_Fact": "They migrate farther north than any other tanager.",
        "Text": "The western tanager migrates farther north than any other tanager. The western tanager is native to the Americas, wintering in Mexico and Central America before migrating to the Western United States and Canada. They spend their days on the tops of coniferous trees, searching for food and feeding their young. They may be challenging to spot due to their location, but listen closely for their hoarse robin-like songs and bright yellow and orange coloring. Learn everything there is to know about this beautiful bird , including where they live, what they eat, and how they behave. The western tanager lives in and migrates through at least 14 countries, such as Canada, the United States, Mexico, Nicaragua, and Costa Rica . You can find them in the western United States and northwestern Canada during the warmer months and in central to southern Mexico and Central America during the winter. They breed in open woodlands, primarily in Douglas-fir and Ponderosa-pine trees. You may occasionally find them in aspen forests, wetlands, forest edges, parks , gardens, and burns. During migration, they stop in a wide range of habitats, like urban areas , backyards, parks, forests, and woodlands. During the winder, also inhabit forests and woodlands. To find them, listen for their hoarse songs and chuckling calls. Look to the tops of the trees where they nest and forage; wait for their flashes of yellow and orange. Females build the nests by themselves, while males keep watch. The process takes four to five days, and females diligently scrutinize their potential nesting sites. She chooses a spot in an open canopy area, usually in a fir or pine tree on a horizontal branch away from the trunk. The nest foundation consists of twigs, weaved until they form a cup. And she lines the inside with soft materials like animal hair, feathers, grasses, and plant fiber. The western tanager (Piranga Ludoviciana) belongs to the Cardinalidae family, which includes Piranga tanagers, cardinals, grosbeaks, and buntings. Its genus Piranga is the cardinal bird family, and its specific epithet, Ludoviciana, is Late Latin for “Louisiana.” This species is monotypic, and no other subspecies exist. The western tanager is a medium-sized American songbird, measuring 6.3 to 7.5 inches long and weighing 0.8 to 1.3 ounces, with an 11.5-inch wingspan. They have stocky bodies with thick bills and medium-sized tails. Adult males are bright yellow with black wings and an orangish-red head. They also have white wingbars and black backs and tails. And females are an overall yellowish-green, while immatures have less red on their heads than adult males. Western tanagers are relatively solitary, except for when they form pair bonds. During winter, they may forage with other mixed-species flocks. They spend many days slowly moving along branches and shrubs, looking for food. But the males are vocal, especially during the breeding season. His songs are hoarse, short, and robin-like. These birds are also excellent, swift fliers with powerful wing beats. However, we don’t know their exact speed. Western tanagers are long-distance migrants who move alone or with small groups at night. They migrate farther north than any other tanager. They spend their springs and summers breeding on the west side of the United States ( Colorado , Wyoming, Idaho, Washington, etc.) and as far north as Northwest Canada near Yukon. They migrate through the Central US, parts of the West Coast, and Mexico before reaching their wintering grounds in Southern Mexico and Central America (Guatemala, Honduras, Nicaragua, and Costa Rica). Some also winter in Southern California . Western tanagers are mainly insectivores who supplement their diet with fruits and berries. They primarily eat insects, such as bees, wasps, grasshoppers , ants, beetles, cicadas, stinkbugs, and termites. During the fall and winter, when insects are no longer abundant, they will eat wild cherries, elderberries, mulberries, blackberries, buds, and seeds. They spend much of their time picking food from branches and foliage in shrubs or at the tops of trees. They will also fly out and grab flying insects like dragonflies and will clip the insect’s wings before swallowing. The IUCN lists the western tanager as LC or “least concern.” Due to its extensive range and large, increasing population, this species does not meet the thresholds for “threatened” status. While they are not experiencing any significant ongoing threats, they are still vulnerable to the effects of climate change . Spring heat waves and wildfires could endanger their habitats and young in the future. Hawks, owls , and jays are known predators of adult western tanagers. Their nests are vulnerable to owls, jays, snakes, black bears , crows, ravens, and squirrels. They make loud calls, flap their wings, and swoop toward intruders to defend themselves and their nests. Western tanagers are monogamous breeders who perform courting displays, such as chasing each other. Males defend their nesting territory by constant singing, and the two rarely leave each other’s sides. The breeding season runs from mid-April to mid-August, and females lay 3–5 bluish-green eggs with brown markings. Females incubate for 13 days, while the males bring food. But both parents share the feeding duties of their nestlings. The young leave the nest around two weeks after hatching and undergo a pre-juvenile molt shortly after fledging. These tanagers reach sexual maturity at around one year and can live up to 15 years, but live to an average of 8 years. The global population of the western tanager is unknown, but their numbers appear to be stable. Their species has increased slightly over the last 49 years in North America and doesn’t appear to suffer from extreme fluctuations or fragmentations.",
        "score": 0.7932278
    },
    {
        "Name": "Summer Tanager",
        "Genus": "Piranga",
        "Diet": "Insectivore that eats they primarily eat insects but will occasionally supplement with berries and enjoys bees and wasps and especially likes invertebrates like spiders, cicadas, ants, beetles",
        "Behavior": "They usually live in pairs and can be characterized as solitary.",
        "Features": "Bright red coloring",
        "Fun_Fact": "They remove bee stingers by rubbing them against a tree",
        "Text": "Summer tanagers are the only completely red bird in North America. You can spot the summer tanager in the United States during the warm months before it heads to its tropical wintering grounds. Its bright red plumage starkly contrasts its preferred forest habitats, where it feeds on insects and fruit. Listen for their soft, sweet melodies as they flutter out from their tree branch to catch bees and wasps . Find out all the fascinating summer tanager facts, including where to find them, how they behave, and how they care for their young. The summer tanager spends spring and summer in the southern portion of the United States, including Texas , Louisiana , and Florida . It may also breed in Mexico before heading further south during the winter, inhabiting all of Central America and the northern region of South America , like Colombia and Venezuela . They breed in dry, open deciduous or pine forests in the Southeast but inhabit low-elevation cottonwood forests near streams in the Southwest. During migration, they inhabit similar habitats. When they get to their wintering grounds in the tropics, they live in solid forests and forest edges. To find them, look in the mid-canopy of their woodland habitat and listen for their robin-like songs. Females place their nests in pine or oak trees on a horizontal branch no more than 35 feet above the ground. She gathers materials and builds the nest herself while the male follows her back and forth. It is a loosely-made shallow cup of grass, weeds, bark strips, and spider webs. She also lines the inside with fine grass. The summer tanager ( Piranga rubra ) is from the Passeriformes order, which includes perching bird species. Its Cardinalidae family comprises New World passerine birds like cardinals, grosbeaks, and buntings. Originally placed in the tanager family (Thraupidae ), it was reclassified into the genus Piranga , birds placed in the cardinal family. Rubra is Latin for “red.” These medium-sized songbirds have chunky bodies, large heads, and stout, pointed bills. The summer tanager is larger than a warbler but smaller than a robin, measuring six to seven inches, weighing 0.6 ounces with an 11-inch wingspan. They are the only entirely red bird in North America . Adult males are bright red over their entire bodies, while females and juveniles are a greenish-yellow color with pale bills. These tanagers are solitary outside the breeding season but may follow mixed-species flocks on their wintering grounds. They like to stay high in the forest canopy, moving slowly along tree branches and singing their soft, sweet tunes. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Summer tanagers are long-distance migrants. They breed in the Southern regions of the United States and northern areas of Mexico. In September and October, they migrate by land or over the Gulf of Mexico at night. They winter in Central America, Cuba, and Northern South America before returning to their breeding grounds in late May. Summer tanagers primarily eat insects but will occasionally supplement with berries. Their favorite food is bees and wasps, which they catch mid-air and then bang and rub against a branch to kill and remove their stingers. They also eat other invertebrates like spiders , cicadas , ants , beetles , termites , flies , moths , and grasshoppers . In some areas, they may hover and pluck fruit like blackberries, mulberries, citrus, and bananas. The IUCN lists the summer tanager as of “ least concern .” Due to its extensive range and large, stable population, this bird does not meet the threshold for a vulnerable or threatened species . However, some areas have experienced a loss of habitat due to the agricultural industry and urbanization . In the future, their young may become vulnerable to spring heat waves if climate change worsens. Adult tanagers can become prey to birds of prey, such as hawks and owls . Their young are particularly vulnerable to rat snakes , squirrels , raccoons , blue jays , and other large birds. Male tanagers sing to defend their territories and chase away intruders. Males chase females during the early stages of courting. Once they’ve paired, they stay together for one breeding season but may have a different mate yearly. After the females build the nest, she lays between three and five bluish-green eggs with brown and gray spots. Incubation takes 11 to 12 days and is solely done by the female. Both parents feed the nestlings, and they fledge the nest around ten days old. However, they cannot fly for a few more weeks, so they cover in vegetation and cry for food. The parents will continue to feed them for at least three more weeks. They reach sexual maturity and molt for the first time around one-year-old and every spring between February and April. Their average lifespan is four to six years. The summer tanager’s global population is unknown, but IUCN lists their numbers as stable. North America’s population trends have been stable for the last 40 years with no extreme fluctuations.",
        "score": 0.7931589
    },
    {
        "Name": "Acadian Flycatcher",
        "Genus": "Empidonax",
        "Diet": "Insectivore that eats wasps, bees, caterpillars, ants, flies, beetles, moths, spiders, and millipedes and especially likes insects",
        "Behavior": "They usually live in pairs and can be characterized as solitary.",
        "Features": "Olive green coloring with white wingbars",
        "Fun_Fact": "Their nests are sloppily held together and have an abandoned appearance",
        "Text": "“ Search for these birds in the mid-story of tall trees and look for quick movements as they sally out to catch insects. ” The Acadian flycatcher ( Empidonax virescens) is a small passerine bird native to North and South America, where they inhabit wet riverside forests. They spend their days swiftly maneuvering through trees as they search for insects and small fruit. These solitary birds sing their songs early in the morning and defend their riverside nests with a monogamous partner. Discover all the fascinating Acadian flycatcher facts, including where they live, what they eat, and how they behave. Acadian flycatchers live in North and South America in over 15 countries, including the United States, Mexico, Venezuela, Colombia, and the Bahamas. Their range includes Southwestern Ontario and the Southeastern United States during spring and summer. They migrate through Mexico and Central America before reaching their wintering grounds in Northwestern South America. They breed in wet deciduous forests, such as swamps and dense riverside woods, and live in woodlands in their tropical winter homes. Search for these birds in the mid-story of tall trees and look for quick movements as they sally out to catch insects. They nest in tall trees or large shrubs in horizontal forks away from the trunk. Females form a loose cup made from weed stems, twigs, and grass and lined with plant down. They may use spider webs to hold the material together, but the nest often has a sloppy appearance making it look abandoned. The Acadian flycatcher (Empidonax virescens) belongs to the Passeriformes order in the Tyrannidae family, which encompasses the tyrant flycatchers with over 400 species. The Empidonax genus includes small flycatchers, and the name is Ancient Greek for “gnat” and “master.” They were discovered in Acadia (present-day Nova Scotia), but they do not inhabit this area today. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Acadian flycatchers are small passerine birds, measuring 5.5 to 5.9 inches long and weighing 0.4 to 0.5 ounces, with an 8.7 to 9.1-inch wingspan. They have long tails, broad bills, large heads, and long wings. Adults are olive-green above and whitish below, with dark wings and white wingbars. Their bills are dark above and orange-yellow below. These birds are mostly solitary, except during breeding, when they form monogamous pairs and nest near other flycatchers. They typically spend their time perched in the mid-canopy of their forest habitat, sallying out to catch insects and returning to their perch. They sing their songs early in the morning, an emphatic two-note “peet-seet!” The Acadian flycatcher is fun to watch as he quickly maneuvers through trees, using rapid wingbeats to take direct flights. Their exact speed is unknown. Acadian flycatchers are long-distance migrants who begin their spring migration in early March and their fall migration in mid-September. They breed in the southeastern portion of the United States, from South Dakota down to Texas and east through New York and Florida. During migration, they travel along the Gulf Coast down to Mexico and through Central America before reaching their wintering grounds in Northern South America (Colombia and Venezuela). Acadian flycatchers are primarily insectivores who forage by watching from a perch. Their diet consists of wasps , bees, caterpillars, ants, flies, beetles, moths, spiders, and millipedes. They also supplement their diet with some small fruits and berries. They select a perch from the mid-canopy, where they sit and watch before flying out to catch insects mid-air. This flycatcher will also snatch bugs from foliage while they hover. The IUCN lists the Acadian flycatcher as LC or “least concern.” Due to its extensive range and extremely large, stable population, this species does not meet the “threatened” status thresholds. Their biggest threats include habitat loss and degradation from forest clearing as a result of agricultural and urban developments. They also face future climate threats, like spring heat waves, which can endanger nestlings. Their predators include crows, hawks, owls, jays, cuckoos, domestic cats, rat snakes, squirrels, chipmunks, and mice. Their young are more likely to fall prey, but parents build their nests in trees hanging over bodies of water because they are easier to defend. Males give rapid alarm calls to warn of intruders and may become aggressive if necessary. Their breeding season falls between April and August, and they form monogamous long-term pair bonds, where they mate with one partner for many years. However, some males have been observed practicing polygamy and will mate with several females. Females lay two to four creamy white eggs and incubate them for 13 to 15 days. Their young fledge the nest when they can fly, around two weeks after hatching. The father feeds the fledglings while the mother begins incubating the second batch of eggs. They reach sexual maturity around one year and live an average of three years, but they can live up to 12. The global Acadian flycatcher population is estimated to number 5.2 million mature individuals. The species declined slowly from the 1970s to 2017, but recent trends suggest their numbers are stabilizing and possibly increasing slightly.",
        "score": 0.7895726
    },
    {
        "Name": "Dragonfly",
        "Diet": "Carnivore that enjoys mosquitoes and especially likes fly, bee",
        "Fun_Fact": "It's larvae are carnivorous!",
        "Text": "Dragonflies eat mosquitoes, gnats, and cicadas making them an important part of the ecosystem . These amazing insects also serve as a food source for a variety of fish and birds . They are found on every continent with the exception of Antarctica . Wooded areas as well as freshwater lakes, ponds, marshes, and streams are all habitats of the dragonfly. Anisoptera is the scientific name of these insects. While Anisoptera is its family, the dragonfly belongs to the order classification of Odonata. The word Odonata is Greek meaning ‘toothed one.’ This refers to the jaws of this insect . There are around 7,000 species of true dragonflies . These insects are closely related to the damselfly though damselflies have the suborder classification of Zygoptera. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . These insects live everywhere on the globe except for Antarctica . They live in warm climates and near bodies of water including lakes, ponds, marshes, and streams. Adults are easily recognizable by their narrow, needle-like bodies and two pairs of slender, colorful wings. There are 14 types including: Dragonflies are an ancient species of insects that have existed for over 300 million years. They belong to the order Odonata, which also includes damselflies. The earliest dragonflies were much larger than the dragonflies we see today, with some species having wingspans of over two feet. Dragonflies have undergone little evolutionary change over the past 300 million years, as they have already evolved to be perfectly adapted to their environment. Their long, slender bodies, large wings, and powerful flight muscles have allowed them to thrive in a variety of habitats, from freshwater streams to open skies. The evolutionary success of dragonflies can be attributed to their adaptability and versatility. They feed on a variety of prey, including mosquitoes, flies, and other insects, and their larvae can live in a variety of aquatic habitats, from still ponds to fast-flowing streams. This has allowed dragonflies to spread to almost every corner of the world, and to occupy a wide variety of ecological niches. The fossil record of dragonflies provides important insights into the evolution of insects and the ancient earth. It shows that dragonflies have been able to survive and thrive in a changing world and that they have been an important part of the food chain for millions of years. Furthermore, dragonflies are a fascinating and ancient species of insects that have adapted and evolved over millions of years to become the highly successful creatures we see today. They continue to play a crucial role in many ecosystems, serving as both predators and prey, and providing valuable insights into the evolution of life on earth. An adult measures from 1 to 5 inches long and weigh less than 1 ounce. They have 6 legs and 2 pairs of wings. The wingspan of the insect can measure up to 6 inches. This insect’s color depends on what type it is. They can be brown, blue, yellow, green, or red. Their wings have an iridescent or metallic appearance. The damselfly is the closest relative of the dragonfly. They are similar in appearance with two pairs of wings and brightly colored bodies. However, a notable difference is a dragonfly rests with its wings spread out while a damselfly rests with its wings pulled together. The largest type of dragonfly is the giant garner dragonfly . Its scientific name is Anax walsinghami . It’s 5 inches long with a 5-inch wingspan. These insects have a few adaptations they use to protect themselves from predators. For one, they can fly up to 35 mph! Also, they can change directions mid-air allowing them to escape some predators. Their eyes provide them with a 360-degree view of their environment. So, they’re likely to see a predator soon enough to make an escape. These insects are solitary. But, when they do form groups, they are called a flight or a cluster. Males can be aggressive when defending their territory from other males. These insects are found throughout the world except for Antarctica . Though they don’t live in people’s homes, some do live near people. These insects make their home around bodies of water including ponds, streams, lakes, and rivers. If a homeowner has a pond on their property, there are likely to be dragonflies in the area. Or, if a family lives near a large creek or river, they may see dragonflies moving through the area. These insects have a carnivorous diet. Specifically, they eat insects which have earned them the classification of an insectivore. Frogs , fish , birds , and large spiders are all predators of adult dragonflies. A dragonfly baby also called larvae or nymph is vulnerable to the same predators. These insects eat mosquitoes, gnats, and cicadas. An adult eats from thirty to over 100 mosquitoes each day. Some types of dragonflies hunt at night while others look for food during the day. Want to discover more about the diets of dragonflies? Check out our complete guide: ‘ What Do Dragonflies Eat .’",
        "score": 0.7836738
    },
    {
        "Name": "Hepatic Tanager Red Tanager",
        "Genus": "Piranga",
        "Diet": "Insectivore that eats mainly insects and spiders, including caterpillars, moths, bees, and ants",
        "Behavior": "They can be characterized as social family units.",
        "Features": "Bright coloring",
        "Fun_Fact": "Parents and their young sing sweetly to each other",
        "Text": "They sing sweet whistling songs to each other. If you ever find yourself hiking through pine forests in the Southwestern mountains, listen for the pleasant whistling melodies of the hepatic tanager. While their bright red and yellow colors don’t offer much camouflage, they like to feed in the trees’ interior, making them difficult to spot. Researchers don’t know much about this species, making spotting one in the wild more exciting. Learn everything there is to know about the unstudied hepatic tanager! The hepatic tanager lives in over 20 countries, including the United States , Brazil , Costa Rica , Ecuador , and Mexico . It has an extensive range in South America , primarily the eastern portion of the continent, where it lives year-round. These birds also inhabit areas of Central America and Mexico all year. The northern hepatic tanager species live in the Southwestern United States during the breeding season before migrating to Mexico for the colder months. In the United States, these tanagers breed in pine woodlands at high elevations. During migration, they will inhabit similar pine-oak habitats but at lower elevations. They live in many environments south of the US border, including desert oases, mountain forests, arid lowlands, and farmsteads. Look for these tanagers in the Arizona and New Mexico mountains during spring and summer, and listen for their sweet melodies, often shared between pairs and their young. You will find their nest approximately 30 feet above the ground in a tree fork near the end of a branch, most likely on a pine or oak tree . The nest itself is a wide, flat cup made of grass, twigs, and other plant matter. The females line the inside with soft materials like moss, animal hair, flowers, and grasses. The hepatic tanager’s scientific name is Piranga Flava. Its common name hepatic means “liver-colored,” referring to its reddish-brown coloring. Its scientific name , Flava , means “yellow” or “golden” in Latin. Hepatic tanager has three subspecies: Hepatica, Lutea, and Flava. Hepatic tanagers are stocky, medium-sized birds with short tails, stout bills, long tails, and long wings. These solid birds are between 3.5 and 7.9 inches long, weigh 0.8 to 1.7 ounces, and have a wingspan of 12.6 inches. The northern group tends to be larger than their southern counterparts, but both are larger than a sparrow and smaller than a robin . Adult males are a brick-red color with gray edging and ear tufts. The females are olive and yellow with grayish ear tufts, and the juveniles are gray and olive with light streaks. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Males establish territories in the spring and defend them with their inquisitive whistles. Most mating partners stay together after breeding, often forming family groups. They may also join other small groups. Their average lifespan is five years. Hepatic tanagers are short-distance migrants in the northern parts of its range in the United States. It lives year-round in its environments in Central and South America. Those that stay in the Southwestern United States during the breeding season will move further south down to Mexico during the winter. Hepatic tanagers are primarily insectivores who feed in groups. These birds eat mainly insects and spiders, including caterpillars , moths , bees , ants , grasshoppers , butterflies , and beetles . The hepatic tanager also eats berries, seeds, flowers, and nectar. It forages in trees and bushes, hopping along branches methodically until it finds hidden insects . It may even briefly pursue its prey mid-flight if it tries to escape. This species also feeds together in groups or pairs. The IUCN lists the hepatic tanager as “least concern.” Their population continues to increase over an extensive range and does not qualify for “threatened” status. But that doesn’t mean this species may not suffer from future threats. As warming increases, these birds are susceptible to habitat and resource losses from droughts and wildfires. Spring heat waves can also damage the young in their nests. Adult tanagers are a food source for birds of prey like owls and falcons . Their eggs and nestlings often fall victim to smaller birds like blue jays , grackles, and crows . Other animals like squirrels , chipmunks , and snakes may also steal babies from their nests. Not much is known about how they defend their young. Tanagers are mainly known for their singing duels and are not relatively aggressive. However, researchers have witnessed males and females scolding, posturing, and chasing intruders. Females primarily build the nests, occasionally accompanied by the males who assist in carrying building materials. Little is known about their courtship displays, except that the males bring the females food during courting and incubation. Females lay three to five bluish-green eggs with brown spots, and both sexes provide incubation and feedings to nestlings. Not much else has been discovered about their reproduction process, including incubation length and when the chicks fledge the nest. Hepatic tanagers are sexually mature at one year of age. The number of mature individuals in their population is unknown, but researchers classify them as a common species. From 1970 to 2014, their population increased by 124%, and within the last three generations, they have increased by 24%. However, these surveys covered less than 50% of the global population. Much of their southern territories in Central and South America are unstudied.",
        "score": 0.7790668
    },
    {
        "Name": "Insects",
        "score": 0.7780218
    },
    {
        "Name": "Scarlet Tanager",
        "Diet": "Insectivore that eats mainly invertebrates, including moths, butterflies, ants, and beetles",
        "Behavior": "They usually live in pairs flocks and can be characterized as solitary.",
        "Features": "Black and red contrasting colors",
        "Fun_Fact": "Males molt into an olive-yellow color during the fall and winter",
        "Text": "“Listen for their robin-like warbles in Eastern deciduous forests.” The scarlet tanager inhabits mature forests high in the canopy. Look for their contrasting black and red colors as they perch on branches and dash out to grab their prey. You may hear their raspy warbles before you see them. Although, their calls are often mistaken for a robin’s . Discover everything about this fascinating bird , including where you can find them and how they behave. The scarlet tanager lives in over 35 countries, including the United States , Canada, Mexico, Cuba, and Peru. It spends spring and summer in the Northeast United States and parts of Southern Canada. They migrate through Central America and the nearby islands before stopping in Northwestern South America for the winter. They live in mature deciduous forests and some mixed conifer forests in their summer habitats. When they’re migrating, they stop in similar forest environments but also reside in parks and gardens. In their South American winter homes, they inhabit mature forests on hills and mountains, often near a forest edge. To find them, look for flashes of red high in the trees and listen for their raspy robin calls. Females choose their nest site in a shady deciduous tree around 50 feet above the ground. She builds a shallow open cup on a horizontal branch away from the trunk. It takes her around three days to make the nest, and she begins by finding material on the forest floor. The materials include twigs, grasses, bark strips, and pine needles; she lines it with vine tendrils and fine plant fiber. The scarlet tanager (Piranga olivacea) is from the Cardinalidae family, which encompasses New World passerine birds , such as cardinals, grosbeaks, and buntings. The Piranga genus comprises members of the cardinal family, and its specific name, Olivacea, is New Latin for “olive-green.” These medium-sized American songbirds are the smallest Piranga species north of the Mexican border. The scarlet tanager is stocky with thick bills, large heads, and short, broad tails. They are smaller than a northern cardinal , measure 6.3 to 6.7 inches, weigh 0.8 to 1.3 ounces and have a 9.8 to 11.4-inch wingspan. Adult males are a dazzling red color with black wings and tails. Females and immatures are olive-yellow with darker green wings and tails. After the breeding season, males molt into their winter plumage, which resembles the females. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Males arrive early to the breeding grounds, where they defend their territories. They perform singing battles with other males and will sometimes get into confrontations involving threatening postures and eventual chasing. Pairs are fairly solitary during the breeding season but disperse quickly to join flocks for migration and wintering. The scarlet tanager is a long-distance migrant. This bird inhabits the Northeastern United States and parts of Southeast Canada during the warmer months. During migration, they fly at night, cutting across the Gulf of Mexico, Cuba, and the eastern coast of Central America. Their wintering grounds are in Northwestern South America, like Ecuador and Peru. Scarlet tanagers are insectivores who supplement their diet with fruit and tender buds. They eat mainly invertebrates, including moths, butterflies, ants , beetles, flies, cicadas, termites, grasshoppers, locusts, snails, and spiders. They also eat wild berries like mulberry and elderberry. To find food, they walk along branches peeling back the bark. They often sit perched or hover to grab flying insects mid-air quickly. If they can’t swallow their prey whole, they squish it by pressing it into a branch. The IUCN lists the scarlet tanager as LC or “least concern.” Due to its extensive range and vast, stable population, this bird does not meet the criteria for a “threatened” species. While no significant threats exist to this tanager, they are still vulnerable to habitat loss, and forest fragmentation may affect their population over time. They are also susceptible to the effects of climate change, such as spring heat waves, wildfires, and heavy rainfall. Adult scarlet tanagers can be eaten by birds of prey like owls and merlins. But their young are the most vulnerable and often fall victim to blue jays, crows, grackles, squirrels , chipmunks, and snakes. They may be still around other birds like crows, choosing to be silent and watchful. But when necessary, they will mob predators by diving, swooping, and calling. During courting, males hop around with their wings drooped and tails spread, showing their contrasting colors. When pairs form, they are monogamous during the breeding season but will switch mates annually. Females lay between two and five bluish-green eggs with brown spots and provide incubation for 12 to 14 days. Both parents feed the nestlings, and they fledge the nest nine to 15 days after hatching. However, parents feed them for another two weeks until they are fully independent. Scarlet tanagers are sexually mature and molt for the first time around one-year-old. They can live up to 11 years. Its global population is unknown, but according to the IUCN, its numbers have been stable in North America for over 50 years (1966 to 2019). While not exact, Partners in Flight estimate its breeding population at 2.6 million mature individuals. They are also not experiencing any extreme fluctuations or fragmentations in their numbers. Sources:",
        "score": 0.77489823
    },
    {
        "Name": "Green Anole",
        "Genus": "Anolis",
        "Diet": "Carnivore that eats small insects",
        "Behavior": "They can be characterized as territorial.",
        "Features": "Dewlap",
        "Fun_Fact": "It communicates with head movements, color and dewlap",
        "Text": "The green anole is the only anole that is native to the United States and is one of the best reptiles for first-time reptile owners. The small lizard is native to Georgia and South Carolina, found in the Southeastern United States from Florida to Texas along with the Caribbean islands. It is an arboreal species that is related to the iguana. Although they are often called the American chameleon due to their color-changing ability, it is not a true chameleon , which is not native to the United States. Other names are common green anole, American green anole, Carolina anole, and red-throated anole. The green anole, also known as carolinensis , and sometimes mistakenly referred to as the American chameleon, originates from the southern regions of the United States. Although it can exhibit color variations ranging from green to brown or spotted, its capability to change colors is relatively limited when compared to that of authentic chameleons found in the Old World. Anolis lizards have their roots in mainland America, but they have successfully expanded their territory to the Greater Antillean islands and subsequently returned to the mainland, creating three distinct categories (Primary and Secondary Mainland and Greater Antillean) in the process. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Furthermore, through DNA sequencing, it has been established that the anole is connected to larger lizards originating from Hispaniola. The green anole’s scientific name is Anolis carolinensis. Anolis is a genus of lizards in Iguana or Iguanomorpha suborder and the Dactyloidae family. It is part of the larger Reptilia class and Squamata order. The Iguana suborder includes the color-changing iguana, chameleon, and agamid along with New World lizards such as anoles and phrynosomatids. The green anole is a small to medium-sized lizard. It has a slender, agile body, a long, pointed head with ridges between the eyes and nostrils, smaller ridges on top of its head, and toe pads. The species is sexually dimorphic with males being 15 percent larger and females being smaller in all body size measurements. Males also have a dewlap (throat fan) that is three times larger than the female’s and turns bright red, whereas the female’s range from white to pale pink and is not a common feature. Males also have a dorsal ridge that they can extend behind the head while displaying or experiencing stress. Finally, males get scars on the head and face from fighting other males over territory or during the mating season. Females have a white stripe running along their spine, unlike most males. Additionally, there are heavyweight and lightweight size classes or morphs of adult males, which can both exist within one population. These differ in dominance, bite force, body mass and length, competition, and vertical jump. Color changing depends on the environment and health or mood. When it’s green, it’s active and in bright light. When it’s brown, it’s less energetic and in a cool or moist environment. The males puff out their dewlap, do pushups, or bob their heads when intimidated by other males. They are territorial and will fight with other males by biting, scratching, or chasing them away. They usually live in the wild with 2-3 females in a territory that is 1 cubic meter (35 cu feet). It is a fact of male territorialism that lizard owners should keep them alone or one male with a few females. Green anoles are diurnal (active during the day) and throughout the year. They are especially active during the spring and fall, while winter activity depends on the temperature and amount of sunlight. They are cold-blooded but heterothermic, meaning they can self-regulate their body temperature to a degree, but they also need supplemental heat for digestion and health. The typical habitat of green anoles is the moist forests and brushy clearings of neotropical and Nearctic regions including Georgia, South Carolina, and the southeastern United States. However, it has spread to the foliage of urban areas and the low country shrubs of the Carolinas as well as to Hawaii, the Ogasawara Islands of Japan, Cuba, the Bahamas, and Guam. Green anoles have a largely insectivorous, carnivorous diet consisting of mealworms, grubs, maggots, and small insects such as beetles , fruit flies, and termites. They also eat house flies in Georgia, South Carolina, and other southeastern urban areas, occasionally eat grains and seeds, and even other small lizards such as skinks. They only notice prey that is moving. For a full analysis of their diet, check out ‘ What Do Green Anoles Eat? The Main Foods in their Diet .’ One of the uses for the green anole’s color-changing ability is to hide from predators by blending in with trees and bushes. Broadhead skinks, snakes, and birds are common predators, with cats being another in urban habitats. Although the green anole is threatened by over-predation, it is not endangered in general. It did, however, go extinct on one island in the Bahamas due to the curly-tailed lizard, a ground-dwelling species which eats lizards and anoles. In Guam, predators such as brown tree snakes (scientific name Boiga irregularis) have reduced their population density. The brown anole is an invasive species in the green anole’s native habitat and competes with it for shelter and food. As a result, the green anole evolved to live higher up in trees and grow bigger toe pads to be able to climb and run faster. Green anoles reach sexual maturity at 8 to 9 months. The mating season for green anoles is from April through August or 4-5 months out of the year. During this time, males attract females with head-bobbing and extending their dewlaps. Females who are receptive to mating arch their necks. The male bites the neck of the female and this is a behavior unique to green anoles. He then places his tail under the female and then mounts her back. The warmer months have the highest reproduction rate due to the heat increasing the size of the gonads. Males are territorial in order to protect their mating partners from intruding males, while females mate in sheltered areas and closed terrain to reduce exposure to predators. Female green anoles have the ability to store sperm for delayed fertilization. The gestation period is 5-7 weeks, with the female laying one egg every two weeks for an average of 6-9 eggs a year. The eggs are buried in moist soil which the female digs and left to incubate and hatch on their own, meaning the young are left to fend for themselves. These anoles are the most commonly seen lizard in Alabama and the most common lizard in both urban and suburban areas in the southeastern United States. Florida used to contain the majority of green anoles, but they have been largely replaced by invasive anole species such as the brown anole (scientific name Anolis sagrei). On the other hand, the green anole is an introduced species in Hawaii, the Ogasawara Islands of Japan, Cuba, the Bahamas, and Guam.",
        "score": 0.7710995
    },
    {
        "Name": "Orange Tanager Orange Headed Tanager",
        "Genus": "Thylpopsis",
        "Text": "“It lives in the lowlands of the Amazon rainforest.” The orange tanager (orange-headed tanager) is a small bird native to the neotropical region of South America . It spends its days foraging in trees and shrubs for insects, often with a small group. Though relatively uncommon, they have an extensive range and learn to adapt to disruptions in their environment. Discover everything there is to know about this orange bird , including its habitat, diet, and behavior. The orange tanager lives in eight countries in South America, including Argentina , Bolivia, Brazil, Colombia, Ecuador, Paraguay, Peru, and Venezuela. It inhabits the lowland areas of the Amazon rainforest but can be found in elevations up to 2,600 feet. It lives in semi-humid savannas, open woodlands, parks , and riparian forests in the Southern Amazon. You can find it in scrub, brush, and open woodland edges in Argentina. They will also inhabit heavily degraded former forests, but rarely in uninterrupted forests. Females place their nests in trees around six feet above the ground, most likely in a fork with plenty of vegetation. She makes a cup-shaped nest from twigs and other plant material. The orange tanager ( Thlypopsis sordida) is from the Thraupidae family, which encompasses a large portion of neotropical perching birds. Its genus, Thlypopsis, included eight tanager species, of which the orange-headed tanager is the type species. It’s Ancient Greek for an unknown small bird. Its specific name, Sordida, is Latin for “dirty” or “shabby.” The orange tanager has three recognized subspecies. This small tanager measures 5.1 inches and weighs 0.49 to 0.67 ounces, with an unknown wingspan. Adult males have orangish-yellow heads with buff to white underparts and sandy-gray upper parts. And females and immatures have duller undersides and less extensive yellow coloring on their heads. This species also has small, thin bills, rotund bodies, and medium-sized tails. The orange tanager is moderately social, often found in pairs or small groups of three or four. They sometimes forage in mixed-species flocks. They glean for insects in trees, and you can hear their rapid, high-pitched calls while perched on a branch or mid-flight. This species is primarily sedentary, but some populations in Brazil and Argentina will migrate short distances. Those living in the Andes Mountains will move to the lowlands during winter. The orange tanager is an omnivore that forages like a warbler. Their primary diet includes orthopterans, including grasshoppers, crickets, and locusts . But they also eat spiders, beetles , and flies. They supplement their diet with some fruit and seeds. They forage like New World warblers by hopping and gleaning insects from leaves and other foliage. Occasionally, they will snatch their prey mid-air. The IUCN lists the orang tanager (orange-headed tanager) as LC or “least concern.” Due to its extensive range and stable population size, they do not meet the thresholds for “threatened” status. They are known for inhabiting heavily degraded former forests and adapting well to forest clearing. Not much is known about the orange tanager’s predators, but they may include birds of prey like owls and falcons . Their nest predators are probably similar to other tanagers and include monkeys , snakes, and bigger carnivorous birds. Most tanagers make alarm sounds, chase, dive, and swoop at intruders. Orange tanagers may not mate for life, but they most likely keep one mate per breeding season. The nesting season is in December, and females lay two bluish-white eggs with brown markings. The shiny cowbird occasionally lays its eggs in tanager nests . We don’t know how long the incubation process is or when their young fledge the nest. Orange tanagers live an average of 3.7 years. The orange tanager global population is unknown, but their numbers appear stable. Because their numbers have not been quantified, we can’t be sure they are not facing declines. This species is relatively common within its range and is not experiencing extreme fluctuations or fragmentations.",
        "Diet": "Omnivore that eats grasshoppers, crickets, and locusts and especially likes orthopterans",
        "Behavior": "They usually live in group pair.",
        "Features": "Orange and yellow heads",
        "Fun_Fact": "They inhabit the lowlands of the Amazon rainforest",
        "score": 0.7704939
    },
    {
        "Name": "Yellowthroat",
        "Genus": "Geothlypis",
        "Diet": "Insectivore that eats grasshoppers, dragonflies, mayflies, beetles, spiders, ants and especially likes insects",
        "Behavior": "They can be characterized as mainly solitary.",
        "Features": "Black face masks",
        "Fun_Fact": "They forage near the ground, searching leaves for insects",
        "Text": "“Yellowthroats are curious birds attracted to repetitive noises.” The yellowthroat is a common songbird from the wood-warbler family. They have an extensive range across two continents and over 40 countries. These birds inhabit marshes and wetlands in open spaces, where they stay low to the ground to avoid predators and to search for food. Look for their yellow-olive color in the dense vegetation and listen for their loud, fast calls. Learn everything there is to know about them, including where they live, what they eat, and how they behave. The yellowthroat lives in over 40 countries across North and South America, including Canada, the United States, Mexico, the Bahamas, and Costa Rica . Many species are year-round residents in their Central American and South American homes. In contrast, others breed in the northern parts of North America (Canada and the United States) before heading south to Mexico, Central, and South America for the winter. They mostly live in marshes and other wetlands with low, dense greenery. Some live in prairies, pine forests, thickets, orchards, fields, river edges, and disturbed areas. To find these birds, look in bushes of open spaces and find their yellow-green coloring among the plants. Females select their nesting site on the ground in low plant life like grasses, reeds, cattails, and sedges. Once she chooses the perfect hiding area, it takes her four to five days to build. She weaves a loose cup of leaves and grasses and lines the inside with grass, bark fiber, and animal hair. The yellowthroat ( Geothlypis) are New World warblers endemic to the Americas. They are from the Parulidae family, which includes small, colorful passerine birds or “wood-warblers.” This genus contains 12 species: Yellowthroats are small, chunky songbirds with round heads, thick necks, and medium-sized tails. They measure between four and five inches and weigh 0.3 ounces, with a five to eight-inch wingspan. Adult males are a yellow-olive color with black face masks. Females lack face masks and feature an olive-brown color. This species spends most of its time staying low to the ground in dense vegetation, looking for food. Their calls are loud and fast, sounding similar to “witchity-witchity-witchity.” These birds are mostly loners but will forage in mixed flocks sometimes. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Yellowthroat species in more southern regions, like Mexico, Central, and South America, are typically year-round residents in their environments. Several species, like the common yellowthroat, are long-distance migrants. They spend their springs and summer (breeding season) in Southern Canada and much of the United States. They migrate to Mexico, Central America, and the Bahamas during winter, but some common yellowthroats in the Southern United States are year-round residents. They are mostly insectivores but may sometimes eat seeds. Most eat grasshoppers, dragonflies , mayflies, beetles, spiders, ants, termites, bees, wasps, caterpillars, moths, aphids, butterflies, and larvae. They mostly forage near the ground, picking insects off leaves, bark, flowers, and branches. The IUCN lists nine out of 12 species as LC or “least concern.” Because of their range and large populations at the present time, they do not qualify for “threatened” status. The Altamira yellowthroat is listed as NT or “near-threatened,” and the black-polled and Belding’s yellowthroats are V or “vulnerable.” Their greatest threats include wildfires, reed cutting for tourism, house construction, drainage for farming, and hurricanes. Adults can fall victim to predatory birds like hawks, eagles, owls, northern harriers , and merlins. They also experience nest predation, especially from snakes, raccoons , and turtles, as well as possums, mice, chipmunks, and skunks. Males will defend their area from other males, and females defend against other females. During mating, males flick their wings and tails, perform flight displays, sing, and follow the female around until she agrees to mate. The male is mostly faithful, but the female sometimes mates with others behind his back. They lay between two and six eggs, and females warm them for around 12 days. Males help by bringing feed and feeding the nestlings. They leave the nest around eight to twelve days after they hatch but rely on their parents for some time. Most species reach their sexual peak by year one and can live up to 11 years in the wild. The global population of all yellowthroat species is unknown; however, the common yellowthroat alone has over 77 million mature individuals in their range. Seven out of 12 species are experiencing a drop in numbers, three are stable, and two have growing populations. The black-polled and Belding’s yellowthroats have the most significant population drop, most likely from habitat loss.",
        "score": 0.76917267
    },
    {
        "Name": "Beetle",
        "Diet": "Omnivore that enjoys insects and especially likes dust, dung",
        "Fun_Fact": "There are more than 350,000 different species",
        "Text": "“The beetle form the largest order of animals on Earth” According to biologists, there are at least 400,000 species or types of beetle, all belonging to the Coleoptera order, the Endopterygota suborder, and a great variety of lower classifications. These insects make up one-quarter of all animal lifeforms, and most insects . They are found all over the world save in the oceans, Antarctica and the Arctic even though there are species built to withstand intense cold and others are at least semi-aquatic. Some are terrible pests, and some are beneficial. Though many are black or brown, others sport beautiful colors and patterns, with metallic or iridescent carapaces. They range from the smallest, Scydosella musawasensis to the largest, the Hercules beetle , which can grow to over 7 inches long. Coleoptera comes from the Greek words for “sheath” and “wing” because of the insect’s tough forewings. The lower classifications for Coleoptera are not only very numerous but complicated, with families and superfamilies and suborders based on what the animal eats and even tiny structures on its head, its mouthparts, or its hind legs. Here are some of the more populous families, superfamilies, suborders, infraorders, and tribes: Adephaga, whose lower classifications include Hydradephaga and Geadephaga, with 5560 and 35,000 species, respectively, and include the diving and ground beetles. The Polyphaga order has the most species. Families in Polyphaga include Staphylinidae, with 48,000 species, and Scarabaeoidea, with 35,000 species, including those that encompass scarabs. Other families include the Elateroidea, with 23,000 species, and the Tenebrionoidea, with 35,000 species. The superfamily Chrysomeloidea contains the Chrysomelidae, Cerambycidae, and Curculionoidea families. These families have 35,000, 25,000, and 97,000 species, respectively, and include the weevils. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The scientific name for some popular beetles are: People can find beetles in many different habitats, from parks to rainforests and tundra. There are almost 400 thousand species of beetles, making them the most varied animal species on earth. This abundance has perplexed scientists for a long time. Charles Darwin and Alfred Russel Wallace were two of the many to use beetles to develop theories about evolution. However, understanding the evolution and origins of beetles is difficult. A research team used a 68-gene dataset and 57 fossils to construct an evolutionary tree of beetles. The results indicate that various beetle groups expanded as new ecological opportunities became available. It appears that the success of beetles is due to their remarkable adaptability, as there was not one single moment in which their evolution began. A new timeline of beetle development will provide a better understanding of how this species has become so successful. Recent research and analysis have identified 193 existing and extinct beetle families, with the oldest fossils being 295 million years old – before dinosaurs even roamed the earth. In order to gain insight into the huge variety of beetles in the world today, researchers have studied their genetics, physical features, and rare fossils to trace back their evolutionary history. It has been concluded that beetles first appeared during the Carboniferous period and later diversified alongside dinosaurs during the Triassic and Jurassic periods. Adults always have wings, and their front wings are hard and are not used for flying. Instead, they are used to cover the hind wings, which are used for flying. When they close, they form a straight line down the back. The forewings extend all the way to the back of the abdomen. If they don’t extend to the back of the abdomen, the insect is considered a true bug. The body can be long, cylindrical, round, half-round, or flat with chewing mouthparts. They can come in shades of black or brown, but many are brilliantly colored. Their antennae almost always have 11 segments but can be short or longer than the body. They have large and well-developed compound eyes, and their legs have evolved for the insect to run, jump, swim, grasp, and dig. The larvae live in the ground or bore into dead or live wood, roots, or seeds. Some eat other invertebrates, carrion, rotting vegetation, or fungi and pupate in the soil, in wood, or under decaying bark. Most don’t spin a cocoon. Some larvae are parasitic and live on or in a live host. Most beetles don’t live more than a year, but some can take more than a year to pupate. Adults are attracted to lights at night and can be easily found on plants during the day. Beetles are actually the largest order of insects. In fact, around 400,000 different species make up about 40% of all insect species. A study in 2015 states that four independent estimates of the number of beetle species give it around 1.5 million, with a narrow range spanning all four estimates. There are an estimated 2.1 million different types of beetles. Which, in layman’s terms, means there are more beetles than any other species of insect. Beetles are found in almost all habitats, including freshwater and coastal areas. Anywhere where there is vegetation, you will find beetles living in bark, flowers, and leaves. The heaviest of beetles in the insect stage is the larva of the goliath beetle, which can attain a mass of just over 4 oz with a length of about 5 inches long. These insects can be found just about anywhere. Even a cursory glance at a tree or a shrub or plant will disclose some kind of beetle, which may be actively eating the plant or simply resting on it. They are found under rocks, under old bark, in rotting logs, and in dung heaps. They are found in and around food, clothing, rugs, carpets, and upholstery. If a porch light is turned on, they will come flying to it. Aquatic beetles are mostly found in freshwater, though some of them do live in shallow waters near the shore. The adults often carry an air bubble or have a modification to their exoskeleton to allow them to breathe underwater. The materials these insects eat nearly defy listing. Some only eat plant materials. Others are scavengers, and some are omnivores. Some restrict themselves to only one type of plant, while others are hunters that prey on other insects , spiders, snails , and earthworms. Others eat dung and carrion, while others eat beetles that eat dung and carrion. Many beetles rely on the presence of fungi in their gut to help them digest their food. Weevils eat plant parts, flour, and grains. There are many ways of getting rid of beetle pests. They can simply be plucked from host plants and squashed or dropped into soapy water. They can be dusted with insecticidal powder, even though this will cause some collateral damage to insects such as butterflies and ladybugs . Their grubs can be exposed to nematodes or parasitic wasps. Sometimes controlling beetles is drastic. Lumber may need to be quarantined and treated with insecticide if it’s feared it is harboring pests. Sometimes forests full of trees need to be cut down and burnt to stop an invasion of a wood-boring beetle.",
        "score": 0.7664339
    },
    {
        "Name": "Blue Tanager Blue Grey Tanager",
        "Genus": "Thraupis",
        "Diet": "Omnivore that eats soft fruit, nectar, and insects and enjoys wild",
        "Behavior": "They can be characterized as social.",
        "Features": "Colored shoulder patches",
        "Fun_Fact": "They travel and forage in pairs or groups",
        "Text": "“They have a squeaky, twittering song.” The blue tanager (blue-grey tanager) is a lovely little noisy bird native to Central and South America. They inhabit a wide range of tropical and subtropical environments, choosing to live in open areas close to humans, like parks, gardens, and forest edges. You will often find them munching on soft fruit on the tops of trees, singing their squeaky tune. Learn more about this blue songbird, including where they live, what they eat, and how they behave. The blue tanager lives in at least 18 countries in Central and South America, including Mexico , Brazil, Costa Rica, Colombia, and Venezuela. This bird is one of the most common in South America’s tropical and subtropical regions, except for the southern tip. They prefer moderately open areas like forest edges, woodlands, agricultural areas, parks , and gardens. You may find it in recent clearings, but you won’t see it deep inside forests. It prefers to stay on the outside near roads and rivers . They frequently inhabit areas in cities and towns, perching on the tops or middle sections of trees. The male and female place their nest in a high tree fork or building crevice surrounded by dense foliage, which is used as the nest base. They build a thick, deep bowl using grass, roots, moss, leaves, and other fine plant material. The blue tanager ( Thraupis episcopus) is from the Thraupidae family and comprises 12% of neotropical bird species. Their genus, Thraupis , encompasses the tanager family from Mexico to Argentina and Brazil. The specific name (Episcopus ) is Latin for “bishop.” The blue tanager has 14 recognized subspecies, differing based on their iridescent shoulder patch color. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The blue tanager is a medium-sized South American songbird, measuring 6.3 to 7.1 inches long and weighing 1.1 to 1.4 ounces. Their wingspan size is unknown, but they feature short, thick bills, wide necks, and long tails. Adults have light blue heads, chests, and underparts, with darker bluish-grey backs, wings, and tails. Blue tanagers also have shoulder patches, which vary in color depending on the subspecies. Most are green, blue, gray, or purple. These birds are relatively social, choosing to travel in pairs or small flocks. They are restless and noisy, and their songs sound like squeaky twittering. This species thrives around human habitations in urban or suburban areas . Blue tanagers are omnivores that mainly eat fruit. They eat soft fruit (tangerines and papayas), nectar, and insects, like bees , worms, and crickets. They will move into abandoned pastures to find wild fruits, and they may join mixed-species flocks to find food. You can find them munching on their favorite food on the tops or mid-sections of trees. The IUCN lists the blue tanager (blue-grey tanager) as LC or “least concern.” Due to their extensive range and enormous, stable population, this species does not meet the thresholds for “threatened” status. Parasitic infections are currently the only threats to the blue tanager. We don’t know their exact predators, but most tanagers are preyed on by carnivorous birds like eagles and hawks. Their nests are also vulnerable to snakes, squirrels , chipmunks, and bigger birds. Blue tanagers may dive and swoop at predators while giving alarm calls. Most tanagers are monogamous during the breeding season, typically between February and July. The female lays one to three white to gray-green eggs with dark markings and incubates them by herself for 14 days. Nestlings fledge the nest around 17 days old. Blue tanager nests are sometimes parasitized by cowbirds, meaning they place their eggs in a tanager nest. Most tanager species are sexually mature and molt for the first time between one and two years old. They can live up to 12 years in captivity. But it’s unknown how long they survive in the wild. The blue tanager global population is estimated at 50 million mature individuals. This species is experiencing a significant increase due to its ability to adapt well to human habitations. It also doesn’t have any extreme fluctuations or fragmentations in its population.",
        "score": 0.7660029
    },
    {
        "Name": "Blue Gray Gnatcatcher",
        "Genus": "Polioptila",
        "Diet": "Insectivore that eats insects",
        "Features": "Bluish cap of feathers",
        "Fun_Fact": "Joy and happiness are the spiritual meaning of this bird.",
        "Text": "“A Blue-gray gnatcatcher can snatch insects out of mid-air” One of the Blue-gray gnatcatcher’s most notable features is the cap of deep blue feathers on its head. Another notable feature is a call that sounds like spee, spee! Blue-gray gnatcatchers live in open woods, scrubs, and thickets. Flies, small wasps, beetles , and spiders are all in its diet. The Blue-gray gnatcatcher is native to North America and lives in a temperate climate. These birds are year-round residents in many states along the southern coast of the United States . This range includes the southern part of California traveling east to Florida and up into southern parts of Georgia and South Carolina . Some are permanent residents of Mexico and Cuba as well. There are some Blue-gray gnatcatchers that make their home in northern parts of the United States. But birds living in northern states such as Michigan and Wisconsin migrate south for the winter. Sometimes they travel as far as Mexico. These birds start migrating south in September. The breeding season for this bird runs from March or April into late July. This is a great time to see these birds at work building nests and feeding their chicks. So, if you see a couple of Blue-gray gnatcatchers building a nest remember that joy and happiness are two words in the spiritual meaning of this feathered creature. In the springtime, the male Blue-gray gnatcatcher sings its song to attract females to the area. Once he finds a mate, nest construction begins. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The nest design is a cup shape made with mud , grass, and twigs. Animal hair and grass are put on the inside of the nest to serve as a soft layer for the eggs. Both male and female Blue-gray gnatcatchers work together to apply a layer of spider webs and lichen to the exterior of the nest. This helps hide it from predators. These birds usually build their nest at a height of 20 to 40 feet in a tree. Polioptila caerulea is the scientific name of the Blue-gray gnatcatcher. The Greek word Polioptila means gray plumage and the word caerulea means blue. It’s in the Aves class and the Polioptilidae family. Well, the name of the Blue-gray gnatcatcher says a lot about the appearance and behavior of this bird. Yes, this bird has bluish-gray feathers on its back and wings along with a cap of deeper blue feathers on its head. Its breast is white. Blue-gray gnatcatchers have a long, thin, pointed beak. Its beak design allows it to pluck an insect out of the air. Capturing insects in mid-air is called hawking. Its long tail feathers contain both black and white feathers. This bird flicks its tail feathers side to side to frighten insects out of bushes. Male Blue-gray gnatcatchers are larger than females. Plus, a male has a black stripe extending from the base of its beak, over each eye, and across each side of its head. The length of a Blue-gray gnatcatcher is four to five inches, and its height is three to four inches. It’s very light, weighing just .21 ounces. The wingspan of this bird is 6.3 inches. The dark color of the Blue-gray gnatcatcher gives it an advantage when it’s trying to blend into its wooded habitat. The thin, pointed beak of this bird helps it to get a firm hold on its prey. The Blue-gray gnatcatcher covers the outside of its nest with spider webs and lichen. Once again, this is an attempt to hide the nest from snakes, hawks, and other predators able to get into the treetops to kill an adult bird or steal an egg. This bird uses its call to warn other Blue-gray gnatcatchers of predators. Blue-gray gnatcatchers living in the northern parts of the United States migrate south to warmer weather for the winter season. In late September, birds living in Michigan, Wisconsin, southern Montana, and other northern states start on a southward path. Some of these birds stay in southern states such as Florida, Georgia, or Texas for the winter. Other Blue-gray gnatcatchers travel further south into Mexico. In the spring, these migratory birds fly north again for the breeding season starting in March or April. Does a Blue-gray gnatcatcher look like a carnivore to you? It is! In fact, some biologists call this bird an insectivore because of its diet of insects. This bird eats flies , leafhoppers, small wasps , spiders, and caterpillars . Along with capturing insects in mid-air, they also hop along the branches of a tree looking for bugs on leaves. One interesting behavior of this bird is it will pick up a leaf-covered twig and shake it. This is an effort to scare the insects out from beneath the leaves. This tiny bird has lots of predators including snakes , hawks , kestrels , and cats . All of these animals are able to chase after Blue-gray gnatcatchers even if they try to escape into the trees. Loss of habitat is an issue for Blue-gray gnatcatchers, but it’s not considered of major concern. The IUCN Red List of Threatened Species reports this bird as Least Concern with a population that is rising. Male Blue-gray gnatcatchers attract females with their song. A male and female Blue-gray gnatcatcher pair up during the breeding season. However, biologists aren’t sure whether they stay together for life. These birds begin breeding in March or April. A female has four or five eggs that hatch in just 13 days. Both the male and the female take turns going out to find food for their babies, or chicks. The chicks grow quickly and are able to leave the nest at about 14 or 15 days old. Typically, these birds live up to four years of age. But there is one Blue-gray gnatcatcher on record as having lived four years, two months! Despite not having a specific population listed on their IUCN Red List of Threatened Species page, this bird is thought to be of Least Concern. Furthermore, its numbers are estimated to be on the rise.",
        "score": 0.76589346
    },
    {
        "Name": "Mealybug",
        "Diet": "Herbivore with no preference",
        "Behavior": "They usually live in colonies.",
        "Features": "Waxy, mealy appearance",
        "Fun_Fact": "They have a symbiotic relationship with ants.",
        "Text": "Mealybugs are a type of unarmored scale insect found in warm, moist habitats around the world. Many species are pests because they cause damage to many plants, both indoors and outdoors. They also transmit plant diseases, inject plant toxins, and cause deformity, leaf drop, and sooty mold as they feed off plant sap. Mealybugs feed on certain plants and the most common are citrus mealybugs. Other species feed on mango, papaya, grapes, pineapple, cassava, cacti, sugarcane, coffee trees, ferns, gardenias, mulberry, sunflower, and orchids. The geographic range of this mealybug pest was previously documented across southern Europe, the Middle East, and certain regions of northern Africa , while its presence in North America, specifically Pl. ficus, was initially observed in the early 1990s and subsequently in Mexico. Originally native to North America, Phenacoccus solenopsis, commonly known as the cotton mealybug or Solenopsis mealybug, is a species of mealybug belonging to the family Pseudococcidae . It has expanded its presence to various regions globally and emerged as a significant pest affecting cotton crops. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Further, female mealybugs in their early stages experience three instars or developmental stages and remain mobile throughout their lives, while immature males (nymphs) settle down and construct a white, waxy cocoon. There are 269 genera of mealybugs. All of them are in the suborder Sternorrhyncha and the superfamily Coccoidea. In the United States , there are approximately 275 species. The most common mealybug species fall into the genera Pseudococcus and Planococcu s. The citrus mealybug’s scientific name is Planococcus citri . Mealybugs are insects of the order Hemiptera, and all members are hemimetabolous or undergo incomplete metamorphosis. Both sexes go from the egg to the nymph phase. Mealybugs are tiny white bugs that look like fuzzy white stuff on plant stems and leaves. They look similar to other scale insects but do not have a hard shell to cover their soft bodies. They are also flat and waxy, with segmented bodies and an oval shape. Adult male mealybugs have wings and two long tail filaments, look like gnats or small flies, and are confused for fungus gnats. Mealybugs measure about 2mm long. In colonies, they look like white fuzzy clumps. When they first hatch from eggs, they are yellow in color and molt several times. Mealybugs can be found on a variety of host plants indoors, outdoors, and in greenhouses. They make their habitat in warm, moist climates around the world and are most active outdoors during warm, dry weather. Male mealybugs are rarely seen, while adult females look like cotton balls and are especially visible when laying waxy-covered eggs. Root mealybugs make their habitat in the soil, so these are not often visible at first. Mealybugs create colonies in somewhat sheltered areas such as the base of stems, between the stem and touching leaves, branch crotches, plant crowns, or between two touching fruits. Mealybug eggs attach to twigs, leaves, or bark. The best way to tell if your plants have an infestation of the scale insect is if there is a cottony, wax-like residue on the leaves of the plants or on the soil, or if there is a sooty black mold from the honeydew mealybugs excrete. Other ways to tell are if there are clumps of waxy-covered eggs, ants crawling up the plants, the plants have lost color, wilted, or have stunted growth, there is leaf drop or yellowing, or the soil has a bluish tint. Mealybugs eat all parts of the plant, including the roots. Root mealybugs, who live underground, are in the genus Rhizoecus . Rhizoecus includes the ground mealybug, hibiscus mealybug, and Pritchard’s mealybug. Depending on the species, mealybugs usually have a type of host plant they are common pests of, such as the citrus mealybug or mango mealybug, but actually, eat a range of plants. Pritchard’s mealybug eats the roots of African violets and other plants. Certain plants are toxic to mealybugs and other pests. However, they are also toxic to animals and children. They are: There are some different treatments for getting rid of mealybugs. The least invasive or risky treatment is to use a home remedy or biocontrol. But first, you must isolate the infected plants to prevent the spreading of the scale insect to other plants. You can then use a treatment listed below or in combination: To prevent mealybugs from returning, you’ll want to do a few things: If all else fails after repeated attempts, it’s time to resort to pesticides. Cyfluthrin, bifenthrin, permethrin, or diazinon are effective, as are systemic pesticides such as imidacloprid, and compounds such as Flagship (thiamethoxam) and Safari (dinotefuran). Your very last resort is to discard severely infected plants.",
        "score": 0.76396155
    },
    {
        "Name": "Ladybug",
        "Diet": "Carnivore that eats insects such as aphids, thrips, caterpillars, beetle larvae, scale insects, spider mites, mealybugs, other ladybirds, greenfly, small insects",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Its brightly colored and patterned elytra",
        "Fun_Fact": "There are more than 5,000 species worldwide!",
        "Text": "Ladybird beetles, otherwise known as ladybugs, have been to outer space and had no problem catching prey in Zero-G. The typical description of the ladybug discusses the red shell and black spots, but there are many different patterns. In fact, the number of spots can even differentiate between the many species around today. They have a rather resilient body, ensuring that they can live in many different environments in North America and Europe . Ladybird beetles and ladybugs are the same insects. The difference is it’s called a ladybug in North America and a ladybird in the United Kingdom. Entomologists also consider ladybird being the more correct name for the insect, as it is not, in fact, a true bug but a beetle. The scientific name for the ladybug is Coccinellidae , and their classification places them in the invertebrate category. Coccinellidae comes from the Latin word “ coccineus ,” which means scarlet – a clear tribute to the color of their exoskeleton. It is sometimes called a ladybird, which comes from a British expression for the insect. Many people took to calling the insect “Our Lady’s bird.” The beetle gets its common name because it was associated with the Virgin Mary. Legend has it that a group of farmers was so plagued by aphids eating their crops that they prayed to the Virgin for help. When help arrived in the form of coccinellids, the beetles were known as “Our Lady’s beetles,” from then on. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Through genetic sampling, it is thought that the ladybug dates back to the Cretaceous period. While the ladybug belongs to a group of mostly plant-eating beetles, this insect evolved its characteristics based on defensive evolutions of their prey and also adaptations of plant life. Fossils of ladybugs have been found that date back to the Eocene period, which dates back 50 million years. Though most people are familiar with the typical red body and black spots, the ladybug is actually a category of over 5,000 different species. The species come in many different colors and markings, including combinations of red, black, brown, yellow, white, and neutral shades. They are primarily divided into the following categories: The elytra of many types of ladybirds are, indeed, scarlet, and the Virgin was sometimes depicted wearing a scarlet robe. The seven black dots on the insect’s elytra were supposed to represent her seven joys and seven sorrows, even though there are ladybird species that have more or less than seven spots. More ladybird species include: 1. Coleomegilla maculata 2. Coccinella novemnotata 3. Coccinella transversoguttata 4. Hippodamia convergens 5. Calvia quatuordecimguttata 6. Rhopalosiphum cerasifoliae 7. Rhopalosiphum maidis 8. Rodolia cardinalis 9. Coccinella californica 10. Psyllobora vigintiduopunctata When you imagine the appearance of a ladybug, colors like red and black typically come to mind. In fact, this traditional idea makes the ladybug (or ladybird) one of the most easily recognizable insects in the world. However, this description doesn’t come close to covering the 5,000 species that are out there today. While every ladybug has an oval shell, six legs, and the cutest cheeks of any insect, they also are found in many shapes, sizes, and colors. Most of these insects are just a centimeter long, but they can be as small as 1 mm. Along with the traditional red shell and black dots, other species include: Along their legs, their joints are specially designed to release a toxic fluid that can protect them from predators. Sometimes, they’ll even bite if they are threatened. While it is easy to find one or two ladybugs, they typically are found in a group, which is called a loveliness. Part of the reason that these insects swarm together is to reproduce quickly and deal with limited food supplies during winter. Approximately half of this population is made of females, and they choose a mate while they are in their large group. Ladybugs can be found around the world, but they tend to live in Europe and North America . They were not introduced to North America until the middle of the 1990s, used to help with the aphid problems that were plaguing the entire region at the time. Since then, ladybugs seem to have found a place that they are happy to stay in. Of the 5,000+ species, the United States is specifically home to over 500 variations. The ladybug’s flexibility in different habitats allows it to thrive. Just as easily as they will live in grasslands and forests, they’ll also collect in cities and suburbs. Some swarms can even be found along rivers. When they are ready to lay eggs, they will simply leave their larvae on the underside of a leaf. As recently as 2018, scientists grew concerned over the dwindling population of certain insect species, considering the major impact that they have on the world’s ecosystems. Some of the reasons for the decline can be credited to the use of insecticides, pollution, and climate change. However, the resilience of many different habitats is part of the reason that there are still millions of these beetles found worldwide. Ladybugs are omnivores, consuming both plants and other animals as their main source of nutrients. Primarily, they prefer to consume leaves, fungi, and other insects. Sometimes, they’ll even dine on mushrooms and mildew, but their primary diet is made of aphids. In fact, the ladybird consumes up to 50 aphids a day . Birds consume ladybugs, but that’s hardly their only predator. They also are eaten as a part of the diet of frogs, wasps , spiders, and dragonflies. While they have many defenses against other animals, they are still rather small animals that cannot fight back as strongly as others. While the ladybird will consume some types of plants, their diet primarily consists of other insects (especially aphids). They’ll go after scales, mealy bugs, mites, leafhoppers, and other insects that are smaller than them. They will also eat the larvae of other insects. Though the ladybug is mostly not harmful, having any beetles or insects in a home can be unsettling. They are safe to keep in a garden, but large infestations can damage a farm. If there is just a small group of ladybugs, sweeping or vacuuming them up is relatively safe. However, a massive infestation may need to be sprayed with soapy water. It is also safe to leave a bowl of soapy water where they collect. While some people swear by the use of Diatomaceous Earth to clear out a colony, there are also many homemade traps that can work. Small LED lights can be set up in an area to attract the beetles into a funnel or box before they are moved somewhere safer. Anyone with a green thumb and a disdain for ladybirds can plant mums around their home or porch. Apparently, as resilient as the beetles are, they absolutely hate the smell of these flowers, and they’ll likely choose a home without them instead. Natural repellants like lavender oil and citronella candles can also keep ladybugs and other insects away.",
        "score": 0.7626283
    },
    {
        "Name": "Christmas Beetle",
        "Genus": "Anoplognathus",
        "Diet": "Herbivore with no preference",
        "Behavior": "Their aggression level is low.",
        "Features": "Shimmering metallic body",
        "Fun_Fact": "Christmas beetles got their common name because they’re most abundant around Christmas time.",
        "Text": "Christmas beetles got their common name because they’re most abundant around Christmastime. The common name ‘Christmas beetle’ applies to bugs in the genus Anoplognathus. Native to Australia and South Africa , there are 35 species of beetles in this genus. The largest of them is the Anoplognathus viriditarsus , which is commonly found in Sydney. They spend most of the year underground and emerge around Christmastime each year. Adults are pests that feed on the leaves of eucalyptus trees. The common name Christmas beetle applies to any of the 35 species of beetles in the genus Anoplognathus. They are called Christmas beetles because they tend to be more abundant close to Christmastime every year. They’re native to Australia and South Africa . About 8 out of the 35 species of this beetle are found in Sydney, Australia. They are pests of the Eucalyptus plant , which they feed on voraciously as adults. The most popular member of this group is the Anoplognathus viriditarsus, and it is also the largest. While the name is mostly applied to this genus of beetle, people often use it to loosely refer to other metallic-colored beetles like the stag beetle (genus Lamprima). Christmas beetles belong to a family of insects known as scarabaeidae or scarab beetles. This is a large family of insects consisting of over 30,000 species of beetles found all over the world. Scarab beetles have stout bodies and often have bright metallic colors. Christmas beetles are relatively easy to spot and identify. Their shimmering metallic body is the main feature that gives them away. There are 35 species of this beetle, and they tend to have different appearances. The majority of them are golden brown or green. However, as you travel further North in Australia, you’re likely to see some interesting colors, including some violet or opal-colored species. The unique coloring of these beetles comes from a special layer of reflectors in their hardened shells. Christmas beetles are large. Most species grow to about 20 to 30 mm (0.78-1.6inches) long. The most common species in this genus, the Anoplognathus pallidicollis, is about 20 mm long. Like all scarab beetles, Christmas beetles have clubbed antennae. They also have spiky legs, which they use to hold on to the plants they feed on. The larvae of these beetles are C-shaped and white in color. They’re quite similar to the larvae of stag beetles and other scarab beetles. Like many of their closest relatives, Christmas beetles are clumsy and noisy fliers. Christmas beetles are well known in South Africa and Australia. In places where they’re found, they mostly live in forests and woodlands, but they become more common in both rural and urban areas close to the Christmas period. They are found all over Australia except the dry desert areas. Females lay eggs underground. The C-shaped larvae will remain underground for most of the year. Then, they emerge as adults just before Christmas. The number of adults that will emerge often depends on the weather. Rainy weather with thunderstorms often encourages more beetles to emerge. However, if the weather is dry, you may not see any beetles at all. Christmas beetles feed mainly on the leaves of eucalyptus plants. They may attack trees in large numbers; although they prefer mature leaves, they often defoliate trees completely, eating all the leaves, including the young, immature ones. They’re often in a feeding frenzy until it’s time to lay eggs for the next season. They lay eggs in the ground, and the larvae feed on grass roots and decaying plant matter underground. They don’t have a lot of natural enemies. However, some animals such as possums , currawongs, and magpies can eat this bug. Some predatory wasps feed on Christmas beetles too. Birds can also pick the larvae and keep their population under control. Christmas beetles are hardly problematic, especially when they’re in low numbers. They provide a wide range of benefits to the ecosystem, so there’s often no need to get rid of them. In addition, some natural predators help to keep their numbers under control. You can also keep their population down through proper maintenance of your lawn. Getting rid of common hiding spots such as plant debris and leaf litter can make your space less attractive to these beetles. Watering your lawn, aerating your flower birds , and compressing your lawn makes it difficult for females to lay eggs and keeps them from surviving. You can also protect eucalyptus trees directly by placing mesh-type netting around the trees to protect them. There are no chemical insecticides to control this beetle. Most gardeners often rely on biological measures to keep their populations down. Parasitic wasps, some rodents, birds, and bats can feed on adult beetles. They only live for a few weeks after hatching, so infestations typically don’t last long.",
        "score": 0.7610329
    },
    {
        "Name": "Northern Screamer",
        "Genus": "Chauna",
        "Diet": "Herbivore that eats this species eats aquatic vegetation like roots, stems, grasses, and seeds and especially likes plant matter",
        "Behavior": "They usually live in group pair.",
        "Features": "Red eyering",
        "Fun_Fact": "They are closely related to magpie geese",
        "Text": "The northern screamer is attracted to seasonally flooded plains. The northern screamer, also known as the black-necked screamer, is a water bird endemic to small South American regions. Its limited range puts it at risk for habitat loss and pollution, and spotting one of these birds is a rare treat. They are sturdy birds with distinctive coloring who form pair bonds and possibly mate for life. Find out everything there is to know about this uncommon screamer, including where you can find them and how to identify them. The northern screamer has a relatively small range, only inhabiting Northern Colombia and Northwestern Venezuela. You can find them in wetlands in lowland tropical forests, such as marshes, lagoons, swamps , well-vegetated lakes , and river banks. These birds are also attracted to flooded plains during the rainy season. To find them, listen for their loud, unharmonious calls and look to the tops of trees or near the water where they graze. Both parents assist in building their nest, which is typically floating vegetation anchored among marsh vegetation in shallow water. They may also place it on the dry ground next to the water. Their pair constructs it by finding debris and vegetation around the nesting site, such as sticks, reeds, and weeds. When completed, the nest resembles a loosely constructed circular shape. The northern screamer ( Chauna Chavarria ) is in the Anseriformes order, which encompasses 180 species of waterfowl. And its family, Anhimidae , represents the screamers, three South American bird species. The Chauna genus comprises the northern and southern screamers in South America’s wetlands. The northern screamer is a large, solid bird closely related to magpie geese. This stout bird grows between 30 and 36 inches, but we don’t know its weight or wingspan. Their bodies are grayish-black with white streaks, and their crown and neck are black with a broad white stripe across their chin. Its legs and feet are reddish-pink, and it has a distinctive red eye ring. They have small, hooked bills, strong legs, and partially webbed feet. They also have two sharp wing spurs, which they use to deter predators (although their predators are unknown). Females are smaller than males but feature similar plumage. While they don’t technically scream, northern screamers make low, throaty sounds that resemble barking. These birds are diurnal and like to spend their days perching on tree tops and loudly proclaiming their territory. This species forms pair bonds and may mate for life. Mates make pair calls to establish their bond and will perform other courtship displays like walking side by side, making low, course sounds, and preening. Pairs stay together during the breeding season, but after, they may form small groups. This species is mainly terrestrial but are good fliers and can quickly get to the tree tops. The northern screamer eats a vegetarian diet, feeding almost exclusively on plant matter. This species eats aquatic vegetation like roots, stems, grasses, and seeds. They will occasionally eat insects , but they are not a regular part of their diet. The northern screamer looks for food by grazing or digging with its bill. According to the IUCN, the northern screamer is a “near threatened” species. In fact, it almost meets the criterion for “threatened” status. It has a relatively small population that continues to decline at a steady pace. They have experienced a loss of habitat due to wetland draining, pipeline and road construction, urbanization, and mangrove cutting. This species is also vulnerable to hunting, egg collecting, domestic and industrial pollution, and sewage. The northern screamer can breed in its environment year-round, but the peak breeding season occurs in October and November. Breeding pairs are solitary and build their nest together. Females lay three to five yellowish-white eggs, and both parents take turns incubating for 42 to 44 days. Their young are born in an advanced state and leave the nest immediately after hatching, where they follow after their parents. They stay predominately in the water until they can fly and fledge within eight to ten weeks after hatching. This species is fully independent at 12 to 14 weeks. These birds have long lifespans and can live between 15 and 35 years. The IUCN estimates the northern screamer population to be between 1,500 and 7,000 mature individuals. This species doesn’t experience any extreme fluctuations or fragmentations in its numbers, but its population is decreasing. They are going through a slow and steady decline due to habitat loss, egg collecting, and hunting.",
        "score": 0.760574
    },
    {
        "Name": "Vermilion Flycatcher",
        "Genus": "Pyrocephalus",
        "Diet": "Insectivore that eats flies, butterflies, grasshoppers, beetles, crickets",
        "Behavior": "They can be characterized as mainly solitary.",
        "Fun_Fact": "They have a fast song that lasts up to 10 syllables at max.",
        "Text": "The Vermilion Flycatcher is a type of perching bird that is found in South America and some parts of North America . The males differ from the females in terms of color. The males are more vibrant in color, making the females harder to identify. They have a unique singing voice that is variable but quite relevant in strengthening their population. If you are on the watch for the Vermilion Flycatcher, you can look for them during any season. They are usually residing in woodland areas, scrublands, farmlands, deserts , parks, savannas, shrubby areas, and even near water. You can spot them in both Southern and Northern America and at elevations of 10,000 ft above sea level. But the best place to look for them is in insect-rich areas during the months of December to May. This is also their breeding season. You will need to have a good eye because they will be perched on top of trees or near lakes , showcasing their majestic beauty. They are easily identifiable with their vibrant red and orange coloration while the females appear gray. Moreover, their sweet songs can be heard from far which you can follow to spot them with ease. All in all, any open area is a good resting site for them, even if it is on street lights along the road. So, you won’t find much trouble spotting them. However, during the breeding season, they are found to prefer specific trees and plants . They include cottonwood, mesquite tree canopies, and Goodding’s willow. A suitable time to look for them is during the winters when they are found in flocks. They have quite a unique structure for the nest. The cup is made up of twigs, grass, empty cocoons, and a spider web to wrap it up as a whole. In addition, you will find it hidden under lichen as a way to camouflage it from predators. It is also lined up with feathers, hair, and other plant components. The nest of a Vermilion Flycatcher is usually perched up on the trees, around 20 inches up. Rarely, you can find a Vermilion Flycatcher’s nest that is perched higher than 50 inches from the ground but it has happened. There may be 2-4 eggs and they are white in color with a few brown/olive/lavender spots. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Vermilion Flycatcher was first called the Pyrocephalus obscurus in 1839 and then in 1840, it was also identified as Pyrocephalus rubinus. Today, both names which are Greek in origin, are considered for their description although, Pyrocephalus rubinus is used for another bird known as Scarlet Flycatcher. The Vermilion Flycatcher belongs to the Class Aves and the Tyrannidae family. Up till 2013, people thought that it had nearly 13 species but this claim was disregarded by a 2016 study. It further claimed that the Vermilion Flycatcher only has nine subspecies, which are as follows; The Vermilion Flycatcher is a small and round bird with a straight bill. It has a short head but a barrel-chested and stout body. Its tail, however, is long and slender. It measures up to 5.1 to 5.5 inches in length and 3.1 inches in height. Their weight is around 0.39 to 0.49 ounces while their wingspan spreads to a brilliant 9.4 to 9.8 inches. Both the genders are distinctly different in colors. Males have very vibrant reddish orange undertones below a brown mask of feathers covering the body. As for the females, they are grey in color with white undertones and an astounding brush of amber shades running below. Males are distinguishedly different but the females are often confused with the Say’s phoebe. Migration is vital for the Vermilion Flycatcher as it has helped in expanding their population. However, there is one interesting fact about their migration pattern based on geography. The Southern birds are the ones that migrate to the North while the Northern birds are quite reluctant about migrating making them non-migratory for good. The migration season starts in early March and helps them move to the warmer regions. The Vermilion Flycatcher is usually found in solitude. During the winter season, however, some are gathered around in flocks but not more than five altogether. Their diet usually includes insects . Some of them are honeybees, butterflies , grasshoppers , beetles , and crickets . They are strictly insectivores in nature. They eat a variety of insects, ranging from the big ones like butterflies and grasshoppers to the small ones like crickets and beetles. The indigestible parts of their diet come out of their mouths in the form of pellets. They are perched in high places to get a better bird’s eye view of their surroundings. Once they spot an insect, they swoop in and bring the insect back to their perching site. They might even come down to the ground if there is sweet prey lurking around them. After bringing back their prey, they kill them before they eat them up. The Vermilion Flycatcher does not face any current threats to its population size. It belongs to the Least Concern category in its conservation status. Its population is currently increasing and is because of its migration pattern. The most common predator, especially in Galapagos, are rats . They do not just eat their eggs but also their young. Urbanization is a big threat to the population of the Vermilion Flycatcher. Because of deforestation, they do not have many homes where they can reside. Similarly, the overuse of pesticides has caused the insects to die which opens up a survival case for the Vermilion Flycatcher. The mating is due to a little performance by the male. They go up high in the sky to flash their dance “routines” along with a little singing that eventually enables mating. The males form a puffy chest and engage in a fluttery fight. The Vermilion Flycatcher does not stay with one partner in their lives. The males engage with other females through their mating rituals while the females fly away and lay eggs in other Vermilion Flycatchers’ nests. But this is true for only a small amount of the total population since there is only 11% of the babies have come out this way. The female begins building the nest and keeps on tweaking it to her liking. She lays 2 to 4 eggs which are white in color with dark spots on them. After an incubation period of 2 weeks, the hatchlings emerge known as chicks. They are underdeveloped babies which are fed by both parents. But because of brood parasitism, the young are often left to be tended with care by other birds. After 15 days, the chicks are ready to leave the nest and after two years, they can mate. As for the molting, it begins after migration season, in July, and may last up to September. The broken feathers are replaced by this process which may take up to 79 days. But many birds complete it within 62 days as well. The reason for slow molting is that the quick process may create underdeveloped feathers, causing trouble during flight. The population size of the Vermilion Flycatcher is around 5,000,000 to 50,000,000 individuals. They are also considered in the Least Concern category of Endangered Species. This high number is mainly because they migrate quite often. In addition, their population size is increasing even though there is a danger to their survival if urbanization and overuse of pesticides keep increasing every day. Have a look at a few of our other bird articles.",
        "score": 0.75740516
    },
    {
        "Name": "Praying Mantis",
        "Diet": "Carnivore that eats anything it can handle including crickets, mosquitoes, grasshoppers, moths, small vertebrates such as lizards and frogs and other mantises really big mantises even take hummingbirds",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Their raptorial arms, which are held in the prayerful position that gives the insect its name.",
        "Fun_Fact": "The mantis can turn its head 180 degrees.",
        "Text": "“The Praying Mantis can be described as creepy but useful” “Praying mantis” is a term of art. All mantises or mantids belong to the Mantodea order, which has 2400 species. Some of them are not considered praying mantises, even though all mantises have raptorial forelegs that they use to snatch their prey. The European mantis, Mantis religiosa is considered the standard praying mantis, especially in Europe , but not every insect in the Mantis genus is considered “prayerful.” Indeed, the mantises Stagmomantis carolina and Tenodera aridifolia sinensis are also considered praying mantises and are the ones most commonly found in North America . Here’s more information about praying mantises. Here are five facts about praying mantises. The praying mantis belongs to the order Mantodea . name mantis comes from the Greek word for “prophet” and religiosa refers to the insect’s prayer-like look when its forelegs are raised. The carolina in Stagmomantis carolina means that the insect is found in the Carolinas. With Tenodera aridifolia sinensis , tenodera is Greek for “slender neck” and aridifolia means “dry leaf” in Latin. Sinensis means the insect comes from China. T. aridifolia sinensis is also one of the largest mantids. The praying mantis is estimated to have begun at the begging of the Jurassic era, about 201 million years ago. The current praying mantises most likely commenced in the early Crustaceous period, around 145 million years ago, on what was then the supercontinent of Gondwanaland. When South America separated from Africa, the major divergence of modern mantises occurred. An early mantis fossil of Santanmantis axelrodi , an extinct genus of mantises, is one of the most primitive lineages of this insect. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . As a member of the family Mantodea , the praying mantis has over 2400 classified species and 15 different subfamilies. There are 21 species of mantis in the Stagmomantis genus, 16 in the Tenodera genus, and nine species in the Mantis genus. Here are a few of the Mantis genera: The praying mantis is unmistakable. It has a long body with a triangular head that can move 180 degrees. Its antennae are also long and wiry, and its color can range from green to brown. Its compound eyes are huge. Like most insects, it has two pairs of wings and six legs, though the first pair has evolved into folding “arms” that can grab prey. Spines on the arms hold the prey in place while the mantis eats it. Males are smaller and slimmer than females and sometimes take flight at night. The European mantis is unique because it has an ear on its belly between its last pair of legs. Unlike other insects, it is a real ear as opposed to an organ that can pick up sound waves. Like all mantids, the praying mantis was built to be a very efficient predator. It finds its prey through sight and smell. It utilizes a “sit and wait” approach to hunting and will sit for a very long time on a plant before something comes along that it can grab. When prey comes within reach, it lunges and snatches it with its arms. The spines on the arms make sure that the insect has a firm grip. It does not employ a merciful kill bite and won’t wait till the prey is dead before it starts to feed. Mantises are even able to spear a bug in flight. Females are notorious for practicing sexual cannibalism now and then. Mantises don’t fly in order to hunt but simply get from one perch to another more quickly. Females can be so heavy that they can’t take flight at all. Praying mantises are solitary and only come together for mating. Despite its ferocity as a hunter, the mantis is a small and nonvenomous animal. When faced with its own predator it will rise up and flash its wings, which often have eyespots that startle its attacker. These insects are found in habitats where there are lots of flowering plants and thus lots of prey. They are not found in areas where winters are long and bitter. Praying mantises are generalists, which means they’ll eat anything they can handle. This includes other insects such as its distant cousin the cockroach . Ants are one of the few insects the mantis will chase after, but they most often wait for prey to come to them. The largest of the Chinese mantises, T. aridifolia sinensis can actually take hummingbirds . Any animal in the area that has insects as part of its diet preys on the praying mantis. This includes spiders, snakes , lizards , primates, birds , frogs , toads , rodents , bats , other small mammals , and even the murder hornet . The mantis itself is a hardy creature, with few diseases or parasites. It is prized by gardeners as it eats insect pests. Granted, it will eat beneficial insects as well, but its usefulness as an agent of pest control makes up for it. Reports of female praying mantises killing and eating their mates are exaggerated even though it does happen. Why should she not eat him? It takes a lot of energy to produce eggs, and he’s the largest prey that’s easy to catch. With that in mind, the male mantis approaches the female with great caution during the mating season. It can take him hours of stop-and-start moving before he’s close enough to jump on her back, use his “arms” to hold her still and mate with her. When it’s over after a few hours he lets go and drops to the ground to get away from her before she can turn around and kill him. Mating usually takes place in late summer or early fall. Mantis eggs overwinter and won’t hatch until spring, but before that the female creates an ootheca to protect her eggs. This is a capsule that’s made out of foam her body produces that hardens much like attic insulation. She lays 100 to 600 eggs in the capsule and then places it in a place that’s warm and sunny but still moist enough to keep it from drying out. If she has managed to kill and eat her mate, she produces more eggs and egg cases. After overwintering, the babies hatch. At first, they look like tiny maggots , but they molt soon after they’re born into a form that resembles their parents, though much smaller. Mantis babies molt about 6 or more times before they’re fully grown, and there are about two weeks between molts. Females probably have more molts because they’re bigger. The lifespan of a praying mantis is about nine months to a year, especially in a warm climate. Their lifespan is longer in captivity. Praying mantises are common and abundant insects around the world. They have no special status on the IUCN Red List or other lists.",
        "score": 0.75725627
    },
    {
        "Name": "Bee Eater",
        "Genus": "Nyctyornis, Meropogon, Merops",
        "Diet": "Insectivore that eats insects, including flies, beetles, dragonflies, butterflies, and cicadas and enjoys honey bees and especially likes wasps",
        "Behavior": "They can be characterized as colony social.",
        "Features": "Long, curved bills",
        "Fun_Fact": "They roll around in dirt to prevent external parasites",
        "Text": "“ These birds are highly social, roosting together and breeding in colonies. ” The bee-eater (Meropidae) is a medium-sized non-passerine bird native to Africa, Asia, southern Europe, and Australia. They inhabit a wide range of habitats, from semi-open woodlands to tropical rainforests. They don’t require much more than a perch and a place to dig their burrow. These birds are highly social, often breeding and roosting in large colonies. Find out everything there is to know about this unique bird family, including where they live, what they eat, and how they behave. Bee-eaters live across four continents, including Africa , Asia, Europe, and Australia. Most species occur in Africa, but several species inhabit Asia, from India and southern China to the Indonesian islands. Additionally, Europe and Australia each have a single species. These birds don’t have strict habitat requirements; they only need an elevated perch from which to watch for prey and a place to dig their burrows. You can find them in semi-open woodlands, shrublands, forests, rainforests, and sub-deserts. Their habitats are typically near water because riverbanks make good nesting spots. Look for bee-eaters in flocks perched on branches or pruning and sunning themselves on the ground. Bee-eaters are cavity nesters who burrow directly into the soil of the ground or the side of cliffs. They nest in colonies, and there may be hundreds of cavities in one area. Males and females dig their burrows using their sharp bills to jab the sand until it loosens. Nest building can take 20 days to complete, and their bills may become blunted and shortened during this time. The bee-eater (Meropidae) is a family of non-passerine birds, encompassing three genera and at least 27 species. The name Meropidae, is derived from the ancient Greek word ( Merops) for “bee-eater.” The recognized species of the Meropidae family: Bee-eaters are medium-sized non-passerine birds, measuring 7 to 12 inches and weighing 0.5 to 3.0 ounces, with a 10- to 20-inch wingspan. They feature large heads, short necks, short legs, and bright plumage. Their wings may be either pointed or rounded, and those with longer wings are more migratory. Their bills are long and curved with a sharp point, which they use to snatch prey from the air. Most species are at least partially green, and many have black bars through their eyes. Males and females are similar in appearance, and juveniles look a lot like adults. Bee-eaters are diurnal, although some species may migrate at night depending on the conditions. These birds are highly social, roosting together and breeding in colonies. Their daily rituals include emerging from their nesting holes after dawn, pruning and sunning themselves, and dispersing to feed. Some species participate in social activities even outside of the nesting season. They are also quite vocal, producing simple-sounding notes. However, when studied, they appeared to be rather complex. They live in colonies of five to 200 burrows, which are composed of clans. Each clan consists of two to three pairs, their helpers (male offspring from the previous year), and their offspring. Bee-eaters are medium to long-distance migrants. European species that breed in southern Europe and Asia migrate south to winter in western and southern Africa. Australian bee-eaters are sedentary in the northern parts of their range, but populations in the southern part of the continent will migrate to New Guinea and Indonesia. Several species are intra-African migrants who travel south into rainforest regions during the winter. Bee-eaters are insectivores; they hunt by air. These birds eat a wide range of insects, including flies, beetles, dragonflies, butterflies, cicadas, termites, crickets, grasshoppers, and moths. Their main prey are wasps and bees, which make up close to 70% of their diet. They will eat a significant amount of honey bees when they are in abundance, especially if their nesting colony is located near an apiary. These birds are aerial hunters, and they perch on exposed branches close to the ground. Small prey is eaten whole, while larger items are taken back to their perch, beaten, and broken into pieces. They rub venomous insects on branches to remove their stingers and venom sacs before consuming them. The IUCN lists 30 out of 31 species as LC or “least concern.” Due to their extensive range and substantial population sizes, most of the species do not meet “threatened” status thresholds. However, the blue-mustached is NT or “near threatened.” Their population is moderately declining due to habitat loss from timber logging and agricultural encroachment. The primary threats to bee-eaters include habitat loss, degradation, and climate change. Adult bee-eaters are eaten by birds of prey, such as hawks, eagles , and owls. This species uses vocal communications to warn others of potential threats, and males will aggressively defend their nesting sites. Their nest is vulnerable to rodents, weasels, martens, and snakes. Bee-eaters are monogamous during a breeding season, and species that are sedentary in their range may keep the same partner for several seasons. Populations that migrate will often change mates every year. Their courtship displays involve calling while raising their throats and wing feathers. Females lay five white eggs, and both parents incubate them for around 20 days. The chicks are ready to leave the nest after 30 days and can reproduce around one year of age. Their average lifespan is three to six years. The global bee-eater population is unknown, but the European species alone accounts for over 25 million mature individuals. Eight species have decreasing populations, including the blue-mustached, little bee-eater, northern carmine, purple-bearded, red-bearded, southern carmine, black-headed, and blue-headed. The main reasons for population decline include habitat loss, overexploitation for food, and pesticide use.",
        "score": 0.75565064
    },
    {
        "Name": "Anhinga",
        "Genus": "Anhinga",
        "Diet": "Carnivore that eats fish, amphibians, crawfish, shrimp, crabs",
        "Behavior": "They usually live in colonial nests.",
        "Features": "Long S-shaped neck",
        "Fun_Fact": "Their name means snake bird",
        "Text": "“The anhinga’s name comes from the Tupi language and means ‘snake bird’” The anhinga is a type of water bird known for its snake-hunting abilities. Some of its other names are snakebird, American darter, or water turkey—all of which refer to some aspect of its unique personality and appearance. They are often mistaken for cormorants due to their appearance. Because of their ability to thrive in a variety of areas, they’re often known to represent adaptability. The best place to find them is in South America . They can be found year-round in all of Brazil, French Guinea, Suriname, and Guyana , as well as occasionally in some of the surrounding countries such as Peru, Venezuela, Colombia, and Argentina. Further north, year-round populations can be found along the coastal areas of Mexico and the southeastern United States. In the United States, the best place to find an anhinga any time during the year is in Florida. You can, however, find them further north into Texas and coastal Georgia during their summer breeding months. When you’re setting out to find one, it’s best to look around freshwater sources. Anhingas prefer shallow, slow-moving water, such as in marshes. Here, you can find them swimming or sunbathing. They are also seen flying occasionally. You’ll be surprised to learn that they are actually colony-based birds . They often nest in groups of pairs, which can sometimes include hundreds of individuals. Not only will they nest around other anhingas, but they’ve also been known to nest around other types of colonial birds , like waterfowl. Males build their nests even before they have a mate. Typically, these nests are in trees that are close to the water, or even hanging over the water! The base of the nest is compact and made of sticks. However, they line it with softer materials, such as leaves, twigs, and cattails. If the nest has been used for a while, its exterior may have a white coating from their waste. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The anhinga’s scientific name is Anhinga anhinga . There are two subspecies: A. a. anhinga and A. a. leucogaster . Its class is Aves, as with many other birds, and it belongs to the family of Anhingidae. The anhinga is a rather large bird. They have a length of around 35 inches, and they weigh up to three pounds. Their wingspan is around 3.7 feet. A. a. anhinga is larger than A. a. leucogaster , though both subspecies have similar average sizes. Anhingas have many notable features. First, they have a large bill that can be twice as long as their head. It comes to a sharp point that helps them to hunt, and it can easily be seen thanks to its yellow color. As water birds,they also have yellow webbed feet. They display sexual dimorphism, which means males and females look different. Males are a glossy black with blue and green hues, much like a crow or raven. In certain areas, such as the base of their wings and tails, there is less of a green hue. The upper body and neck have white streaks they may have a purple hue. Females are similar except they have a chestnut color rather than black. Hatchlings’ first set of down is brown. It is replaced by a second white down before turning into brown feathers. As they reach maturity, they will develop the right colors depending on if they are male or female. The anhinga is named for its long, snake-like neck. However, it has also garnered common names referring to its wide, fanned tail that resembles that of a turkey . Migration is not common in anhingas. This is because a majority of the population are situated in year-round areas. However, during their breeding season, they may travel further north into the United States. This means that, rather than being found only around the coasts, they can be found deeper into Central Texas and along the southeastern coast in Georgia. The anhinga is different than most water birds. It has dense bones and no waterproof coating on its feathers. This allows them to fully submerge in water and dive for their prey. Anhingas eat most of the common prey found in their choice of water sources. This includes snakes , crawfish, catfish , black bass, mullets, sunfish , crabs, shrimp , and tadpoles. The anhinga is considered to be a species of the least concern . However, their population was last assessed in 2016 and was determined to be declining however. There are two main non-natural threats currently impacting the anhinga population in the western hemisphere. This includes loss of resources and pollution. Urbanization and overfishing have greatly reduced the food and space available to the anhinga, while pollution can cause illness in the ecosystems where they live. There are also natural predators that pose a risk for anhingas. As large predatory birds, there are not many predators of the anhinga. For the young, they are at risk of other large birds, especially hawks . However, anhingas at all stages of life are preyed on by crocodiles and alligators . While the parents are away hunting, hawks can easily swoop into the nest and steal away young anhingas. For those hanging over the water, alligators and crocodiles may be able to jump up and capture the young as prey. Adults are also at risk of being attacked by large reptiles. This most often occurs while they are submerged in the water and hunting. Due to their neutral buoyancy and dense bones, anhingas lack the ability to float for long on top of the water. As a result, attacks rarely occur on the surface. Anhingas lay anywhere from 2 to 6 eggs per clutch. Their eggs are pointed on one end and have a greenish-blue hue, just like adult feathers. The eggs are longer than they are wide, with the largest of eggs measuring around 2 inches long and 1.5 inches wide. The incubation period for anhingas is around 26 to 30 days. After this, the hatchlings emerge and are completely dependent on their parents. They being to grow their down and feathers, and, at three weeks, they are able to gain mobility and move around the inside and outside of the nest. They become fledglings at around six weeks old. However, even after fledging, young anhingas won’t leave the nest for several more weeks. They reach sexual maturity at around two years of age, in which they will begin to construct their own nests and lay eggs. Anhingas are monogamous and will mate for life. The oldest anhinga ever was 12 years old. Although past assessments have shown the anhinga population to be of the least concern, there are no exact numbers of individuals. It is estimated that there are as many as two million individuals. However, due to the impact of the loss of habitat, their population is considered to be in decline.",
        "score": 0.7502
    },
    {
        "Name": "Blackburnian Warbler",
        "Genus": "Setophaga",
        "Diet": "Omnivore that eats insects, spiders",
        "Behavior": "They can be characterized as mainly solitary solitary except during mating season.",
        "Features": "Orange throat",
        "Fun_Fact": "They are the only songbird in North America with an orange throat!",
        "Text": "“Blackburnian warblers are the only songbird in all of North America with an orange throat!” The blackburnian warbler is a common songbird found in the western hemisphere, especially in North America. Although it is rarely seen in Europe, there have been sightings along the west coast. Despite being found mostly only in the Americas, the blackburnian warbler was named after Anna Blackburne, an English botanist. The name of the genus, Setophaga, comes from the Ancient Greek words ses, “moth” , and phagos, “eating. The blackburnian warbler is a highly migratory bird. This means that there are no year-round populations anywhere in the western hemisphere they call home. Instead, they will spend their breeding season in the northern region of the United States and the southern region of Canada . During their non-breeding season in the cooler months of the year, they migrate into South America , where they can be found in almost every northern country except for Brazil. Outside of these areas, the best area and time to find the blackburnian warbler is in the migratory period. Here, you will be able to see them in Central America as well as in the midwestern and eastern United States as they make their way either north or south. There’s not actually a lot known about the blackburnian warbler nests. While this is in part due to their migratory behavior, it is mostly because of their nesting habitats. The blackburnian warbler prefers to nest in dense, secluded forests on the tops of high trees. This can make it difficult to observe their nesting behaviors in the wild. What is known about their nests, however, is the overall shape and material. They have cup-shaped nests towards the ends of branches that are constructed out of twigs, branches, and similar materials. The insides are lined with softer materials, such as moss, grass, and pine needles. It is suspected that females build the nests. The blackburnian warbler has the scientific name of Setophaga fusca . Their genus name is of Greek origin, while their species name is Latin for “brown”. Its class is Aves, and its family is Parulidae. The blackburnian warbler, like other similar songbirds, is a small, thin bird. They can grow to be anywhere from 4.3 to 4.7 inches long, and they can weigh as little as 0.3 to 0.4 ounces. Their wingspan ranges from 7.9 to 9.1 inches, making it around double their length. As far as coloration and appearance go, it can be hard to miss these striking birds when they come into view. Males have a black and white body. Their face and neck are a brilliant, bright orange with black markings. Females tend to have more of a brown or tawny coloration along their body, with a yellow head and no markings. Juveniles, including males, resemble females before maturing. One of the main things that blackburnian warblers are known for, other than their bright colors, is their migratory patterns. Blackburnian warblers have no year-round populations. During their breeding seasons in the warmer months, they can be found in the northeastern region of the United States and the southeastern region of Canada. During migration, they can be seen along the midwestern and eastern United States as well as in Central America. Then, during the cooler months of non-breeding, they can be spotted in South America. This small bird is almost entirely insectivorous, which means it eats mostly insects. However, what prevents the blackburnian warbler from being entirely insectivorous is that they may also supplement their diet with berries as needed and desired. This is most common in the wintertime. Their diet is one reason that it is not common to see blackburnian warblers at or around bird feeders with other types of passerines. Rather than the seeds that are typically common at bird feeders, the blackburnian warbler is more drawn to high protein food such as mealworms, since they have carnivorous tendencies. During their breeding months in the summer in the north, blackburnian warblers will mainly focus on insects. One of the largest components of their diet during this time is the larvae of moths and butterflies . There was one study that found that 98 percent of the blackburnian warbler’s breeding diet consisted of insects, with the rest consisting of spiders. As mentioned above, during their winter months in the south, blackburnian warblers may eat berries when available. Whether as adults or as eggs, there are many different types of animals that prey on the blackburnian warbler. This includes large birds of prey and even some types of mammals. However, these aren’t the only threats to the blackburnian warblers. Like many other types of passerine, the blackburnian warbler has been greatly impacted by habitat loss. This is especially true in their breeding territory, where they rely on certain types of forests to create their nests and raise their young. As mentioned above, both large birds of prey and mammals . This can include bluejays, squirrels , sharp-shinned hawks , and Cooper’s hawks . Both the male and female offer a brief courtship display when it comes time to mate in the warmer months of their breeding season. Females will crouch and display their wings and tails with small, fluttering motions. Males, however, will take to the skies with an ariel courtship display. As passerines, they can also use songs to find their perfect mate. A single brood can consist of anywhere from 3 to 5 eggs. These eggs are light greenish or white and can have brown markings on them. Female blackburnian warblers build the nests, and they are the main ones responsible for incubating the eggs. Both parents will take part in raising the hatchlings, from feeding to teaching them to fly later on. The oldest blackburnian warbler was around 8 years old. It is more typical to see them live to be anywhere from 3 to 6 years old, however. Hatchlings remain in the nest for around 2 to 4 weeks. They then become independent from their parents in around 2 to 3 months. Despite this, however, they will not reach maturity until around one year of age. Despite the threats that they may face, the blackburnian warbler is listed as a species of list concern. They have an estimated global population of 14 million. However, while they may be thriving globally, local populations or populations in certain areas may be declining due to humans and natural threats. The blackburnian warbler population is most at-risk in their breeding areas in Canada. These small songbirds have a highly specific area that they choose to breed and live in. They require tall, dense forests with high levels of privacy. As these forests continue to disappear to make room for urbanization and other reasons, it becomes more difficult for blackburnian warblers to find the resources necessary to breed and lay eggs. This as a result can begin to wear away at the population over time, especially since it can take a year or two after a successful brood for more adults to emerge and continue to grow the population.",
        "score": 0.7472283
    },
    {
        "Name": "American Cockroach",
        "Genus": "Periplaneta",
        "Diet": "Omnivore that eats organic and decaying matter",
        "Behavior": "They usually live in colonies.",
        "Features": "two sets of wings",
        "Fun_Fact": "Despite its name, actually originated from Africa and the Middle East",
        "Text": "“The insects were introduced to America, Portugal, and Spain from Africa on ships involved in the Atlantic slave trade and other commerce after 1625.” The American cockroach, sometimes referred to as a waterbug in the United States , is a nocturnal pest that originated in Africa and the Middle East. It is believed that these roaches traveled to America for the first time aboard Atlantic slave trade ships sometime around 1625. They are the largest species of cockroach , live the longest, and can actually fly short distances when necessary. Despite their nickname, these bugs do not live in water. But they do prefer warm, moist environments over desert regions. Their life cycle includes three stages including eggs, nymphs, and adults. The egg gestation period is six to eight weeks. As omnivorous scavengers, these common cockroaches will eat just about any organic matter. They prefer meats, starches, and sweets. But they are known to consume just about anything organic, including decaying matter, books, and hair. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The American cockroach is a member of the genus Periplaneta, a classification of large urban-dwelling cockroaches of the family Blattidae and order Blattodae. There are 47 cosmopolitan species of roaches in Periplaneta and about 4,400 species of cockroaches and termites in the order Blattodae. The American cockroach is now found in Spain , Portugal , the Canary Islands, and throughout North America . Along with other types of cockroaches in specific areas, the American roach can make up as much as 24% of the animal biomass. American cockroaches and other species of roaches are genetically similar to the termite. This is why scientists have reclassified termites and roaches into the same order, Blattodae. American cockroaches are reddish-brown in color with some yellow features, such as just behind the head. These are the largest species among common cockroaches, with an average length of 1.6 inches and a height from the surface of about 0.28 inches. But they are not as sizeable as the largest flying cockroach ever found in the world. That is Megaloblatta longipennis found in Peru , Ecua dor, and Panama with one flying specimen measuring 3.8 inches in length with a wingspan of eight inches. Their bodies have three sections: the head, thorax, and abdomen. Overall, the body is flat and wide in an oval shape, weighing about 0.105 grams at adulthood. Its head features a shield-like covering called a pronotum. At close range identification of the roach’s chewing mouth parts is possible. They also have long antennae and two sets of wings, some of their most important features. The fore wings are stronger and leathery while the hind wings are delicate and thin. While the American cockroach typically crawls on surfaces, a startled roach of this species is capable of flying short distances. Because these roaches are nocturnal, you generally will happen upon one or multiple at night. Turning on a bright light will startle them into quick motion at high speed. They will scamper away when perceiving a threat like a human entering a room. Sensitivity to vibrations makes them run from slamming doors, clapping, foot stomping, and other sudden sounds and movements. American cockroaches go through three stages in their life cycle, from egg to nymph and then adult. Their young, the nymphs, look just like adults but do not have wings. They molt an average of 13 times before metamorphosis. The nymphs can regenerate limbs, whereas adults cannot. Senior American cockroaches have trouble crawling up walls or along surfaces because of their age. These roaches live in colonies called intrusions. An intrusion works together to find food and other resources. Upon a small group of scouts’ identification of food or water, they release a distinct tracking odor called an aggregation pheromone to signal the rest of the colony to join them. Because members of one roach colony do not all come out at once, the number you see is just a mere fraction of the actual colony size. When roaches infest homes, they are called infestations. These pests prefer living close to easily scavenged food sources and live both above ground in buildings and below ground in basements, sewers, and other underground systems they use as superhighways to food sources. You can find them living in your walls, kitchen, bathroom, cabinets, basement, crawl spaces, lawn, and under other man-made structures like sidewalks, garbage receptacles, storage buildings, and porches. These pests carry at least 22 species of harmful bacteria, viruses, fungi, and protozoans that can infect humans. They also carry five species of parasitic worms. One of their biggest threats to humans is the pests’ production of airborne allergens, proteins that cause asthma attacks, and allergic reactions. American cockroaches can scamper out of view at speeds up to 3.4 miles per hour. This is the equivalent of a human running 210 miles per hour. They run away because of threat identification and as a reaction to light. Their eyes have over 3500 lenses, making them more sensitive to light than humans. They can easily run under doors and through very small cracks, crevices, and gaps. Because they are nocturnal, they are most easily seen at night. American common roaches are opportunistic scavengers. As true omnivores, they will eat just about any organic matter. Have a look at our “ What Do Cockroaches Eat ?” page for a complete list of everything that a cockroach eats. Many small mammals , amphibians , spiders , birds , and reptiles eat American cockroaches. Their predators vary according to the location and habitat. For example, in tropical environments, predators include spiders, ants, and mantids. Toads, fish, frogs, turtles, salamanders, lizards, and geckos also eat them. Mammalian predators include cats, mice, rats, monkeys, opossums, and porcupines. However, the roaches often carry viruses and parasites. They can pass these on to humans, as well as animals that eat them. Some of the parasites they carry include wasps, fungi, bacteria, and protozoa. Some wasps also eat American cockroach eggs, laying eggs within the roach egg sacs to sustain the wasp’s young. They eat man-made food products, decaying plant matter, plant shoots, vegetables, fruits, meats, sugar, starches, decomposing animals, solid waste, and even ear wax from the inside of a human or animal ear. They will eat book bindings, hair, cosmetics, milk, soap, glue, wallpaper paste, and fabrics. Some studies suggest they eat about half of their body weight each day. American cockroach colony infestations are notoriously difficult to exterminate. It is best to fight these pests both inside and outside of the home or structure at the same time. Start by caulking cracks and joints in ground-level walls, clearing away rotting leaves or other debris, and reducing moist areas around the structure. Then apply insecticides on basement walls perimeters, wood piles, and other places where the infestations have occurred. A professional exterminator can apply residual spray throughout the household and around its perimeter to kill roaches at all of their life stages, including those in egg sacs during the gestation period. Another method involves the use of poisonous pellet baits. One of the biggest differences between the American cockroach and the German cockroach is size. The American pests measure 1.5 inches on average, whereas the German variety is much smaller, typically only 1/2 inch in length. German roaches are also lighter in color, being tan with dark lines running their length whereas American roaches are reddish brown. American cockroaches are also often found in moist places their German counterparts do not frequent, such as basements, drains, and crawlspaces. German cockroaches typically show themselves in kitchens and bathrooms. However, homes are more likely to experience a German cockroach infestation than an American cockroach problem. This is simply because German roaches are more common. American cockroaches originated from Africa and the Middle East. They traveled on commercial ships, such as those of the Atlantic slave trade, to North America and Spain in the 1700s, though records indicate it could be as early as 1625. From there, the roaches inhabited anywhere people live, eat, or dispose of waste. Today they are found throughout Spain, Portugal, the Canary Islands, and North America. The American cockroach has specific traits and enlarged groups of genes relating to detoxification, the immune system, and growth and reproduction, which could be the reason it has been able to adapt to human living spaces.",
        "score": 0.7451062
    },
    {
        "Name": "American Robin",
        "Genus": "Turdus Linnaeus",
        "Diet": "Omnivore that eats earthworms, caterpillars, grasshoppers, beetle grubs, spiders, and snails",
        "Features": "orange chest",
        "Fun_Fact": "The color “Robin egg blue” is named after the hue of their eggs.",
        "Text": "“Most widespread and abundant thrush in North America” The American robin is a songbird in the thrush family. Thrushes are commonly referred to as “heralds of spring.” American robins have a positive relationship with humans . They are a friendly species that can help control pests. They also benefit the ecosystem by dispersing seeds from the fruit they eat. On the continent of North America , American robins reside in the United States , Canada , and Mexico . They live in a temperate climate in woodland and shrubland habitats as well as open land areas. They commonly have habitats in residential areas also. You can find them in the grass foraging for food when they are not roosting or nesting in trees. You may see them in lawns and gardens, farm fields, city parks, and wooded areas. The best time of year to find this bird relies heavily on the location. Since they migrate, they are found in different areas depending on the season. However, they are active all year long. Females build the nests with no help from her partner. She gathers twigs, grass, feathers, and paper to form the outside structure of the nest. She lines the nest with mud to hold it together. The inside is cushioned with soft materials including grass and other plant matter. When finished, the nesting structure is about three to six inches tall and six to eight inches wide. The nest is located either in the fork of tree branches or in a dense bush. It is typically placed a great distance from the ground, between 4.9 and 14.8 feet high. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The American robin’s scientific name is Turdus migratorius . It is in the thrush family, Turdidae, and the Aves class. Aves is a class of birds . The origin of the scientific name comes from the Latin words “turdus” meaning thrush and “migratorius” which means to migrate. There are seven American robin subspecies. The subspecies are eastern robin ( Turdus migratorius migratorius ), northwestern robin ( Turdus migratorius caurinus ), southern robin ( Turdus migratorius achrusterus ), western robin ( Turdus migratorius propinquus ), Mexican robin ( Turdus migratorius phillipsi ), Newfoundland robin ( Turdus migratorius nigrideus ) and San Lucas robin ( Turdus migratorius confinis ). The English robin formally named the European robin, is where the American robin got its name. Early settlers noticed it had similar features to the European robin, mainly the appearance of its red-orange breast. This, however, seems to be the only comparative similarity between the two birds. These species are not closely related. Though they share the same order and class, they belong to different families. The English robin is native to Europe and is part of the Muscicapidae family, also referred to as Old World Flycatchers. The American robin is actually a thrush that belongs to the Turdidae family. American robins’ anatomy is different so they are also larger than their European lookalikes. American robins are between eight and 11 inches in length and weigh 75 to 77 grams. They have a wingspan of 12 to 16 inches. Their anatomy is typical of a thrush. Their anatomy features include feathers, wings, and a beak. The beak is yellow and the throat is striped black and white. The head is black and the back is gray or black. The chest is a vivid orange color. Males are usually somewhat larger than females and have more colorful features. These birds exhibit social behavior. They tend to live in small groups and flock in larger groups at night. They are diurnal, therefore they are most active during the day. They sing a melodious song. It is often one of the first bird songs you hear in the morning. These birds are fully migratory. They migrate in flocks in the daytime. In the winter, they fly south. In the spring, they head north. In the fall, their migration depends on where there is a decent food supply available. The American robin is an omnivore. It eats both plants and animals. It forages on the ground throughout the day and will also forage at night. About 60% of their diet consists of fruits and berries and these foods are especially important in the winter. Aside from fruits and berries, an American robin eats a variety of invertebrates such as earthworms, caterpillars , grasshoppers , beetle grubs, spiders, and snails . Because American robins frequently spend time in residential backyards, they are sometimes indirectly poisoned by pesticides used by humans and killed by pet cats . They are also preyed upon by several animals in the wild. The American robin’s conservation status on the IUCN Red List is the least concern. The species is stable. Poaching was a problem in the past. They were hunted many years ago but they are now protected by the US Migratory Bird Act. Other than domestic cats , American robins are eaten by birds of prey and snakes . Some birds that prey on American robins are hawks, eagles , snowy owls , and northern pygmy owls. Snake species that regularly eat them include rat snakes and gopher snakes. American robin eggs and young have additional predators due to their vulnerability. Some common animals that eat eggs and chicks are raccoons , squirrels , foxes , crows, common ravens , and blue jays . The breeding season for American robins occurs between April and July. Reproduction is viviparous. The courtship behavior of the male is meant to attract a mate. He shakes his wings, spreads his tail, and sings for her attention. The female usually lays between three and five light blue eggs . It takes 12 to 14 days for the eggs to hatch. When the chicks hatch, they are altricial. This means that they are not independent and require care and feeding from their parents. The chicks leave the nest and begin fledgling about 13 days after hatching. It generally takes them two weeks to get good at flying and be able to sustain flight. Their average lifespan is two years and they molt once a year. The estimated American robin population is about 310 million. Roughly 79% of them are in the United States, 45% are in Canada and 13% are in Mexico. These birds have a huge range and are abundant. The population trend is increasing and there is no current threat to their decline. Their conservation status is the least concern .",
        "score": 0.7441247
    },
    {
        "Name": "Orange Crowned Warbler",
        "Genus": "Leiothlypis",
        "Diet": "Omnivore that eats insects",
        "Features": "Yellow or dusky undertail.",
        "Fun_Fact": "Often mistaken for the Tennessee Warblers, which are equally dull.",
        "Text": "The orange-crowned warbler is a unique songbird who primarily lives in the western hemisphere. This bird has a high-pitched trill for a song, and males even have different songs to differentiate them from each other. Both parents take care of the young, though only the mother incubates the eggs for just under 2 weeks. If you want to spot an orange-crowned warbler for yourself, you’ll need to look down. Typically, these birds forage in shrubs, but they aren’t often found in the western part of the United States . Most commonly, if you look for them in late spring and late fall (October), you might catch a glimpse in the southeastern region, but they become more abundant during the winter. Most often, they are seen in a range of areas in Arizona , New Mexico , and California , hiding within the edge of forests. They like habitats with thickets, rivers, and shrubs, leading them to live in a range of locations between North to South America . They can be found in other countries the Bahamas , Belize , Canada , Costa Rica , El Salvador , Guatemala , Mexico , Saint Pierre and Miquelon, and the Turks and Caicos Islands as well. If you can’t see them, you might still hear them. Their call is high-pitched and sharp, and they use it often. Some people describe their call as a trill, starting high and loud as it descends towards the end of each note. To avoid the threat of other birds who may rob their nests, the majority of the orange-crowned warblers in the world will build their nest on the ground, in tall shrubs, or in low trees. The only exception to this nesting location is the sordida subspecies. Without these predators to worry about, the only other threat is the Island Scrub-Jay, which is endemic to Santa Cruz Island in California. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Females protect their nests by finding a location that has nearby vegetation that can conceal them. The nest is typically made of leaves, twigs, grass, and moss. They line it with animal fur and dry grass for their eggs. Building the nest is a task that only the female takes on, but the male will stay nearby to stand guard. The orange-crowned warbler is primarily referred to as the Leiothlypis celata , but that hasn’t always been the name. Originally, this songbird was named Sylvia celatus by Thomas Say, an American zoologist, in 1822. The name was changed in 2008 by George Sangster, a Dutch ornithologist. It covers a total of four subspecies, which vary in size, molt pattern, and plumage color. The subspecies include: The word “ celata ” comes from the Latin “celatus,” which means “secret” or “hidden.” While many birds have beautiful colors that help them stand out to their partners, the warbler is quite plain. Despite the color orange being in their name, you won’t likely see any streaks of the vivid hue across the sky; they only show off their orange crown when they get excited because the head feathers raise. The songbird is usually a muted gray to olive-green, though the contrast varies among the different subspecies. The dullest is the one classified is L. c. celata , which is a pale grey, while the brightest yellow is seen on the Pacific Coast orange-crowned warbler. Dark green feathers adorn the L. c. sordida subspecies. Typically, the birds that remain further west tend to have more yellow. The rest of the body of the warbler is rather slim at just 9 grams in weight and just over 5 inches in length. They have a sleek bill and warm yellow feathers beneath the take. The telltale sign that you see an orange-crowned warbler is the lack of wing bars across their 7.25-inch wingspan. The most notable part of the orange-crowned warbler is their song because it is so varied. Other wood warblers stick to just a small melody, but the call of this warbler even changes from one male to another, making it their signature among potential mates. Some of these songbirds will collect in “song neighborhoods” made of two to six males who mimic the songs of each other. These groups will stay together for years. The flight of the orange-crowned warbler is quite fast, allowing them to catch prey quickly. These warblers are migratory birds, starting in the spring at an earlier time than other species. They tend to stay longer on the breeding ground, and they will go a higher range into northern Canada than most other warblers are willing to go. Their migration is solely based on the amount of food available to them and the amount of time they can stay warm. Once the temperature becomes too cold and food becomes scarce, they journey down to Mexico and further south again. The orange-crowned warbler bases its main habitat on where it can source food. They’ll forage from perch to perch, though they stay fairly close to the ground. This songbird eats many different insects and their larvae within their available habitat. They will also consume nectar, berries, flowers, and other nutrients. If you want to spot one in your yard, they are attracted to bird feeders with sugar water, suet, and peanut butter. Due to the small size of the orange-crowned warbler, they are easy prey for birds of prey, like hawks and eagles . Domestic and wild cats alike can also catch and eat them. The biggest threat to this type of bird has to do with the changing weather. In the spring, heatwaves can be detrimental to chicks who haven’t left the nest yet. Commercial development is also a threat as the construction of new builds takes away from their natural habitat. The orange-crowned warbler is at risk of being hunted primarily by birds of prey and cats. When a male warbler wants to court a female, he’ll follow her around as he droops his wings, spreads his tail, and points his bill up. This pattern will continue until she mates with him, though he will not sing his song until after she’s made a nest. He will even show his crown feathers if another male attempts to interrupt this pairing. While he won’t allow other male orange-crowned warblers near his mate or his nest, other species are tolerated easily. The orange-crowned warbler typically lays 3-6 eggs in her nest annually with just one brood each year. These eggs are white or cream in color, featuring reddish-brown speckles on the side that is larger. Incubation is relatively short, only lasting about 11-13 days. Upon hatching, they are covered in dark gray down feathers that are sparse along their bodies. Their eyes are closed, but they are able to gape for food and raise their heads. When the young – chicks – are born, they receive regular care from both parents, including their feeding. Between 10 and 13 days old, they are ready to leave the nest, though they will continue to improve their flight. Even though the chicks won’t continue to live in the nest, the parents will still feed them for a few days. Currently, the estimated population of orange-crowned warblers is about 76 million individual birds, spread amongst North, Central, and South America. Considering that the numbers are steady, the IUCN sees this bird as “least concern” for conservation efforts. Still, that doesn’t mean that they’ve always been safe. From 1966 to 2014, the North American Breeding Bird Survey estimated that the population declined by about 34%, threatened by the change in suitable habitat. The biggest threat to this population is the steady change of global warming, which changes where they can migrate and when they breed. Even with a lifespan of several years, crashing into towers and wind turbines can lead to an untimely death ahead of their time.",
        "score": 0.743932
    },
    {
        "Name": "Mealworm Beetle",
        "Genus": "Tenebrio",
        "Diet": "Omnivore with no preference",
        "Origin": "Europe",
        "Behavior": "They usually live in infestations.",
        "Features": "Their forewings that meet in the center of their bodies creating a straight line.",
        "Fun_Fact": "In 1968, the mealworm beetle traveled to space and circled the moon on the Soviet mission Zond 5.",
        "Text": "Adult mealworm beetles lay their tiny eggs in grain and grain containers, making it difficult for most homeowners to spot them. However, once they develop into larvae, they are easily seen as they are around an inch long. They adapt well to various habitats and occur in decaying animals, grains, grain products, and various plant species. Mealworm larvae are readily accessible as they are sold at most pet stores for bait and to feed to lizards , turtles , and reptiles . Two species of darkling beetle produce mealworm larvae: the yellow mealworm beetle ( Tenebrio molitor Linnaeus ) and the mini or dark mealworm beetle ( Tenebrio obscurus Fabricius ), which is less common. The mealworm beetle is native to Europe but occurs all over the world now, except in Antarctica. Mealworm beetles belong to the order Coleoptera , derived from the Greek words “koleos,” meaning sheath, and “ptera,” meaning wings. This refers to their forewings that act like a shield for their membranous hind wings. This order, which consists of beetles and weevils, is the largest in the Insecta class. Most adult species in this order have tough, dense exoskeletons that protect the majority of their body’s surface. Their forewings are called elytra and are just as strong as the beetle’s exoskeleton. They fold over the entire abdomen and act as protective shields for their big, membranous hind wings. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Their most distinctive characteristic is the appearance of their elytra which meet along the center of their backs, forming a straight line. Mealworm beetles belong to the family Tenebrionidae, the 5 th largest family of the order Coleoptera. There are over 14,000 species in this family, with 1,345 species occurring in the United States alone. However, these figures are relatively low since, in the past 3 decades, the classification of the family has changed, with many new taxa discovered each year. The mealworm beetle is generally dark brown or black in color and is often misidentified as the predaceous ground beetle, but mealworm beetles typically have clubbed antennae. However, both beetles are nocturnal and generally flightless. Due to the sheer number of species in this family, there are considerable variations in size and appearance. However, most of them have elongated oval shapes and flattened bodies. Mealworm beetles can measure up to 1.5 inches long in North America. These beetles are divided into 3 segments: head, thorax, and abdomen. They have abdominal defensive glandular reservoirs that secrete an extremely foul-smelling fluid, which is their chemical defense against predators. Adult mealworm beetles and their larvae are often found near the soil’s surface. However, they prefer living in weed-filled habitats, under stones or rocks, in leaf litter, or on decomposing logs. In addition, several species can adapt to living in arid dunes or caves. Some species even take over other animals’ homes, like birds , rodents , and termites . Mealworms are often found in grains and are a common pest in chicken coops and grain storage containers. In addition, they occur in peoples’ homes where there is grain with high moisture content. However, they are not common pests in homes, and many people start small businesses by raising them in their homes and selling the larvae as pet food or bait. Mealworm beetles are natural decomposers who eat feces, dead insects , and stored grains. They live in habitats where they are surrounded by their primary food source, typically under rocks, animal burrows, logs, or stored grains. These beetles go through four stages of development: The total duration of their life cycle depends on factors like temperature and food availability. However, the mealworm beetle’s average life cycle ranges from 4 to 12 months. The females start seeking dark, secluded areas to lay their eggs in the late spring or early summer. If they are in buildings during this time, they will lay their eggs in meal, flour containers, or grain. Females can lay up to 300 white, bean-shaped eggs at a time. When the larvae hatch, they are referred to as mealworms and are milky white with slim, segmented bodies. As they grow, they start to turn yellowish-brown within a few days. They feed on whatever surrounds them and grow to about an inch long while shedding several times in the process, which contaminates food supplies. They remain in their larvae stage until Fall and then morph into pupae to hibernate. The pupae are C-shaped, stout, and light yellow in color, but as they enter adulthood, they become darker. Once winter is over and the temperature rises, adult mealworm beetles will start to emerge. At first, they are white and orange but eventually turn dark yellow or black within a few days. These beetles are relatively slow but can fly, making it easier to travel and infest new territory. The adults can live up to 3 to 12 months. Mealworm beetles don’t cause much damage but carry various diseases that may negatively impact their host plant. They are also major pests when raising poultry because they are carriers of avian diseases and Salmonella. Seedlings are the most susceptible plants in gardens, so be sure to inspect the younger plants often. Look for any damage and check the soil for the source if you do find anything. Damage is generally caused by darkling beetles and other insects like cutworms. As a preventative measure, you can install a floating row cover overtop, which should keep them out. If an infestation occurs, you must remove the source by locating the infested material and placing it in an airtight container before disposing of it. In addition, you can freeze this container for five days, killing the adults and eggs. To prevent further infestation, store pantry items like cereal, grain, pet food, bird seed, and flour in tight containers. They are also attracted to animal feces, so if you have dogs and cats, remove any excrement from the property so as not to create a breeding ground for them.",
        "score": 0.74336994
    },
    {
        "Name": "Rufous Hummingbird",
        "Genus": "Selasphorus",
        "Diet": "Omnivore that eats some insects and enjoys red flowers",
        "Behavior": "They usually live in pairs and can be characterized as solitary.Their aggression level is medium.",
        "Features": "Reddish-orange coloring.",
        "Fun_Fact": "The males have a glowing iridescent orange patch on their chests.",
        "Text": "This hummingbird has brilliant coloring and can travel from Alaska to Mexico in one migration. As one of nine species of hummingbirds in its genus, the Rufous hummingbird is named for the reddish-orange coloring that most males have on their heads and chests. They favor red-colored flowers but also eat insects. Learn more about these fascinating birds . The Rufous hummingbird is native to North America , from Alaska to Mexico. They breed in Alaska and the Western parts of Canada and the United States during the spring and summer. They take advantage of native wildflowers in these regions as a reliable source of food. For the winter, they travel almost 4,000 miles to migrate to parts of Mexico. They need a warm climate to survive and cannot overwinter in the northern parts of the continent. This little hummingbird is known by the scientific name Selasphorus rufus . It is one species within the Selasphorus genus. There are nine species within the genus, which was established in 1832. The Rufous hummingbird is the type species. Previously, it was placed in the Trochilus genus along with other hummingbirds when it was discovered and described in 1788. The Rufous hummingbird is part of the Trochilidae family. It includes all hummingbirds, around 360 species in total. Hummingbirds are recognized by their ability to hover and feed on nectar, although they also eat insects . They were given the name hummingbird due to the humming sound that their fast-beating wings make when they hover. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Hummingbirds belong to the Apodiformes order of birds, which also includes Swifts and Treeswifts. It is one of the most diverse orders of birds and has more than 450 species. They are part of the Aves class, which includes all birds. Birds are characterized by the presence of feathers, toothless beaks, a heart with four chambers, a high metabolism, and a lightweight skeleton. All birds also lay eggs to reproduce. Hummingbirds are part of the Chordata phylum and Animalia kingdom. While the Rufous hummingbirds are native to North America, they are part of a larger species of hummingbirds that began in Europe around 42 million years ago, when they began to diverge from their closest living relatives, the swift. The oldest known fossil is from southeast Germany, around 30 million to 35 million years ago. However, this species became extinct in Europe, it is still unknown how or why, and eventually migrated to North America and South America. The hummingbird of today evolved in the Americas about 22 million years ago. The Rufous hummingbird is in a genus that includes eight other species. This genus, Selasphorus , has the following hummingbirds: These tiny hummingbirds are around three inches long. They are not the smallest of all hummingbirds but do represent a good example of these interesting animals. The males are brightly colored, with a reddish-orange face. This gave them their name, Rufous, based on this coloring. They have white breasts and an iridescent orange patch on their throat. In fact, the Audubon Society Guide to North American Birds describes it as “glowing like a copper penny.” This helps bird watchers spot Rufous Hummingbirds easier, although this coloring is unique to the males. Some males also have green coloring on their backs or at the crown of their heads. Females more often have green coloring and are slightly larger than the males. They look similar to the Allen’s hummingbird, which also lives in many of the same places. Like other species of hummingbirds, the Rufous hummingbird eats nectar from flowers. It uses a long proboscis and tongue to access the nectar buried deep in the flower’s structure. It also eats insects that it catches on its wings. They tend to feed on red flowers , including penstemons, red columbines, paintbrush, scarlet sage, and gilia. When feeding, the Rufous hummingbird hovers in mid-air using its wings. They use downstrokes to generate lift at a greater rate than upstrokes. When feeding on sugar substances at hummingbird feeders, they do perch when given the chance. This helps them conserve energy, although they do not perch for long periods of time. Because they are small, Rufous hummingbirds can be prey for other larger birds and animals. Snakes in particular are quick to make a meal out of an unsuspecting Rufous hummingbird. Other threats include changes to their habitat and food sources. Pesticides can impact the availability of insects that make up a critical part of their diet. They are not picky when it comes to the type of insects that they eat, although there does need to be a ready supply. Early blooming of their flower food source can also make it hard for them to get enough to eat. They migrate and if the flowers have already bloomed by the time they get to their destination, Rufous Hummingbirds are not able to get the nectar inside. Like all other birds, the Rufous hummingbird lays eggs . The females build nests in trees and shrubs that are protected and hidden from predators. She uses moss to help the nest blend in better. They can also use old nests and refurbish them with additional grass, moss, and plant matter to make it sturdy and soft. The males will mate with more than one female, who then looks after the eggs until they hatch. This typically takes around two weeks. The females feed the young hummingbirds, who eventually leave the nest and fly around three weeks old. They typically stay around the Pacific Northwest when breeding, including Oregon , Washington , and Canada. They can travel as far north as Alaska, although they are less common in this area. Scientists are watching the Rufous Hummingbird population, which has been declining in recent years. While not listed as endangered, the International Union for Conservation of Nature did upgrade it to Near Threatened in 2018 based on population numbers and observations. The Nature Conservancy Canada estimates that its numbers have declined by as much as 60% since data was collected in the mid-1960s. The change in climate and temperature are thought to be the biggest threats to this hummingbird. As migratory birds , they rely on the seasons to dictate not only their nesting habits but also make their food sources available. If these change, it can have long-term effects on the Rufous Hummingbird population. Allen’s Hummingbird : This hummingbird, known by its scientific name Selasphorus sasin , is closely related to the Rufous Hummingbird and has similar coloring. It tends to stay near California , however, and has a more limited geographic range. Ruby-throated Hummingbird : The Archilochus colubris has a brighter patch of ruby-colored feathers at its throat, which makes it easy to spot. It lives in similar climates to the Rufous Hummingbird but also goes to the Eastern United States to breed.",
        "score": 0.74326223
    },
    {
        "Name": "Green Aphids",
        "Diet": "Omnivore with no preference",
        "Text": "Green Aphid Scientific Classification Kingdom: Animalia Phylum: Arthropoda Class: Insecta Order: Hemiptera Family: Aphididae See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Genus: Myzus Species: M. persicae Read our Complete Guide to Classification of Animals . Green Aphid Conservation Status Not extinct Green Aphid Locations Worldwide, warm climates Green Aphid Facts Prey: (Herbivores) Aphids suck the juices from plant leaves, stems, and roots. Name of Young: Nymphs Fun Fact: Green aphids reproduce asexually Predators: Green and brown lacewings, hover flies, lady beetles, bogeyed bugs, midges, soldier beetles , damsel bugs, wasps, and blister beetles. Habitat: New plant growth and buds Average Reproduction Amount: 50-100 Location: Worldwide, warm climates Green Aphids Physical Characteristics Color: Greenish, yellow-green abdomen Skin Type: Soft Lifespan: approximately one month Length: 1.5-2.6 mm Weight: Negligible Venomous: No Aggression: Low/None (Not a threat to humans but can damage plants) View all of our Green Aphid pictures in the gallery. Green aphids, also known as green peach aphids, peach potato aphids, or the greenfly are a type of aphid that is distinctively green in color. The green aphid gets its color from the type of plants that it consumes—namely broccoli, Brussels sprouts, cabbage, celery, etc. This specific type of aphid is the most prevalent aphid pest of the peach tree. These aphids can do a ton of damage to the trees, destroying the leaves and causing tremendous damage to their various tissues. The Myzus Persicae or green aphid is a type of aphid that has a very distinctive green color. The insect gets its color from the type of plants that it mainly consumes. It belongs to the order Hemiptera and is the biggest aphid threat to the peach tree. Green aphids will lay their eggs on the plants and once the nymphs hatch, they will begin feeding on the plant and causing damage to the buds, flowers, and foliage. The green aphid is anywhere from 1.8 – 2.1 mm long and appears in the summertime. It is yellow-green in color and its head and thorax are both black. When nymphs are first born, they are greenish in color and then gradually they become more yellowish. The nymphs that will eventually become winged female aphids can be pinkish in color. The wingless adult green aphids resemble the young nymphs and grow to be 1.7-2.0 mm long. Although green aphids are known mostly to be green in color, their color can vary depending on morphological differences that are mostly influenced by the type of plants they consume as well as the temperature of the climate they live in. Green peach aphids can be their normal yellow-green color, or they could be red or brown. You may sometimes hear the green aphid being referred to as the green peach aphid, tobacco aphid, or even the spinach aphid. The green aphid gets its various names from the types of plants that it can be found feeding on most commonly. Green aphids are also found on potatoes, lettuce, tomatoes, and many other types of vegetables. They like to feed on plants that grow above the ground and leave behind an indicator of their presence — dead whitish skin. Green aphids will shed or cast their skin during different parts of their developmental stages. Sometimes these shed skins can be found on the plants that they’ve accumulated on. Sometimes the amount of shed skin left behind can be very substantial and can be a clear indicator of a green aphid infestation. As is the case with many other types of aphids, green aphids, or green peach aphids, are classified as not extinct. Because of this, the aphid is in no danger currently of becoming extinct, and therefore are no conservation efforts to preserve the species. Aphids are considered to be pests and are commonly found gathering in large colonies on plants. These large groups can do a lot of damage to the plants that they accumulate on and rob the plant of its vital nutrients. Aphids feed through their mouths which are straw-like in nature. They feed by puncturing the plant with their mouths and then sucking the sugar-rich sap. They also like to feed on the leaves and roots of plants as well. They’ll use their sharp, pointed mouths to pierce through the various parts of the plants, leaving behind extensive damage that hinders or completely prevents the plant from absorbing water and nutrients, which then causes the plant to die. During the feeding process, many diseases can also be transmitted that can do great harm to the plants, even if nutrient absorption is not affected by the feeding. You can tell that a plant has been damaged by aphids in a number of ways. If a plant has been damaged by aphids feeding on it, it may have leaves that are curled up with damaged color. Another more obvious sign would be if the plant’s leaves appear to be wet but are actually covered in a substance called honeydew. This is a substance the green aphids and many other aphid types excrete after consuming sap from the plants and trees they inhabit. It’s called honeydew because of the high sugar content which is not needed by the aphid when consuming the sap and is subsequently excreted. This honeydew can sometimes grow a black, sooty mold as well. As mentioned above, green peach aphids are notorious eaters. They love to feed on the sap of many different types of plants and they can cause a lot of damage in the process. Green aphids will mainly eat vegetable plants like lettuce, potatoes, tomatoes, and hundreds of others. They will feed on any part of the plant, including the leaves, stems, flowers, and roots. This is why an infestation of green leaf aphids can be so detrimental to plants and agriculture, as they can feed so heavily on some of the most critical parts of a plant. Green peach aphids will suck the sap from a plant by puncturing it with their straw-like mouths. It gets the nutrients it needs and expels the rest of the unneeded sugars it consumed. This substance is known as honeydew which can contaminate the host plant and eventually form mold. There are quite a few different types of insects that feed on aphids as one of their primary sources of food. Some of the green aphid’s predators include soldier beetles, blister beetles, midges, big-eyed bugs, damsel bugs, hover flies, green and brown lacewings, and lady beetles (ladybugs). The eating habits of these bugs are one of the most natural ways to control an infestation of green aphids in your garden. All of the ones mentioned above are insects that will naturally feed on them in the wild and help keep their population under control. However, if you find yourself dealing with infestation levels of them in your own personal garden on your plants, you may want to consider introducing some of them into your garden to help bring down the numbers. Ladybugs can be purchased at many garden centers and can be released into your garden and onto your plants in order to help reduce the number of green aphids. They will feed on the aphids and take care of the infestation without doing harm to your plants themselves. Some parasitic insects, like wasp larvae, will feed on green aphids from the inside out after a wasp has laid its eggs directly on the green aphid’s back. This is a terrifying process that can leave behind what appears to be hollowed-out brown shells. These are the green aphids’ carcasses after being consumed by the wasp larvae. If you see any of these shells on your plants, it is advised that you leave them there in order to help encourage the process to continue. The larvae will go on to consume more of the green aphids and continue to reduce their population. Green peach aphids inhabit both garden plants and fruit trees like peach trees. During the life cycle of a green aphid, it will go through sexual and asexual reproduction periods. The green aphid has two forms—sexual and asexual. Most of the reproduction that occurs is asexual and happens through a process of parthenogenesis. This means that the growth and development of the embryo happen from an unfertilized egg cell. The full development of a green aphid occurs very quickly, with the young green aphid reaching the adult stage in as little as 5 days. Green peach aphids do not go through a pupil stage but will instead have the same appearance as an adult aphid during each nymphal stage. After about 3 or 4 generations of green aphids inhabiting fruit trees, some of the adults begin to develop wings and will fly away to other host plants, (namely vegetable crops) and begin to reproduce there as well. The following generations of green aphids that are born on the vegetable crops from the winged aphids will be both winged and wingless. These offspring will go on to reproduce asexually. Usually, in late August during the growing season, the winged aphids will migrate back to the fruit trees that they originally migrated away from and sexual forms of the aphid will appear for the first time. After the next mating period, the female aphids will lay their eggs on the bark of the fruit trees and the cycle continues. In total, the green peach aphids will go through 10-15 generations in a single growing period. Green aphids will typically live for approximately one month and reach the age of sexual maturity in only four to ten days. There are a few things that can be done in order to prevent a green aphid infestation. The first thing to do is make sure that you’re monitoring your plants. Early on in the season, you’ll want to check in with your plants frequently to check for the presence of aphids. Green aphids usually cause the most damage to plants during the late spring and are most active when the weather is warm or hot. Another tip is to check for ants. If you see a lot of ants around your plants, it may be a sign that there are also green aphids. This is because ants like to consume the honeydew that aphids produce and will hang around the plants that have them. So if you see a lot of ants nearby, have a closer look at your plants to see if you spot any green aphids. You can also plant onions near the plants that you want to protect from aphids. Aphids are repelled by the smell of onions and any other members of the onion family. If you plant onions, garlic, or even chives in your garden, you will lower the chances of green aphids establishing themselves on your plants. Another tip is to not over-fertilize your plants. Over-fertilizing can lead to higher nitrogen levels and lots of soft growth. Aphids are known to prefer to feed on plants that have high nitrogen levels and will seek these out. It is better to fertilize your plants with a slow-release fertilizer, that way the nutrients are dispersed in a slower state and will nourish your plants over time. Finally, if you do spot any green aphids on your plants, deal with the problem early. The longer you hold off, the more likely a small problem will turn into a bigger one and you may have an infestation on your hands in no time. If you spot green aphids, you can remove the branches or parts of the plants that they are located on, or you can hose your plant down with cold or cool water to get rid of them. You can also utilize the natural predators we mentioned earlier in the post like wasps, and ladybugs to help reduce their populations naturally.",
        "score": 0.74241763
    },
    {
        "Name": "Cedar Waxwing",
        "Genus": "Bombycilla",
        "Diet": "Omnivore that eats berries, small fruit, flowers, oozing sap, and insects",
        "Behavior": "They can be characterized as social.",
        "Features": "Rotund bodies and flat crests",
        "Fun_Fact": "Their feathers have red, waxy tips that can be hard to identify unless you’re up close.",
        "Text": "“Their breeding habitats are solely chosen by the availability of fruiting trees and shrubs.” The cedar waxwing ( Bombycilla cedrorum) lives in North America and inhabits open areas with fruiting trees and shrubs. These birds are highly social and live in flocks year-round, often seen passing fruit to each other as they perch on branches. Listen for their high-pitched whistles as they fly over water or hover near berry bushes. Find out everything there is to know about this waxwing, including where it lives, what it eats, and how it behaves. Cedar waxwings live in North America in 15 countries, including Canada, Mexico, The United States , Costa Rica , and the Bahamas. This species is migratory, spending its springs and summers in Southern Canada and its winters throughout the US, Mexico, and Central America. They inhabit open woodlands with abundant fruiting trees, like orchards, forest edges, streamsides, swamp edges, and backyards. Their breeding habitats are solely chosen by the availability of fruiting trees and shrubs. They place their nests in trees on a horizontal branch or fork, around six to twenty feet above the ground. Both sexes build a loosely constructed open cup of grass and twigs lined with moss, grass, and animal hair. The cedar waxwing (Bombycilla cedrorum) is from the Bombycillidae family, which includes the waxwings, three species of passerine birds . The genus name, Bombycilla, is Ancient Greek and Latin for “silk” and “tail.” And its specific name, Cedrorum , is Latin for “of the cedars.” The cedar waxwing is a medium-sized passerine bird, measuring six to seven inches long and weighing 1.1 ounces, with an 8.7 to 11.8-inch wingspan. They have rotund bodies with large heads and broad, short bills. They have short tails and wide, pointed wings, and their crest is flat and lays over the back of their head. It has a light brown head and chest, a yellow belly, gray wings, and a black face mask outlined in white. Its tail is also gray with yellow tips, and its wings have red, waxy tips on the end of the feathers. These are highly social birds who stay in flocks year-round and will even nest in small communities. They are solid, steady fliers with constant wing beats reaching 25 Mph. It often calls, especially in flight. Their calls sound like high-pitched whistles and buzzy trills. They flutter around berry branches, passing fruit to one another. Cedar waxwings are short to long-distance migrants. They breed in Central to Southern Canada and spend winters in the Southern United States, Mexico, and Central America. Some populations in the northern half of the United States live year-round in their environments. Cedar waxwings are omnivores who forage in flocks. Their diet includes berries, small fruit, flowers, oozing sap, and insects . They feed on various berries like wild cherries and juniper and consume insects like beetles , ants, and caterpillars. These birds forage alone or in pairs during the nesting season but eat in flocks the rest of the year. They hover over vegetation to take berries and insects, and they will catch flying insects mid-air. The IUCN lists the cedar waxwing as LC or “least concern.” Due to its extensive range and extremely large, increasing population, this species does not meet the “threatened” status criteria. The most significant threat to the cedar waxwing is collisions with cars and windows. They could potentially be affected by climate change in the future and suffer from spring heat waves and wildfires. Cedar waxwing predators include merlins, hawks, grackles, and bullfrogs . Blue jays and house wrens are their nest predators. Not much is known about how these birds defend themselves, but they may find safety in numbers. Cedar waxwings are serially monogamous, meaning they mate with only one partner per breeding season. Their courtship displays include posturing, touching bills, and passing food back and forth. Their nesting season is late and doesn’t begin until mid-summer, and they lay two broods per year. Females lay two to six, typically three to five, pale blue-gray eggs with brown and black spots. Females incubate for 12 to 13 days, but both parents assist in feeding the nestlings. The young fledge the nest 14 to 18 days after hatching and can reproduce around one year old. This species can live up to eight years in the wild. The global cedar waxwing population is estimated to number 64 million mature individuals. Trends suggest their numbers increased over 7% in the last ten years and continue to increase slowly. Their numbers are not experiencing any extreme fluctuations or fragmentations.",
        "score": 0.7420584
    },
    {
        "Name": "Insect",
        "Diet": "Omnivore with no preference",
        "Fun_Fact": "Insects go back over 350 million years, making the creatures older than man, flowering plants and dinosaurs.",
        "Text": "Insects are one of the most plentiful and common species in the world. Depending on the resource, it’s believed there are somewhere between 900 thousand and ten million different kinds of insects. Insects potentially make up 90 percent of all forms of animal life. And like people, each species has its unique appearance, behavior, habitats, characteristics, and other factors. They are different based on family, region, weather, and more. One thing all insects have in common is their segmented bodies, external skeletons, and jointed legs. Another distinct feature is they are all small compared to most creatures. Some types of insects are pests. Others play a beneficial role in their ecosystems. There are species that carry disease, attack other animals with their stings and bites. Many interfere with humankind to the point where control measures like repellents are applied. Many invade and destroy. Others do far worse. Killer ants are exactly what the name implies. Another killer is the Asian giant hornet that delivers its venom with quarter-inch stings. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Science is quite fascinated with insects, seeing them as valuable in the study of identifiable aspects of ecology and biology. The creatures have been influential in the study of genetics, hormonal action, the function of nerve and sense organs, and more physiological studies. Insects are also influential to biodiversity, helping to make environmental quality assessments, including soil safety and water quality. The world of the insect is actually pretty fascinating. Read on to learn why! Insects are pancrustacean hexapod invertebrates. They belong to the class Insecta or Hexapoda and are the largest group within the family of arthropod phylum. The scientific name is Insecta . There is also the group of Arachnida . Here is where we classify the likes of spiders. Insects are part of a bigger group called Arthropoda . The group encompasses every creature with segmented bodies and legs and exoskeletons. Animals like mites, spiders, and ticks make up the phylum Arthropoda . However, other arthropod classes include Diplopoda and Chilopoda . We couldn’t possibly cover all the types of insect information that’s out there in a single post. It would entail possibly millions of animals, including surprises like slugs and snails . When it comes to size, the vast majority of insects are small. Where they do go in a variety of directions is in width. Insects, in general, are about 0.2 inches long. You’ll find creatures that are practically microscopic such as the parasitic wasp and feather-winged beetle . But you also have Australian stick insects and African goliath beetles that can be much larger. The Hercules moth , with its wingspan, is an insect that can hit over 10 inches. Insect characteristics include: Insect fossils have been found dating back around 400 million years to the lower Devonian period. During the Carboniferous era, winged insects known as Pterygotes experienced a significant burst of diversification. Another major diversification occurred among the Endopterygota group during the Permian period. In fact, a recent study offers significant support for the idea that insects evolved from a particular group of crustaceans. This means that flies, honeybees, ants, and crickets all originate from a branch within the arthropod family tree that also led to modern crabs, shrimp, and lobsters. Insects are everywhere. They are, for the most part, invaders. Despite what they may offer ecosystems, almost no one is ever happy to see them in their gardens or homes. Insects also live in freshwater streams, deserts, snowy mountains, and tropical rainforests. (Only around three percent of insects actually live in or near water.) They hide in your trees, your walls, cupboards, and, unfortunately, your bed. Let’s take a look at their more common habitats. Aquatic insects include water striders, mosquitoes , dragonflies , and certain water bugs. Other types of insects spend time in bodies of water to lay eggs. After, they return to land. The predatory diving beetle hunts for food beneath water surfaces. Honeybees create elaborate hexagonal structures where they live and work. Worker bees use their glands for converting honey into wax. Other bees chew and then chew it, creating a substance to build a hive. Bees stash hives of hollow trees, rock crevices, and tree branches. Many forms of insects take refuge in the branches, leaves, hollows, and crevices of tree bark. Weaver ants in sub-Saharan Africa make nests out of leaves. The creatures go for leaves they can bend and shape. One ant will find the location and the other ants will help pull the leaf into a pocket shape. They then gather larvae silk to use a natural glue to sustain the alteration. Many insects go underground. The reclusive termite , when not invading your spaces, create mounds that extend below and above ground. Inside the structure is a network of tunnels for getting about to find food. Many insects are nomads. They are also quick to settle in if they can locate food sources. Bed bugs use your sleeping accommodations, lurking in beddings until you’re resting. That’s when they come out so that they can bite you. Termites hide inside your structures, their bites gnawing away at it and leaving serious damage. Ants and moths relentlessly scour your ecosystems in search of nourishment. What type of bug you have depends on where you are and climates and other factors. Trying to pinpoint what the insect community diets on would be akin to saying humans eat food. They pretty each what their environments give them access to. Insects eat plants. Predatory insects eat other insects. Some insects survive by taking bites and then drinking blood. Others chow on nectar or enjoy scraps of food. You can find insects that use their stings to incapacitate prey before feeding. There are types of animals in the category that don’t eat anything. That includes some moths and mayflies . Reaching adulthood, they lay eggs and then pass away. They don’t require food because their lives end in days and sometimes even hours. Other insects are healthy eaters. Silkworms manage a 56-day diet of leaves that weigh over 4,000 times their weight. The locust ingests its weight on a daily basis. Leafhoppers and aphids suck in plant sap. The praying mantis hunts small creatures, including caterpillars , spiders, and moths. Other insect-eaters include assassin bugs and some female mosquitoes. The creatures have an array of mouthparts for feeding. There are moths with no mouthparts at all. Some chew, others siphon, sponge, dissolve food before taking a meal. Getting rid of bugs depends on the circumstances. Habitat plays a big part. Framers need to find safe ways to get rid of these pests without causing harm to crops. Homeowners may want to find humane solutions. Others go straight to repellents like pyrethrin or zappers. Natural repellent alternatives include dish soap (ants) basil (flies), and baking soda for bed bugs . There is no one-stop-em-all solution when it comes to bugs. In many cases, you may need several solutions. Preventative measures are helpful, additionally, getting rid of bodies of water will deter mosquitoes.",
        "score": 0.7417967
    }
]