[
    {
        "Name": "Housefly",
        "Genus": "Musca",
        "Diet": "Omnivore with no preference",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Limbs are used to taste food; eyes",
        "Fun_Fact": "The fly has no teeth",
        "Text": "“Houseflies can walk upside down.” Up there with the cockroach , the housefly is one of the world’s most annoying insects . Nearly 90 percent of all species invading our habitats are houseflies. They survive on a diet of decomposing garbage and organic waste. Flies are one of the filthiest creatures on the planet, carrying millions of disease-infested microorganisms over their lifespan. Originally hailing from the steppes of central Asia, this ubiquitous fly has since spread to every inhabited continent, thriving in diverse climates spanning from tropical to temperate. It has successfully adapted to a wide range of environments, encompassing both rural and urban settings. According to research, it is believed that house flies (Musca domestica) likely originated in the Middle East. They have a remarkable history, dating back at least 65 million years. Some sources even suggest that house flies may have arrived in the Americas alongside or possibly even before Columbus, potentially with individuals such as Brendan the Irish monk around AD 550. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The housefly lives close to people. They feed on waste and foodstuff wherever they find it in a habitat, transporting various disease agents along the way with speed. All species in the Musca domestic family adapt to human cohabitation. They have another thing in common: they’re threats to our health. Over its life cycle, the fly is a spreader of varying infections. Science links blowflies to enteric infection transmission. That includes diarrhea, dysentery, typhoid, and cholera. Other health concerns fly brings to the table are trachoma and epidemic conjunctivitis (eye infections), cutaneous diphtheria, yaws, leprosy, and mycoses (skin diseases). Here are some of the more common species of the housefly. Filth fly is the actual term used for the entire spectrum of flies, for all the obvious reasons. The common housefly goes after your food and insists on flying around your face when you’re trying to rest. The insects search for food and waste not just for eating but to lay eggs. There isn’t any part of the world where these annoyances aren’t invading sewers, trashcans, carrions, or feces. Known also as bottle flies, the blowfly generates its offspring in rotting meat or carrion. Two of the most common bugs here are the blue bottle fly and the black blowfly. If you see these critters that likely means you have some type of animal carcass in the walls, attic, or basement Mistaken often for a smaller housefly, the drain fly is unique unto itself with its moth-like or furry appearance. The creature prefers sink drains and unused garbage disposals. They drop eggs in the built-up sludge in pipes. Pest control can be problematic as breeding sites can be hard to reach. The lesser version of flies is noted for being about two-thirds the size of its cousin. The pests create the same problems on a big scale throughout their lifespan. Fruit flies live in drain lines, or any source of moisture such as, say, a dirty garbage can. In your kitchen, they go for a diet of soda, vinegar, or overripe produce juice. The fruit fly gets into liquids and sticky syrups, contaminating them. Their invasions take place pretty much in the summer and fall. But they can occur any time of the year if the flies can find sound reproductive sites and suitable food sources. Cluster flies are larger than the common type. They claw to get indoors during autumn to get out of the cold. Once inside, the pests proceed to populate spaces. Growing in numbers, they settle in walls and attics. Once things warm up, they will look for an escape. The critters infest your home while desperately searching for a way out. The stable fly is an animal found almost anywhere you might come across another animal. The insect is a bloodsucker. Unable to find animals, they will attack pets and humans. The aggravating creatures are also called dog flies (canines are easy prey) and biting flies (they resemble the common species). Let’s take a look at the morphology of these insects. There is almost no environment the housefly can’t adapt to. During the gestation period, larvae live on moisture so flies lay eggs wherever they find it. Some species use ponds, lakes, marshes, swamps, and birdbaths. Believe it or don’t, these nasty bugs use their 28-day lifespan to better the earth. They’re considered beneficial to nature as decomposers of decaying and dead organisms. Flies are critical to the food chain, serving as meals for reptiles, birds, fish, and even certain plants. The housefly gnaws at almost anything — the food you leave on your plate, carrion, fecal matter, spills, etc. The insect has no teeth. The animal uses its sponging mouth to liquefy meals, regurgitating the substance before ingesting it. They’re attracted to a wide array of substances such as the following: The most famous housefly predator is the frog . Who hasn’t seen the image of a frog flicking its tongue to catch one of these unsuspecting bugs? There’s also the spider who traps flies in webs. Many creatures eat fly larvae, including fowl , mites, wasps , and crickets . Some animals attracted to the same vegetables and fruits that draw in flies, will chow down on the larvae in them. Some animals also eat pupae beneath trees. Here are tips for dealing with flies and pest control, putting an end to their lifespan.",
        "score": 0.81999564
    },
    {
        "Name": "American Cockroach",
        "Genus": "Periplaneta",
        "Diet": "Omnivore that eats organic and decaying matter",
        "Behavior": "They usually live in colonies.",
        "Features": "two sets of wings",
        "Fun_Fact": "Despite its name, actually originated from Africa and the Middle East",
        "Text": "“The insects were introduced to America, Portugal, and Spain from Africa on ships involved in the Atlantic slave trade and other commerce after 1625.” The American cockroach, sometimes referred to as a waterbug in the United States , is a nocturnal pest that originated in Africa and the Middle East. It is believed that these roaches traveled to America for the first time aboard Atlantic slave trade ships sometime around 1625. They are the largest species of cockroach , live the longest, and can actually fly short distances when necessary. Despite their nickname, these bugs do not live in water. But they do prefer warm, moist environments over desert regions. Their life cycle includes three stages including eggs, nymphs, and adults. The egg gestation period is six to eight weeks. As omnivorous scavengers, these common cockroaches will eat just about any organic matter. They prefer meats, starches, and sweets. But they are known to consume just about anything organic, including decaying matter, books, and hair. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The American cockroach is a member of the genus Periplaneta, a classification of large urban-dwelling cockroaches of the family Blattidae and order Blattodae. There are 47 cosmopolitan species of roaches in Periplaneta and about 4,400 species of cockroaches and termites in the order Blattodae. The American cockroach is now found in Spain , Portugal , the Canary Islands, and throughout North America . Along with other types of cockroaches in specific areas, the American roach can make up as much as 24% of the animal biomass. American cockroaches and other species of roaches are genetically similar to the termite. This is why scientists have reclassified termites and roaches into the same order, Blattodae. American cockroaches are reddish-brown in color with some yellow features, such as just behind the head. These are the largest species among common cockroaches, with an average length of 1.6 inches and a height from the surface of about 0.28 inches. But they are not as sizeable as the largest flying cockroach ever found in the world. That is Megaloblatta longipennis found in Peru , Ecua dor, and Panama with one flying specimen measuring 3.8 inches in length with a wingspan of eight inches. Their bodies have three sections: the head, thorax, and abdomen. Overall, the body is flat and wide in an oval shape, weighing about 0.105 grams at adulthood. Its head features a shield-like covering called a pronotum. At close range identification of the roach’s chewing mouth parts is possible. They also have long antennae and two sets of wings, some of their most important features. The fore wings are stronger and leathery while the hind wings are delicate and thin. While the American cockroach typically crawls on surfaces, a startled roach of this species is capable of flying short distances. Because these roaches are nocturnal, you generally will happen upon one or multiple at night. Turning on a bright light will startle them into quick motion at high speed. They will scamper away when perceiving a threat like a human entering a room. Sensitivity to vibrations makes them run from slamming doors, clapping, foot stomping, and other sudden sounds and movements. American cockroaches go through three stages in their life cycle, from egg to nymph and then adult. Their young, the nymphs, look just like adults but do not have wings. They molt an average of 13 times before metamorphosis. The nymphs can regenerate limbs, whereas adults cannot. Senior American cockroaches have trouble crawling up walls or along surfaces because of their age. These roaches live in colonies called intrusions. An intrusion works together to find food and other resources. Upon a small group of scouts’ identification of food or water, they release a distinct tracking odor called an aggregation pheromone to signal the rest of the colony to join them. Because members of one roach colony do not all come out at once, the number you see is just a mere fraction of the actual colony size. When roaches infest homes, they are called infestations. These pests prefer living close to easily scavenged food sources and live both above ground in buildings and below ground in basements, sewers, and other underground systems they use as superhighways to food sources. You can find them living in your walls, kitchen, bathroom, cabinets, basement, crawl spaces, lawn, and under other man-made structures like sidewalks, garbage receptacles, storage buildings, and porches. These pests carry at least 22 species of harmful bacteria, viruses, fungi, and protozoans that can infect humans. They also carry five species of parasitic worms. One of their biggest threats to humans is the pests’ production of airborne allergens, proteins that cause asthma attacks, and allergic reactions. American cockroaches can scamper out of view at speeds up to 3.4 miles per hour. This is the equivalent of a human running 210 miles per hour. They run away because of threat identification and as a reaction to light. Their eyes have over 3500 lenses, making them more sensitive to light than humans. They can easily run under doors and through very small cracks, crevices, and gaps. Because they are nocturnal, they are most easily seen at night. American common roaches are opportunistic scavengers. As true omnivores, they will eat just about any organic matter. Have a look at our “ What Do Cockroaches Eat ?” page for a complete list of everything that a cockroach eats. Many small mammals , amphibians , spiders , birds , and reptiles eat American cockroaches. Their predators vary according to the location and habitat. For example, in tropical environments, predators include spiders, ants, and mantids. Toads, fish, frogs, turtles, salamanders, lizards, and geckos also eat them. Mammalian predators include cats, mice, rats, monkeys, opossums, and porcupines. However, the roaches often carry viruses and parasites. They can pass these on to humans, as well as animals that eat them. Some of the parasites they carry include wasps, fungi, bacteria, and protozoa. Some wasps also eat American cockroach eggs, laying eggs within the roach egg sacs to sustain the wasp’s young. They eat man-made food products, decaying plant matter, plant shoots, vegetables, fruits, meats, sugar, starches, decomposing animals, solid waste, and even ear wax from the inside of a human or animal ear. They will eat book bindings, hair, cosmetics, milk, soap, glue, wallpaper paste, and fabrics. Some studies suggest they eat about half of their body weight each day. American cockroach colony infestations are notoriously difficult to exterminate. It is best to fight these pests both inside and outside of the home or structure at the same time. Start by caulking cracks and joints in ground-level walls, clearing away rotting leaves or other debris, and reducing moist areas around the structure. Then apply insecticides on basement walls perimeters, wood piles, and other places where the infestations have occurred. A professional exterminator can apply residual spray throughout the household and around its perimeter to kill roaches at all of their life stages, including those in egg sacs during the gestation period. Another method involves the use of poisonous pellet baits. One of the biggest differences between the American cockroach and the German cockroach is size. The American pests measure 1.5 inches on average, whereas the German variety is much smaller, typically only 1/2 inch in length. German roaches are also lighter in color, being tan with dark lines running their length whereas American roaches are reddish brown. American cockroaches are also often found in moist places their German counterparts do not frequent, such as basements, drains, and crawlspaces. German cockroaches typically show themselves in kitchens and bathrooms. However, homes are more likely to experience a German cockroach infestation than an American cockroach problem. This is simply because German roaches are more common. American cockroaches originated from Africa and the Middle East. They traveled on commercial ships, such as those of the Atlantic slave trade, to North America and Spain in the 1700s, though records indicate it could be as early as 1625. From there, the roaches inhabited anywhere people live, eat, or dispose of waste. Today they are found throughout Spain, Portugal, the Canary Islands, and North America. The American cockroach has specific traits and enlarged groups of genes relating to detoxification, the immune system, and growth and reproduction, which could be the reason it has been able to adapt to human living spaces.",
        "score": 0.8157598
    },
    {
        "Name": "Western Tanager",
        "Genus": "Piranga",
        "Diet": "Insectivore that eats bees, wasps, grasshoppers, ants, beetles, cicadas, stinkbugs, and termites and especially likes insects",
        "Behavior": "They can be characterized as mainly solitary pair.",
        "Features": "Contrasting black and yellow color",
        "Fun_Fact": "They migrate farther north than any other tanager.",
        "Text": "The western tanager migrates farther north than any other tanager. The western tanager is native to the Americas, wintering in Mexico and Central America before migrating to the Western United States and Canada. They spend their days on the tops of coniferous trees, searching for food and feeding their young. They may be challenging to spot due to their location, but listen closely for their hoarse robin-like songs and bright yellow and orange coloring. Learn everything there is to know about this beautiful bird , including where they live, what they eat, and how they behave. The western tanager lives in and migrates through at least 14 countries, such as Canada, the United States, Mexico, Nicaragua, and Costa Rica . You can find them in the western United States and northwestern Canada during the warmer months and in central to southern Mexico and Central America during the winter. They breed in open woodlands, primarily in Douglas-fir and Ponderosa-pine trees. You may occasionally find them in aspen forests, wetlands, forest edges, parks , gardens, and burns. During migration, they stop in a wide range of habitats, like urban areas , backyards, parks, forests, and woodlands. During the winder, also inhabit forests and woodlands. To find them, listen for their hoarse songs and chuckling calls. Look to the tops of the trees where they nest and forage; wait for their flashes of yellow and orange. Females build the nests by themselves, while males keep watch. The process takes four to five days, and females diligently scrutinize their potential nesting sites. She chooses a spot in an open canopy area, usually in a fir or pine tree on a horizontal branch away from the trunk. The nest foundation consists of twigs, weaved until they form a cup. And she lines the inside with soft materials like animal hair, feathers, grasses, and plant fiber. The western tanager (Piranga Ludoviciana) belongs to the Cardinalidae family, which includes Piranga tanagers, cardinals, grosbeaks, and buntings. Its genus Piranga is the cardinal bird family, and its specific epithet, Ludoviciana, is Late Latin for “Louisiana.” This species is monotypic, and no other subspecies exist. The western tanager is a medium-sized American songbird, measuring 6.3 to 7.5 inches long and weighing 0.8 to 1.3 ounces, with an 11.5-inch wingspan. They have stocky bodies with thick bills and medium-sized tails. Adult males are bright yellow with black wings and an orangish-red head. They also have white wingbars and black backs and tails. And females are an overall yellowish-green, while immatures have less red on their heads than adult males. Western tanagers are relatively solitary, except for when they form pair bonds. During winter, they may forage with other mixed-species flocks. They spend many days slowly moving along branches and shrubs, looking for food. But the males are vocal, especially during the breeding season. His songs are hoarse, short, and robin-like. These birds are also excellent, swift fliers with powerful wing beats. However, we don’t know their exact speed. Western tanagers are long-distance migrants who move alone or with small groups at night. They migrate farther north than any other tanager. They spend their springs and summers breeding on the west side of the United States ( Colorado , Wyoming, Idaho, Washington, etc.) and as far north as Northwest Canada near Yukon. They migrate through the Central US, parts of the West Coast, and Mexico before reaching their wintering grounds in Southern Mexico and Central America (Guatemala, Honduras, Nicaragua, and Costa Rica). Some also winter in Southern California . Western tanagers are mainly insectivores who supplement their diet with fruits and berries. They primarily eat insects, such as bees, wasps, grasshoppers , ants, beetles, cicadas, stinkbugs, and termites. During the fall and winter, when insects are no longer abundant, they will eat wild cherries, elderberries, mulberries, blackberries, buds, and seeds. They spend much of their time picking food from branches and foliage in shrubs or at the tops of trees. They will also fly out and grab flying insects like dragonflies and will clip the insect’s wings before swallowing. The IUCN lists the western tanager as LC or “least concern.” Due to its extensive range and large, increasing population, this species does not meet the thresholds for “threatened” status. While they are not experiencing any significant ongoing threats, they are still vulnerable to the effects of climate change . Spring heat waves and wildfires could endanger their habitats and young in the future. Hawks, owls , and jays are known predators of adult western tanagers. Their nests are vulnerable to owls, jays, snakes, black bears , crows, ravens, and squirrels. They make loud calls, flap their wings, and swoop toward intruders to defend themselves and their nests. Western tanagers are monogamous breeders who perform courting displays, such as chasing each other. Males defend their nesting territory by constant singing, and the two rarely leave each other’s sides. The breeding season runs from mid-April to mid-August, and females lay 3–5 bluish-green eggs with brown markings. Females incubate for 13 days, while the males bring food. But both parents share the feeding duties of their nestlings. The young leave the nest around two weeks after hatching and undergo a pre-juvenile molt shortly after fledging. These tanagers reach sexual maturity at around one year and can live up to 15 years, but live to an average of 8 years. The global population of the western tanager is unknown, but their numbers appear to be stable. Their species has increased slightly over the last 49 years in North America and doesn’t appear to suffer from extreme fluctuations or fragmentations.",
        "score": 0.8127782
    },
    {
        "Name": "Pennsylvania Wood Cockroach",
        "Genus": "Blattella",
        "Diet": "Omnivore that eats decaying plant matter",
        "Behavior": "They usually live in colonies.",
        "Features": "Functional wings in males",
        "Fun_Fact": "Seeks out sources of light",
        "Text": "“Out of all North American cockroaches, the Pennsylvania wood cockroach is the most likely to be found in firewood.” For many, even the mention of a cockroach is enough to bring about looks of disgust and feelings of revulsion. Roaches are one of the oldest species on the planet; they’ve been around since the early Carboniferous period, about 350 million years ago. Today’s cockroaches look almost exactly the same as their ancient ancestors. The key to their longevity has been the generalization and simplification of their bodies. Out of the nearly 5,000 cockroach species on the planet, only about 30 are known to be pests to humans. Out of those 30, only four species ( American , German, Oriental, and brown-banded roaches) represent most home and business infestations. Though the Pennsylvania wood roach is often mistaken for an American or German cockroach, it’s actually not considered a pest species. Pennsylvania wood cockroaches are also known simply as wood roaches—but don’t worry, there’s no difference between a Pennsylvania wood cockroach and a wood roach. As their name suggests, the Pennsylvania wood roach is commonly found in Pennsylvania. However, they’re not restricted to only one state; wood roaches can be found throughout the eastern United States, from Florida in the south, to southern Canada in the north. They’re not generally known in the western United States, roughly from the Rocky Mountains to the west coast. The wood roach’s scientific name is Parcoblatta pennsylvanica , named for the state in which they are most commonly found. Outside Pennsylvania, they are often called simply ‘wood roaches’. If you live anywhere in the eastern United States, and you find a cockroach hiding in your firewood, there’s a good bet it’s a Pennsylvania wood roach. Wood roaches exhibit a high degree of sexual dimorphism, meaning that males and females look very different. Both males and females have six long, segmented legs, two lengthy antennae, and segmented bodies. Like many cockroaches, the wood roach’s antennae exceed the length of the body; they use them to sniff out good things to eat, like rotting leaves and wood. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Wood roach legs are covered in thick spikes that give them traction when climbing even the smoothest of surfaces. The spikes may look intimidating, but don’t worry—they’re just for getting around, not for hurting people. The front pair of legs are the smallest, with the hind legs being the longest and strongest. Cockroach bodies are divided into three sections; the head, thorax, and abdomen. The head is covered by a hard shield called a pronotum ; when you look down at a cockroach, this is what you see instead of the head. The wings and first pair of legs are attached to the thorax, and the second and third pairs of legs are attached to the abdomen. Male wood roaches have body length, functional wings—they can easily fly through open windows into homes in search of food. Females meanwhile have wings only about half the length of their bodies. Their abdomens are also thicker than the male’s abdomen; females can’t fly or even glide. Wood roaches start out life as eggs encased in egg cases called ootheca. Each egg case contains around 32 eggs; they take around 34 days to incubate. Females birth the egg case whole and deposit it beneath loose bark, or inside of rotting trees for safety. On hatching, the larval wood roaches are pure white and soft-shelled. As they grow, they both darken in color and grow harder exoskeletons. They’ll stay in the nymph stage for 10-12 months on average, though it may last up to two years. During this stage, the nymphs repeatedly shed and regrow their exoskeleton in a process called molting. After the final molt, the nymphs become sexually mature adults. Unfortunately for the wood roach, the adult lifespan typically lasts only a few months. Adults are dark brown in color, while nymphs are closer to mahogany brown. Adult males have body length, tan wings that make them look very different from adult females. Unlike pestilential species of cockroach (like the German roach), Pennsylvania wood cockroaches don’t actually like the indoors. They’re a forest-loving species, and most spend their lives in the woods munching on greens and rotting wood. However, they have a soft spot for firewood and often make their homes in stacks of cut wood. This can cause problems if people stack firewood against their houses, or even store the wood in their homes. Wood roaches most often make their way inside via firewood, though males will also fly through open windows and doors in search of light sources. Wood roaches are truly a wood-loving species, which means they’re not a problem if you live in the city, or in a forest-free urban setting. They can, however, become nuisances to people living in or near woodlands, especially if those people employ wood-burning stoves. All cockroaches are omnivores , but each has a particular preference for one food or another. Some feed almost exclusively on leaves, while others prefer fruit. Still more rely almost entirely on human leavings like leftover food, waste, and garbage. The Pennsylvania wood roach isn’t a fan of garbage though—it prefers to munch on rotting vegetation. Wood roaches can be found anywhere there are forest detritus to feed on; fallen trees, pine needles, leaves, and bark all make a welcome meal for the wood roach. Unlike many other species of roach, the Pennsylvania wood roach has no problem with the light. In fact, they often feed on the forest floor during the daytime. This behavior opens them up to a whole host of predators. These include amphibians like frogs and salamanders , reptiles like snakes , small mammals like mice and rats , and birds. If you’re an urban dweller with a house full of roaches, you’re probably facing a species other than the Pennsylvania wood roach. If, however, you live in or near forested areas of the Eastern half of the United States, you may be dealing with a wood roach. Wood roaches come inside via firewood, open windows, or open doors. The best way to tell if you have wood roaches is by location; are they located near your firewood or fireplace? If so, they’re probably wood roaches. You don’t have to worry too much about an infestation though, wood roaches don’t easily survive indoors, and would rather go back outside. The big concern, when it comes to wood roaches, is when they decide to snack on your wood siding or wood shingles. They’re not terribly picky when it comes to easily digestible wood and leaf litter, but you do want to keep them from munching on your home. If you suspect a wood roach problem, you may want to employ roach traps or even insecticide spray. But, for the most part, Pennsylvania wood roaches don’t pose a threat to humans.",
        "score": 0.80608404
    },
    {
        "Name": "Vermilion Flycatcher",
        "Genus": "Pyrocephalus",
        "Diet": "Insectivore that eats flies, butterflies, grasshoppers, beetles, crickets",
        "Behavior": "They can be characterized as mainly solitary.",
        "Fun_Fact": "They have a fast song that lasts up to 10 syllables at max.",
        "Text": "The Vermilion Flycatcher is a type of perching bird that is found in South America and some parts of North America . The males differ from the females in terms of color. The males are more vibrant in color, making the females harder to identify. They have a unique singing voice that is variable but quite relevant in strengthening their population. If you are on the watch for the Vermilion Flycatcher, you can look for them during any season. They are usually residing in woodland areas, scrublands, farmlands, deserts , parks, savannas, shrubby areas, and even near water. You can spot them in both Southern and Northern America and at elevations of 10,000 ft above sea level. But the best place to look for them is in insect-rich areas during the months of December to May. This is also their breeding season. You will need to have a good eye because they will be perched on top of trees or near lakes , showcasing their majestic beauty. They are easily identifiable with their vibrant red and orange coloration while the females appear gray. Moreover, their sweet songs can be heard from far which you can follow to spot them with ease. All in all, any open area is a good resting site for them, even if it is on street lights along the road. So, you won’t find much trouble spotting them. However, during the breeding season, they are found to prefer specific trees and plants . They include cottonwood, mesquite tree canopies, and Goodding’s willow. A suitable time to look for them is during the winters when they are found in flocks. They have quite a unique structure for the nest. The cup is made up of twigs, grass, empty cocoons, and a spider web to wrap it up as a whole. In addition, you will find it hidden under lichen as a way to camouflage it from predators. It is also lined up with feathers, hair, and other plant components. The nest of a Vermilion Flycatcher is usually perched up on the trees, around 20 inches up. Rarely, you can find a Vermilion Flycatcher’s nest that is perched higher than 50 inches from the ground but it has happened. There may be 2-4 eggs and they are white in color with a few brown/olive/lavender spots. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The Vermilion Flycatcher was first called the Pyrocephalus obscurus in 1839 and then in 1840, it was also identified as Pyrocephalus rubinus. Today, both names which are Greek in origin, are considered for their description although, Pyrocephalus rubinus is used for another bird known as Scarlet Flycatcher. The Vermilion Flycatcher belongs to the Class Aves and the Tyrannidae family. Up till 2013, people thought that it had nearly 13 species but this claim was disregarded by a 2016 study. It further claimed that the Vermilion Flycatcher only has nine subspecies, which are as follows; The Vermilion Flycatcher is a small and round bird with a straight bill. It has a short head but a barrel-chested and stout body. Its tail, however, is long and slender. It measures up to 5.1 to 5.5 inches in length and 3.1 inches in height. Their weight is around 0.39 to 0.49 ounces while their wingspan spreads to a brilliant 9.4 to 9.8 inches. Both the genders are distinctly different in colors. Males have very vibrant reddish orange undertones below a brown mask of feathers covering the body. As for the females, they are grey in color with white undertones and an astounding brush of amber shades running below. Males are distinguishedly different but the females are often confused with the Say’s phoebe. Migration is vital for the Vermilion Flycatcher as it has helped in expanding their population. However, there is one interesting fact about their migration pattern based on geography. The Southern birds are the ones that migrate to the North while the Northern birds are quite reluctant about migrating making them non-migratory for good. The migration season starts in early March and helps them move to the warmer regions. The Vermilion Flycatcher is usually found in solitude. During the winter season, however, some are gathered around in flocks but not more than five altogether. Their diet usually includes insects . Some of them are honeybees, butterflies , grasshoppers , beetles , and crickets . They are strictly insectivores in nature. They eat a variety of insects, ranging from the big ones like butterflies and grasshoppers to the small ones like crickets and beetles. The indigestible parts of their diet come out of their mouths in the form of pellets. They are perched in high places to get a better bird’s eye view of their surroundings. Once they spot an insect, they swoop in and bring the insect back to their perching site. They might even come down to the ground if there is sweet prey lurking around them. After bringing back their prey, they kill them before they eat them up. The Vermilion Flycatcher does not face any current threats to its population size. It belongs to the Least Concern category in its conservation status. Its population is currently increasing and is because of its migration pattern. The most common predator, especially in Galapagos, are rats . They do not just eat their eggs but also their young. Urbanization is a big threat to the population of the Vermilion Flycatcher. Because of deforestation, they do not have many homes where they can reside. Similarly, the overuse of pesticides has caused the insects to die which opens up a survival case for the Vermilion Flycatcher. The mating is due to a little performance by the male. They go up high in the sky to flash their dance “routines” along with a little singing that eventually enables mating. The males form a puffy chest and engage in a fluttery fight. The Vermilion Flycatcher does not stay with one partner in their lives. The males engage with other females through their mating rituals while the females fly away and lay eggs in other Vermilion Flycatchers’ nests. But this is true for only a small amount of the total population since there is only 11% of the babies have come out this way. The female begins building the nest and keeps on tweaking it to her liking. She lays 2 to 4 eggs which are white in color with dark spots on them. After an incubation period of 2 weeks, the hatchlings emerge known as chicks. They are underdeveloped babies which are fed by both parents. But because of brood parasitism, the young are often left to be tended with care by other birds. After 15 days, the chicks are ready to leave the nest and after two years, they can mate. As for the molting, it begins after migration season, in July, and may last up to September. The broken feathers are replaced by this process which may take up to 79 days. But many birds complete it within 62 days as well. The reason for slow molting is that the quick process may create underdeveloped feathers, causing trouble during flight. The population size of the Vermilion Flycatcher is around 5,000,000 to 50,000,000 individuals. They are also considered in the Least Concern category of Endangered Species. This high number is mainly because they migrate quite often. In addition, their population size is increasing even though there is a danger to their survival if urbanization and overuse of pesticides keep increasing every day. Have a look at a few of our other bird articles.",
        "score": 0.80159914
    },
    {
        "Name": "Insects",
        "score": 0.8014102
    },
    {
        "Name": "Yellowthroat",
        "Genus": "Geothlypis",
        "Diet": "Insectivore that eats grasshoppers, dragonflies, mayflies, beetles, spiders, ants and especially likes insects",
        "Behavior": "They can be characterized as mainly solitary.",
        "Features": "Black face masks",
        "Fun_Fact": "They forage near the ground, searching leaves for insects",
        "Text": "“Yellowthroats are curious birds attracted to repetitive noises.” The yellowthroat is a common songbird from the wood-warbler family. They have an extensive range across two continents and over 40 countries. These birds inhabit marshes and wetlands in open spaces, where they stay low to the ground to avoid predators and to search for food. Look for their yellow-olive color in the dense vegetation and listen for their loud, fast calls. Learn everything there is to know about them, including where they live, what they eat, and how they behave. The yellowthroat lives in over 40 countries across North and South America, including Canada, the United States, Mexico, the Bahamas, and Costa Rica . Many species are year-round residents in their Central American and South American homes. In contrast, others breed in the northern parts of North America (Canada and the United States) before heading south to Mexico, Central, and South America for the winter. They mostly live in marshes and other wetlands with low, dense greenery. Some live in prairies, pine forests, thickets, orchards, fields, river edges, and disturbed areas. To find these birds, look in bushes of open spaces and find their yellow-green coloring among the plants. Females select their nesting site on the ground in low plant life like grasses, reeds, cattails, and sedges. Once she chooses the perfect hiding area, it takes her four to five days to build. She weaves a loose cup of leaves and grasses and lines the inside with grass, bark fiber, and animal hair. The yellowthroat ( Geothlypis) are New World warblers endemic to the Americas. They are from the Parulidae family, which includes small, colorful passerine birds or “wood-warblers.” This genus contains 12 species: Yellowthroats are small, chunky songbirds with round heads, thick necks, and medium-sized tails. They measure between four and five inches and weigh 0.3 ounces, with a five to eight-inch wingspan. Adult males are a yellow-olive color with black face masks. Females lack face masks and feature an olive-brown color. This species spends most of its time staying low to the ground in dense vegetation, looking for food. Their calls are loud and fast, sounding similar to “witchity-witchity-witchity.” These birds are mostly loners but will forage in mixed flocks sometimes. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Yellowthroat species in more southern regions, like Mexico, Central, and South America, are typically year-round residents in their environments. Several species, like the common yellowthroat, are long-distance migrants. They spend their springs and summer (breeding season) in Southern Canada and much of the United States. They migrate to Mexico, Central America, and the Bahamas during winter, but some common yellowthroats in the Southern United States are year-round residents. They are mostly insectivores but may sometimes eat seeds. Most eat grasshoppers, dragonflies , mayflies, beetles, spiders, ants, termites, bees, wasps, caterpillars, moths, aphids, butterflies, and larvae. They mostly forage near the ground, picking insects off leaves, bark, flowers, and branches. The IUCN lists nine out of 12 species as LC or “least concern.” Because of their range and large populations at the present time, they do not qualify for “threatened” status. The Altamira yellowthroat is listed as NT or “near-threatened,” and the black-polled and Belding’s yellowthroats are V or “vulnerable.” Their greatest threats include wildfires, reed cutting for tourism, house construction, drainage for farming, and hurricanes. Adults can fall victim to predatory birds like hawks, eagles, owls, northern harriers , and merlins. They also experience nest predation, especially from snakes, raccoons , and turtles, as well as possums, mice, chipmunks, and skunks. Males will defend their area from other males, and females defend against other females. During mating, males flick their wings and tails, perform flight displays, sing, and follow the female around until she agrees to mate. The male is mostly faithful, but the female sometimes mates with others behind his back. They lay between two and six eggs, and females warm them for around 12 days. Males help by bringing feed and feeding the nestlings. They leave the nest around eight to twelve days after they hatch but rely on their parents for some time. Most species reach their sexual peak by year one and can live up to 11 years in the wild. The global population of all yellowthroat species is unknown; however, the common yellowthroat alone has over 77 million mature individuals in their range. Seven out of 12 species are experiencing a drop in numbers, three are stable, and two have growing populations. The black-polled and Belding’s yellowthroats have the most significant population drop, most likely from habitat loss.",
        "score": 0.79593456
    },
    {
        "Name": "Hepatic Tanager Red Tanager",
        "Genus": "Piranga",
        "Diet": "Insectivore that eats mainly insects and spiders, including caterpillars, moths, bees, and ants",
        "Behavior": "They can be characterized as social family units.",
        "Features": "Bright coloring",
        "Fun_Fact": "Parents and their young sing sweetly to each other",
        "Text": "They sing sweet whistling songs to each other. If you ever find yourself hiking through pine forests in the Southwestern mountains, listen for the pleasant whistling melodies of the hepatic tanager. While their bright red and yellow colors don’t offer much camouflage, they like to feed in the trees’ interior, making them difficult to spot. Researchers don’t know much about this species, making spotting one in the wild more exciting. Learn everything there is to know about the unstudied hepatic tanager! The hepatic tanager lives in over 20 countries, including the United States , Brazil , Costa Rica , Ecuador , and Mexico . It has an extensive range in South America , primarily the eastern portion of the continent, where it lives year-round. These birds also inhabit areas of Central America and Mexico all year. The northern hepatic tanager species live in the Southwestern United States during the breeding season before migrating to Mexico for the colder months. In the United States, these tanagers breed in pine woodlands at high elevations. During migration, they will inhabit similar pine-oak habitats but at lower elevations. They live in many environments south of the US border, including desert oases, mountain forests, arid lowlands, and farmsteads. Look for these tanagers in the Arizona and New Mexico mountains during spring and summer, and listen for their sweet melodies, often shared between pairs and their young. You will find their nest approximately 30 feet above the ground in a tree fork near the end of a branch, most likely on a pine or oak tree . The nest itself is a wide, flat cup made of grass, twigs, and other plant matter. The females line the inside with soft materials like moss, animal hair, flowers, and grasses. The hepatic tanager’s scientific name is Piranga Flava. Its common name hepatic means “liver-colored,” referring to its reddish-brown coloring. Its scientific name , Flava , means “yellow” or “golden” in Latin. Hepatic tanager has three subspecies: Hepatica, Lutea, and Flava. Hepatic tanagers are stocky, medium-sized birds with short tails, stout bills, long tails, and long wings. These solid birds are between 3.5 and 7.9 inches long, weigh 0.8 to 1.7 ounces, and have a wingspan of 12.6 inches. The northern group tends to be larger than their southern counterparts, but both are larger than a sparrow and smaller than a robin . Adult males are a brick-red color with gray edging and ear tufts. The females are olive and yellow with grayish ear tufts, and the juveniles are gray and olive with light streaks. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Males establish territories in the spring and defend them with their inquisitive whistles. Most mating partners stay together after breeding, often forming family groups. They may also join other small groups. Their average lifespan is five years. Hepatic tanagers are short-distance migrants in the northern parts of its range in the United States. It lives year-round in its environments in Central and South America. Those that stay in the Southwestern United States during the breeding season will move further south down to Mexico during the winter. Hepatic tanagers are primarily insectivores who feed in groups. These birds eat mainly insects and spiders, including caterpillars , moths , bees , ants , grasshoppers , butterflies , and beetles . The hepatic tanager also eats berries, seeds, flowers, and nectar. It forages in trees and bushes, hopping along branches methodically until it finds hidden insects . It may even briefly pursue its prey mid-flight if it tries to escape. This species also feeds together in groups or pairs. The IUCN lists the hepatic tanager as “least concern.” Their population continues to increase over an extensive range and does not qualify for “threatened” status. But that doesn’t mean this species may not suffer from future threats. As warming increases, these birds are susceptible to habitat and resource losses from droughts and wildfires. Spring heat waves can also damage the young in their nests. Adult tanagers are a food source for birds of prey like owls and falcons . Their eggs and nestlings often fall victim to smaller birds like blue jays , grackles, and crows . Other animals like squirrels , chipmunks , and snakes may also steal babies from their nests. Not much is known about how they defend their young. Tanagers are mainly known for their singing duels and are not relatively aggressive. However, researchers have witnessed males and females scolding, posturing, and chasing intruders. Females primarily build the nests, occasionally accompanied by the males who assist in carrying building materials. Little is known about their courtship displays, except that the males bring the females food during courting and incubation. Females lay three to five bluish-green eggs with brown spots, and both sexes provide incubation and feedings to nestlings. Not much else has been discovered about their reproduction process, including incubation length and when the chicks fledge the nest. Hepatic tanagers are sexually mature at one year of age. The number of mature individuals in their population is unknown, but researchers classify them as a common species. From 1970 to 2014, their population increased by 124%, and within the last three generations, they have increased by 24%. However, these surveys covered less than 50% of the global population. Much of their southern territories in Central and South America are unstudied.",
        "score": 0.7927586
    },
    {
        "Name": "Dubia Cockroach",
        "Genus": "Blaptica",
        "Diet": "Omnivore that eats fruit, vegetables, and grains",
        "Behavior": "They usually live in colonies.",
        "Features": "Light brown bodies with dark brown spots",
        "Fun_Fact": "The most popular species of feeder roach",
        "Text": "“Dubia roaches are the most popular choice for exotic pet owners looking to feed their lizards, snakes, and toads.” Among all species of cockroach , dubia roaches may be the easiest to take care of. Unlike the stereotypical pest species, like American , German, and Oriental cockroaches, dubia roaches don’t generally invade homes. Instead, they come to colder climates via the trade in exotic pet food. Cockroaches may be the quintessential ‘problem’ bug—a roach infestation can be a nightmare for home and business owners. But, roaches haven’t always been a threat to humans. In fact, they’ve been around far longer than we have. The earliest cockroaches (which look pretty similar to the roaches running around today) lived during the early Carboniferous period over 300 million years ago. Today, there are over 4,500 species of cockroach living on every continent. Thanks to human settlement, cockroaches can even be found on Antarctica. Out of all those roaches, less than 50 species invade our homes and spread dangerous diseases and pathogens . Let’s take a look at why you shouldn’t be too worried about dubia roaches infesting your home—provided no exotic pet owners release their supply of feeder dubias. In scientific terms, the dubia roach is known as Blaptica dubia . They’re a tropical species of cockroach originally native to South and Central America. In the wild, they eat mostly leaves and fruit on the forest floor. Dubia cockroaches make their home in tropical and subtropical forests—they need plenty of heat and humidity to thrive. Unlike other roaches, like the smokybrown cockroach , dubias can tolerate a low humidity environment. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Dubia roaches have the same basic form as all cockroaches; they have six legs and two antennae. The body is divided into the head, thorax, and abdomen, with the abdomen being the largest body segment. They may look like many other species of roach, but there are a few key differences that make the dubia cockroach distinct. First, their antennae are relatively short for a cockroach. Males have slightly longer antennae than females, but, regardless of sex, the antennae of the dubia are less than half the length of the body. Another important difference between dubias and other species of roach is in the legs. Most cockroaches have structures in their feet called arolium that allow them to climb smooth surfaces, but not dubias. Their inability to climb vertical surfaces is a big part of the reason they’ve become such popular feeder roaches for exotic pet owners. Perhaps the most striking aspect of the dubia roach’s appearance comes from the spots it sports in its nymph phase. Juvenile dubia roaches are light brown with tan spots running in lines up and down their entire bodies. As adults, only the males have visible spotting, though their markings are often obscured by their wings. Females are very dark brown, with three lines of tan spots running from the front of the abdomen to the back. In normal circumstances, dubia roach egg cases and eggs are never visible to humans. Dubias are an ovoviviparous species of roach, meaning they develop as eggs contained in egg cases inside the mother . The eggs actually hatch in the female’s womb; she then gives birth to between 20-40 live larvae . At birth, the larval dubia roaches are translucent white with soft exoskeletons. They’ve just entered their second life stage: nymph —the growing stage. Nymphs molt, or, shed and regrow their exoskeleton, as they grow. They do this until they’ve reached full adult size—up to 1 ¾ inch long. Once they reach full size, they don’t molt anymore. Adult dubia roaches may live up to two years in captivity. Males have body length wings, though instances of actual flight are rarely seen. Females, on the other hand, have short, vestigial wings that offer no possibility for flight whatsoever. In the wild, dubia roaches inhabit the lush, tropical forests of South and Central America. They’re ground dwellers who only come out at night, so if you’re keen on finding one, bring a flashlight. If you really want to see a dubia roach, you can just order one from one of the many dubia roach breeders scattered throughout the United States. Dubia roaches can be imported into most states—but be sure to check your own state’s guidelines before purchasing. Certain states regulate the importation of insects due to concerns about introducing new invasive species. Alternatively, pet stores specializing in exotic pets usually have dubia roaches in stock. Like all cockroaches, dubias are omnivores. They primarily eat rotting fruits, leaves, and plant matter, but won’t say no to other kinds of food. Captive dubias can eat just about anything, though most experts recommend that at least part of their diet comes from fresh fruits and vegetables. The best part about feeding a dubia? They don’t care if the fruit is a little overripe, or if the vegetable is past its time—they still love it. Other options for feeding your colony of dubia roaches include both dry and wet pet food, like kibble or canned food. When it comes to cockroach nutrition, the most important thing to remember is that they need at least one source of moisture—whether it comes from their food, or from a water dish. In the wild, dubia cockroaches avoid many predators with their nocturnal nature. However, creatures like small mammals, amphibians, reptiles, and even other insects still prey on them. But, the bigger question may be: what pets eat dubia roaches? The answer is: lots. All pet reptiles eat roaches, and because dubias can be purchased in any size, there is no size limitation for reptiles. Even the smallest gecko can snack on a dubia nymph. Reptiles aren’t the only exotic pets that eat dubias—they also make a great meal for amphibians, fish, birds, and invertebrates. Tarantulas, scorpions , spiders, frogs , salamanders , and newts all eat dubia roaches. Dubia roaches look very similar to discoid roaches. These cockroaches are native to Central America; they’re known as false death’s head roaches. Like dubia roaches, they have a flattened egg shape and short antennae. However, the discoid cockroach has a very distinct black spot resembling a skull on the back of its head. Dubia roaches don’t have this marking. If you have an exotic pet or two to feed, and you’re tired of purchasing dubia roaches, then you may want to try breeding your own. The most important requirements in roach care are the temperature and humidity of the roach enclosure. Dubia cockroaches are a good species to start with, as they can’t climb tank walls or fly to escape. Once you have the enclosure set up, provide some basic substrate and a water source. Then, feed your roaches at regular intervals. If you’ve done everything correctly, you should have baby dubias in no time.",
        "score": 0.79186094
    },
    {
        "Name": "Acadian Flycatcher",
        "Genus": "Empidonax",
        "Diet": "Insectivore that eats wasps, bees, caterpillars, ants, flies, beetles, moths, spiders, and millipedes and especially likes insects",
        "Behavior": "They usually live in pairs and can be characterized as solitary.",
        "Features": "Olive green coloring with white wingbars",
        "Fun_Fact": "Their nests are sloppily held together and have an abandoned appearance",
        "Text": "“ Search for these birds in the mid-story of tall trees and look for quick movements as they sally out to catch insects. ” The Acadian flycatcher ( Empidonax virescens) is a small passerine bird native to North and South America, where they inhabit wet riverside forests. They spend their days swiftly maneuvering through trees as they search for insects and small fruit. These solitary birds sing their songs early in the morning and defend their riverside nests with a monogamous partner. Discover all the fascinating Acadian flycatcher facts, including where they live, what they eat, and how they behave. Acadian flycatchers live in North and South America in over 15 countries, including the United States, Mexico, Venezuela, Colombia, and the Bahamas. Their range includes Southwestern Ontario and the Southeastern United States during spring and summer. They migrate through Mexico and Central America before reaching their wintering grounds in Northwestern South America. They breed in wet deciduous forests, such as swamps and dense riverside woods, and live in woodlands in their tropical winter homes. Search for these birds in the mid-story of tall trees and look for quick movements as they sally out to catch insects. They nest in tall trees or large shrubs in horizontal forks away from the trunk. Females form a loose cup made from weed stems, twigs, and grass and lined with plant down. They may use spider webs to hold the material together, but the nest often has a sloppy appearance making it look abandoned. The Acadian flycatcher (Empidonax virescens) belongs to the Passeriformes order in the Tyrannidae family, which encompasses the tyrant flycatchers with over 400 species. The Empidonax genus includes small flycatchers, and the name is Ancient Greek for “gnat” and “master.” They were discovered in Acadia (present-day Nova Scotia), but they do not inhabit this area today. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Acadian flycatchers are small passerine birds, measuring 5.5 to 5.9 inches long and weighing 0.4 to 0.5 ounces, with an 8.7 to 9.1-inch wingspan. They have long tails, broad bills, large heads, and long wings. Adults are olive-green above and whitish below, with dark wings and white wingbars. Their bills are dark above and orange-yellow below. These birds are mostly solitary, except during breeding, when they form monogamous pairs and nest near other flycatchers. They typically spend their time perched in the mid-canopy of their forest habitat, sallying out to catch insects and returning to their perch. They sing their songs early in the morning, an emphatic two-note “peet-seet!” The Acadian flycatcher is fun to watch as he quickly maneuvers through trees, using rapid wingbeats to take direct flights. Their exact speed is unknown. Acadian flycatchers are long-distance migrants who begin their spring migration in early March and their fall migration in mid-September. They breed in the southeastern portion of the United States, from South Dakota down to Texas and east through New York and Florida. During migration, they travel along the Gulf Coast down to Mexico and through Central America before reaching their wintering grounds in Northern South America (Colombia and Venezuela). Acadian flycatchers are primarily insectivores who forage by watching from a perch. Their diet consists of wasps , bees, caterpillars, ants, flies, beetles, moths, spiders, and millipedes. They also supplement their diet with some small fruits and berries. They select a perch from the mid-canopy, where they sit and watch before flying out to catch insects mid-air. This flycatcher will also snatch bugs from foliage while they hover. The IUCN lists the Acadian flycatcher as LC or “least concern.” Due to its extensive range and extremely large, stable population, this species does not meet the “threatened” status thresholds. Their biggest threats include habitat loss and degradation from forest clearing as a result of agricultural and urban developments. They also face future climate threats, like spring heat waves, which can endanger nestlings. Their predators include crows, hawks, owls, jays, cuckoos, domestic cats, rat snakes, squirrels, chipmunks, and mice. Their young are more likely to fall prey, but parents build their nests in trees hanging over bodies of water because they are easier to defend. Males give rapid alarm calls to warn of intruders and may become aggressive if necessary. Their breeding season falls between April and August, and they form monogamous long-term pair bonds, where they mate with one partner for many years. However, some males have been observed practicing polygamy and will mate with several females. Females lay two to four creamy white eggs and incubate them for 13 to 15 days. Their young fledge the nest when they can fly, around two weeks after hatching. The father feeds the fledglings while the mother begins incubating the second batch of eggs. They reach sexual maturity around one year and live an average of three years, but they can live up to 12. The global Acadian flycatcher population is estimated to number 5.2 million mature individuals. The species declined slowly from the 1970s to 2017, but recent trends suggest their numbers are stabilizing and possibly increasing slightly.",
        "score": 0.79140913
    },
    {
        "Name": "Grasshopper Mouse",
        "Genus": "Onychomys",
        "Diet": "Carnivore that eats scorpions, insects, grasshoppers, crickets, and kangaroo rats",
        "Behavior": "They can be characterized as mainly solitary.",
        "Features": "Furry bodies and sometimes fat tails",
        "Fun_Fact": "The grasshopper mice attack predators using the poison of their venom.",
        "Text": "Grasshopper mice are rodents with big ears and big eyes. They are nocturnal and are closely related to deer mice. They are small and are usually only 120-190 mm in length. Adult grasshopper mice weigh about 20 to 50 grams. They got this name because they are not timid as mice usually are and are known to be ferocious. They are carnivores and feed on other living creatures. There are 3 types of grasshopper mice – southern grasshopper mice, northern grasshopper mice, and Mearn’s grasshopper mice. These rodents make howling sounds just before they are about to kill their prey. Here are some interesting facts about these mice: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Evidence of their lineage can be traced in the geological records of North America as far back as the early Pliocene Epoch, which occurred approximately 5.3 to 3.6 million years ago, and their closest living relatives are deer mice. The distribution of the Northern Grasshopper Mouse (Onychomys leucogaster) spans from south-central Canada through the western and Great Plains states, extending into northern Mexico, with its range reaching the far northeastern periphery in western Minnesota within the Prairie Parkland Province. In a captivating example of an evolutionary arms race, the grasshopper mouse has developed a unique adaptation that not only neutralizes the typically painful venom of its primary prey, the scorpion but also generates a pain-relieving effect, effectively turning the scorpion’s venom into an advantage. These mice go by the scientific name Onychomys . They belong to the kingdom Animalia. The phylum is Chordata and the class is Mammalia and the order is Rodentia and the family Cricetidae and the subfamily is Neotominae. Their tribe is called Reithrodontomyini and the genus is also called Onychomys . Onychomys is a combination of the Latin words onych- and -mys. “Onych” is a combination of words to mean a fingernail or toenail, while the suffix “mys” literally means “mouse.” These mice have a silky and dense coats. Their belly is often white, offering a stark contrast to the rest of their coat (which is greyish-brown to reddish-brown). Usually endemic to Mexico and the United States of America , the southern grasshopper mice have a size of about 3.5 to 5 inches while the tail is about 1.0 to 2.5 inches long. Meanwhile, the Mearn’s grasshopper mice are small in size but have a fat tails. Their tails make up more than 1/3rd of the entire mouse. In Southern grasshopper mice, females tend to be heavier as well as larger than their male counterparts. Their brain sizes also differ. The brain size of a grasshopper mouse depends on the food preferences that the mouse has. It is believed that the brains of folivores are the smallest, while the brains of granivores and insectivores are somewhat larger, and that the brains of generalists are the largest. These mice are nocturnal creatures. Some of them are extremely aggressive predators, intelligently going after their prey without mercy. To communicate with others, they have 6 different vocalization types. Their communication kind and frequency depend from species to species and are distinguishable between sex and age. It is said that the larger grasshopper mice tend to have a deeper voice. If and when the mouse feels attacked, it will let out a loud screech voice or a bark. These rodents tend to be active all year round and are often good climbers. These mice have for years coevolved and coexisted with the bark scorpions . The bark scorpion paralyzes other animals by injecting venom through their spikes into the other animal’s bodies. Over time, the grasshopper mice have been able to develop a certain level of pain tolerance so that the venom of the scorpions does not affect them as much now. These mice make a howling sound right before they are about to kill their prey. This sound usually pierces through quiet nights. They can also make this sound when they spot another like them but they often howl just before they kill their prey. The Southern grasshopper mice are prone to indulge in cannibalism acts as they can often kill and eat the members of their species if the food is scarce. Usually, they are solitary animals, but they’ll stay with a partner when they need to breed and have a new litter. They can reproduce all year but it is more likely to happen during some months. Sometimes, one of the partners also kills the other. The northern grasshopper mice live in grasslands and shrub steppes all along with Central Canada southward through the Great Plains and Great Basin to northern Mexico . Meanwhile, the southern grasshopper mice are found all along southern California, Nevada, and Utah southward to northeastern Mexico. Some of these mice are found living in shortgrass prairies and desert scrubs. They often prefer areas with low elevations and have a range of about 2 to 3 hectares. They are found to exist in low densities often. These mice might be small in size but most of them are very aggressive predators. They are also very sophisticated predators and often bite off their prey at their heads. Their diet usually consists of insects , beetles , grasshoppers , crickets, and scorpions . However, their diets are not limited to only these creatures. They also stalk as well as kill and eat other small rodents such as Kangaroo rats , voles as well as white-footed mice. The southern grasshopper mice will kill each other if the food is scarce. They usually live in pairs, though one of the partners can end up killing the other as food in times of extreme hunger. They do indulge in acts of cannibalism. These mice, despite their small size, do not have too many predators. Owls and other nocturnal birds of prey usually feed on these rodents. Even snakes , centipedes , and scorpions also do not consume these mice as they are often known to be prone to venom and are difficult to catch hold of. However, human activities do have an impact on the habitat of the mice. Other potential threats include urbanization and industrialization by humans. In the wild, these mice may live only for a few weeks to a few months. These deceptively cute rodents with a penchant for aggression are rather fond of taking on prey that would make other predators’ hearts quail. Centipedes , bark scorpions , and snakes which have a reputation for attacking and defending themselves with venom are a regular fixture on these diminutive mammals’ menu. How do they avoid those poisonous jabs and avoid ending up as dinner in some cases? The key lies in their resistance to venom and their agility. Scientists have discovered that the nerve which detects pain in grasshopper mice does not transmit any alarm signals in the event of the rodents being stung by bark scorpions. This, they assert, is due to the ability of the mammals to switch off their pain pathways following a sting. Munching on a centipede is merely a simple matter of nimbly avoiding those venomous fangs and darting in for a bite of chitinous exoskeleton until the arthropod is overcome. These mice are capable of reproducing all around the year. However, in the northern grasshopper mice, reproduction happens usually between May and October. The males and females come in close proximity of about 10 to 15 centimeters of each other and begin to smell the anal area of the other sex. The male then follows the female until he mounts her from the rear into a copulatory lock. This process occurs in 10 phases and usually takes about 3 to 4 hours to complete. Each phase is completed once the female moves away and grooms herself. The female usually gives birth to 4 babies and usually cares for them until they are about 14 days old. The males do not contribute to caring for the babies. The females give birth to several litters per year. The gestation period in southern grasshopper mice lasts for about 26 to 35 days. The females that are born in April might be ready for reproduction early and could produce 2 to 3 litters of babies before the year ends. Their litter size could be 2 to 6 babies. The babies open their eyes at 2 weeks of age. Once they reach sexual maturity, females seldom breed after 2 years. While the exact population numbers are difficult to procure when it comes to these mice, it is a well-known fact that there are 3 different types of this particular rodent. So, it is expected that there are enough of these mice around the world. There is also no threat to their population and they do fall into the least concern category.",
        "score": 0.78787506
    },
    {
        "Name": "Willow Flycatcher",
        "Genus": "Empidonax",
        "Diet": "Insectivore that eats insects and spiders and especially likes bees, wasps, ants, flies, beetles, caterpillars",
        "Behavior": "They usually live in pairs.",
        "Features": "Wheezy song",
        "Fun_Fact": "These birds live in the understory and are named for their propensity for flitting between willows and shrubs.",
        "Text": "Their songs are hoarse and last around one second. It may sound like someone zipping up a coat or a wheezy “fitz-bew.” The willow flycatcher ( Empidonax traillii) is a small and slender, insect-eating passerine. They are native to North and South America , where they inhabit wet meadows filled with willows and other shrubs near water. They spend their days perched in bushes, sallying out to catch insects mid-air or hovering over leaves. This bird sings a tune perfectly unique to its species and even varies based on subspecies. Discover everything there is to know about the willow flycatcher, including where they live, what they eat, and how they behave. Willow flycatchers live in willows or other shrubs near water. But their exact habitat varies by subspecies. Those in the Northwest may utilize drier scrubby areas, while in the Southwest, you can find them in river islands and scrubby fields. They are more lenient with their wintering grounds and can inhabit pastures, woodland edges, and clearings. They are most abundant on their breeding grounds from late May to June, where they are likely to be perched on willows singing their unique tune. Females pick a nesting spot in a deciduous shrub or tree, typically a willow, and place it two to five feet above the earth in a fork of a branch. The female weaves an open cup using grass, bark strips, and plant fiber, and lines the insides with horsehair, grass, plant down, and other soft material. The nest is three inches across and three inches tall, taking around five to ten days to complete during the first breeding season. This species returns to the same nesting site yearly and uses the nest from the previous year to build another. Willow flycatchers ( Empidonax traillii) belong to the Tyrannidae family, which encompasses the tyrant flycatchers, covering 400 species of New World passerines. The Empidonax genus is a group of small, insect-eating flycatchers. The name in Ancient Green means “gnat master.” There are four recognized subspecies of willow flycatcher separated by location: See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The willow flycatcher is small and slender, weighing 0.4 to 0.6 ounces and measuring 5.2 to 6 inches long, with a 7.5 to 9.4-inch wingspan. Despite their relatively tiny size, they are actually one of the largest in their genus. They have fairly long wings and a long, thin tail, and they have straight, broad bills for catching insects. Males and females appear very similar in appearance. They are brown olive above and white below with a slight yellow wash. Their wings are darker with white and buff streakings. This species also has a very thin white eyering. These birds live in the understory and are named for their propensity for flitting between willows and shrubs. They perch on the edge of willows and fly out to catch their prey. The flycatcher’s song is the easiest way to identify their species. Male willow flycatchers typically do most of the singing. Although, females can also sing, but are usually quieter. Their songs are hoarse and last around one second. It may sound like someone zipping up a coat or a wheezy “fitz-bew.” Willow flycatchers are long-distance migrants. They breed in Southern Canada and throughout most of the United States , except the Southeast. They migrate through Northern Mexico before reaching their wintering grounds in Southern Mexico, Central America, and Northern South America. Willow flycatchers are mainly insectivorous and use perches to catch their prey. Their diet consists primarily of insects, including bees, wasps , winged ants, damselflies, beetles, caterpillars, moths, butterflies, true bugs, and many more. They also eat spiders , seeds, and berries on occasion. Their berry diet includes raspberries, blackberries, currants, and dogwood. This species hunts by perching in low trees and tall shrubs, sallying out to catch insects mid-air. They may also hover over leaves and other foliage to carefully pluck their prey. The IUCN lists the willow flycatcher as LC or “least concern.” Due to its wide range and extremely large population, this species does not meet the qualifications for “threatened” status. These birds are common within their range, but they have undergone a moderate decline since 1970. This species faces threats from habitat loss, habitat degradation, overgrazing, and parasitism from the brown-headed cowbird . Willow flycatchers have several natural predators, including snakes, voles, ravens, hawks, owls, and weasels . King snakes and milk snakes are known for stealing flycatcher eggs, and other species, like great horned owls, long-tailed weasels, and cooper’s hawks , will eat their nestlings. These flycatchers may give chase to intruders, including the brown-headed cowbird, which lays its eggs in flycatcher nests . The courtship behavior of the willow flycatcher is not well-known. However, it likely involves males chasing females and singing. These birds are primarily monogamous, often repairing with the same mate each breeding season. Females lay three to four buff to white eggs with brown spots. And she incubates them alone for 12 to 15 days. Once hatched, both parents bring food and feed the nestlings. Nestlings have their eyes close and are naked with patches of down on their heads and spines. Their young take their first flight between 12 and 14 days old. They undergo their first pre-basic molt before leaving the breeding grounds. The willow flycatcher lives an average of two to three years, but they are known for living up to 11 years. The global willow flycatcher population is estimated to number 8.1 million mature individuals. While their population is not severely fragmented, they are experiencing a continuing decline. This species has been moderately declining at an average rate of 12% over ten years. Due to its vast population size, the decline is not rapid enough to approach a vulnerable status.",
        "score": 0.7852216
    },
    {
        "Name": "Dragonfly",
        "Diet": "Carnivore that enjoys mosquitoes and especially likes fly, bee",
        "Fun_Fact": "It's larvae are carnivorous!",
        "Text": "Dragonflies eat mosquitoes, gnats, and cicadas making them an important part of the ecosystem . These amazing insects also serve as a food source for a variety of fish and birds . They are found on every continent with the exception of Antarctica . Wooded areas as well as freshwater lakes, ponds, marshes, and streams are all habitats of the dragonfly. Anisoptera is the scientific name of these insects. While Anisoptera is its family, the dragonfly belongs to the order classification of Odonata. The word Odonata is Greek meaning ‘toothed one.’ This refers to the jaws of this insect . There are around 7,000 species of true dragonflies . These insects are closely related to the damselfly though damselflies have the suborder classification of Zygoptera. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . These insects live everywhere on the globe except for Antarctica . They live in warm climates and near bodies of water including lakes, ponds, marshes, and streams. Adults are easily recognizable by their narrow, needle-like bodies and two pairs of slender, colorful wings. There are 14 types including: Dragonflies are an ancient species of insects that have existed for over 300 million years. They belong to the order Odonata, which also includes damselflies. The earliest dragonflies were much larger than the dragonflies we see today, with some species having wingspans of over two feet. Dragonflies have undergone little evolutionary change over the past 300 million years, as they have already evolved to be perfectly adapted to their environment. Their long, slender bodies, large wings, and powerful flight muscles have allowed them to thrive in a variety of habitats, from freshwater streams to open skies. The evolutionary success of dragonflies can be attributed to their adaptability and versatility. They feed on a variety of prey, including mosquitoes, flies, and other insects, and their larvae can live in a variety of aquatic habitats, from still ponds to fast-flowing streams. This has allowed dragonflies to spread to almost every corner of the world, and to occupy a wide variety of ecological niches. The fossil record of dragonflies provides important insights into the evolution of insects and the ancient earth. It shows that dragonflies have been able to survive and thrive in a changing world and that they have been an important part of the food chain for millions of years. Furthermore, dragonflies are a fascinating and ancient species of insects that have adapted and evolved over millions of years to become the highly successful creatures we see today. They continue to play a crucial role in many ecosystems, serving as both predators and prey, and providing valuable insights into the evolution of life on earth. An adult measures from 1 to 5 inches long and weigh less than 1 ounce. They have 6 legs and 2 pairs of wings. The wingspan of the insect can measure up to 6 inches. This insect’s color depends on what type it is. They can be brown, blue, yellow, green, or red. Their wings have an iridescent or metallic appearance. The damselfly is the closest relative of the dragonfly. They are similar in appearance with two pairs of wings and brightly colored bodies. However, a notable difference is a dragonfly rests with its wings spread out while a damselfly rests with its wings pulled together. The largest type of dragonfly is the giant garner dragonfly . Its scientific name is Anax walsinghami . It’s 5 inches long with a 5-inch wingspan. These insects have a few adaptations they use to protect themselves from predators. For one, they can fly up to 35 mph! Also, they can change directions mid-air allowing them to escape some predators. Their eyes provide them with a 360-degree view of their environment. So, they’re likely to see a predator soon enough to make an escape. These insects are solitary. But, when they do form groups, they are called a flight or a cluster. Males can be aggressive when defending their territory from other males. These insects are found throughout the world except for Antarctica . Though they don’t live in people’s homes, some do live near people. These insects make their home around bodies of water including ponds, streams, lakes, and rivers. If a homeowner has a pond on their property, there are likely to be dragonflies in the area. Or, if a family lives near a large creek or river, they may see dragonflies moving through the area. These insects have a carnivorous diet. Specifically, they eat insects which have earned them the classification of an insectivore. Frogs , fish , birds , and large spiders are all predators of adult dragonflies. A dragonfly baby also called larvae or nymph is vulnerable to the same predators. These insects eat mosquitoes, gnats, and cicadas. An adult eats from thirty to over 100 mosquitoes each day. Some types of dragonflies hunt at night while others look for food during the day. Want to discover more about the diets of dragonflies? Check out our complete guide: ‘ What Do Dragonflies Eat .’",
        "score": 0.7827999
    },
    {
        "Name": "Bee Eater",
        "Genus": "Nyctyornis, Meropogon, Merops",
        "Diet": "Insectivore that eats insects, including flies, beetles, dragonflies, butterflies, and cicadas and enjoys honey bees and especially likes wasps",
        "Behavior": "They can be characterized as colony social.",
        "Features": "Long, curved bills",
        "Fun_Fact": "They roll around in dirt to prevent external parasites",
        "Text": "“ These birds are highly social, roosting together and breeding in colonies. ” The bee-eater (Meropidae) is a medium-sized non-passerine bird native to Africa, Asia, southern Europe, and Australia. They inhabit a wide range of habitats, from semi-open woodlands to tropical rainforests. They don’t require much more than a perch and a place to dig their burrow. These birds are highly social, often breeding and roosting in large colonies. Find out everything there is to know about this unique bird family, including where they live, what they eat, and how they behave. Bee-eaters live across four continents, including Africa , Asia, Europe, and Australia. Most species occur in Africa, but several species inhabit Asia, from India and southern China to the Indonesian islands. Additionally, Europe and Australia each have a single species. These birds don’t have strict habitat requirements; they only need an elevated perch from which to watch for prey and a place to dig their burrows. You can find them in semi-open woodlands, shrublands, forests, rainforests, and sub-deserts. Their habitats are typically near water because riverbanks make good nesting spots. Look for bee-eaters in flocks perched on branches or pruning and sunning themselves on the ground. Bee-eaters are cavity nesters who burrow directly into the soil of the ground or the side of cliffs. They nest in colonies, and there may be hundreds of cavities in one area. Males and females dig their burrows using their sharp bills to jab the sand until it loosens. Nest building can take 20 days to complete, and their bills may become blunted and shortened during this time. The bee-eater (Meropidae) is a family of non-passerine birds, encompassing three genera and at least 27 species. The name Meropidae, is derived from the ancient Greek word ( Merops) for “bee-eater.” The recognized species of the Meropidae family: Bee-eaters are medium-sized non-passerine birds, measuring 7 to 12 inches and weighing 0.5 to 3.0 ounces, with a 10- to 20-inch wingspan. They feature large heads, short necks, short legs, and bright plumage. Their wings may be either pointed or rounded, and those with longer wings are more migratory. Their bills are long and curved with a sharp point, which they use to snatch prey from the air. Most species are at least partially green, and many have black bars through their eyes. Males and females are similar in appearance, and juveniles look a lot like adults. Bee-eaters are diurnal, although some species may migrate at night depending on the conditions. These birds are highly social, roosting together and breeding in colonies. Their daily rituals include emerging from their nesting holes after dawn, pruning and sunning themselves, and dispersing to feed. Some species participate in social activities even outside of the nesting season. They are also quite vocal, producing simple-sounding notes. However, when studied, they appeared to be rather complex. They live in colonies of five to 200 burrows, which are composed of clans. Each clan consists of two to three pairs, their helpers (male offspring from the previous year), and their offspring. Bee-eaters are medium to long-distance migrants. European species that breed in southern Europe and Asia migrate south to winter in western and southern Africa. Australian bee-eaters are sedentary in the northern parts of their range, but populations in the southern part of the continent will migrate to New Guinea and Indonesia. Several species are intra-African migrants who travel south into rainforest regions during the winter. Bee-eaters are insectivores; they hunt by air. These birds eat a wide range of insects, including flies, beetles, dragonflies, butterflies, cicadas, termites, crickets, grasshoppers, and moths. Their main prey are wasps and bees, which make up close to 70% of their diet. They will eat a significant amount of honey bees when they are in abundance, especially if their nesting colony is located near an apiary. These birds are aerial hunters, and they perch on exposed branches close to the ground. Small prey is eaten whole, while larger items are taken back to their perch, beaten, and broken into pieces. They rub venomous insects on branches to remove their stingers and venom sacs before consuming them. The IUCN lists 30 out of 31 species as LC or “least concern.” Due to their extensive range and substantial population sizes, most of the species do not meet “threatened” status thresholds. However, the blue-mustached is NT or “near threatened.” Their population is moderately declining due to habitat loss from timber logging and agricultural encroachment. The primary threats to bee-eaters include habitat loss, degradation, and climate change. Adult bee-eaters are eaten by birds of prey, such as hawks, eagles , and owls. This species uses vocal communications to warn others of potential threats, and males will aggressively defend their nesting sites. Their nest is vulnerable to rodents, weasels, martens, and snakes. Bee-eaters are monogamous during a breeding season, and species that are sedentary in their range may keep the same partner for several seasons. Populations that migrate will often change mates every year. Their courtship displays involve calling while raising their throats and wing feathers. Females lay five white eggs, and both parents incubate them for around 20 days. The chicks are ready to leave the nest after 30 days and can reproduce around one year of age. Their average lifespan is three to six years. The global bee-eater population is unknown, but the European species alone accounts for over 25 million mature individuals. Eight species have decreasing populations, including the blue-mustached, little bee-eater, northern carmine, purple-bearded, red-bearded, southern carmine, black-headed, and blue-headed. The main reasons for population decline include habitat loss, overexploitation for food, and pesticide use.",
        "score": 0.7812853
    },
    {
        "Name": "Crab Eating Fox",
        "Genus": "Cerdocyon",
        "Diet": "Omnivore that eats crabs and other invertebrates; reptiles including lizards and tortoises; birds; fish; mammals, including rodents opossums and armadillos; eggs and enjoys food generalist with no strong preference; diet depends on availability and especially likes varies by",
        "Behavior": "They usually live in pairs pair and can be characterized as solitary family units solitary.Their aggression level is medium.",
        "Features": "Gray-brown fur, sometimes with tinges of red",
        "Fun_Fact": "The crab-eating fox is extremely adaptable, living in all sorts of habitats and eating almost any available food.",
        "Text": "The crab-eating fox is extremely adaptable, living in all sorts of habitats and eating almost any available food! Based on its name, you might think the crab-eating fox eats only crabs. That assumption would be wrong. This South American fox is actually one of the most adaptable canids. It is an omnivore, and quite the opportunist, eating whatever is most readily available at any given time throughout its range. In the rainy season, foxes living near muddy floodplains do indeed eat a lot of crabs. But during other seasons, or in other locations, they are much more likely to prey on mammals, reptiles, birds, fish, or other invertebrates. These gray-brown foxes with black markings are mostly active at night, and travel in monogamous pairs. Their population is considered stable, but their greatest threats come from human activity. Crab-eating foxes are native to South America. They inhabit much of Colombia and Venezuela, and parts of Ecuador, Guyana, and Suriname in the northern part of the continent. They are also found in Brazil, mainly along the coast and to the south of the Amazon basin. Their range extends west into Bolivia and Paraguay, and south throughout Uruguay and the northern part of Argentina. There is also some indication that these foxes may be found in French Guiana. The crab-eating fox is a highly adaptable species. These foxes make use of many types of habitats within their range, and they adapt well to disruptions in their habitat. They may be found in montane forests, along the coasts, in marshlands and in tropical and subtropical savannas. They also inhabit desert-like shrublands such as the Caatinga and the dry and mostly uninhabited Gran Chaco region. Areas of agricultural development and deforestation don’t seem to bother crab-eating foxes. They are found frequently around areas used for livestock or crops. They tend to move between elevations to avoid floods, moving to higher ground during the rainy seasons and returning to low-lying habitat during the dry seasons. Thanks to their highly varied diet, they are able to adapt to almost any sort of habitat within their range, and although they don’t seem to migrate seasonally, the species does seem to be expanding its range over time. The crab-eating fox is known by many names. It is sometimes called the forest fox, savanna fox, wood fox, bushdog, common zorro, common fox, or maikong . Its scientific name is Cerdocyon thous , which is derived from Greek words meaning fox and dog. It is the only living species in the Cerdocyon genus, named by Charles Hamilton Smith, a British soldier, spy and naturalist, in 1839. The crab-eating fox had previously been named Canis thous by Linnaeus in 1766. Today, there are five recognized subspecies of crab-eating foxes. There are differences in coat colors and size, and the various subspecies range over different parts of South America. The nominate subspecies, C. t. thous , lives in Venezuela, Guyana, Suriname, northern Brazil and perhaps French Guiana, although the recorded sightings in that country have not been confirmed. The other northernmost subspecies, C. t. aquilus , ranges through northern Venezuela and Colombia. The subspecies with the smallest range, C. t. germanus , lives only in the Bogotá region of Colombia. Meanwhile, C. t. azarae ranges in northern Brazil while C. t. entrerianus is found further south, in Brazil, Bolivia, Uruguay, Paraguay and Argentina. The crab-eating fox is similar in size and shape to more familiar foxes. It has a long, bushy, mostly black tail. Its large ears are pointy, but more rounded than many other canids. They are also tipped in black. Its snout is pointed, but a bit shorter than similar canids. Its legs are relatively short, compared to other members of the Canidae family, and the lower portions are black. Crab-eating foxes have a gray-brown coat with white undersides. Their coats vary from dark to lighter in shade, often tinged with red around the face, ears and upper legs. Except for the tail, their fur is short and coarse. These foxes average about 22 to 30 inches from nose to rump. Their tails add close to another foot to their length. They weigh between 10 and 18 pounds. This is very close to the size of the familiar red fox , Vulpes vulpes , found throughout much of the northern hemisphere and in Australia. The crab-eating fox is also virtually the same size as the pampas fox, Lycalopex gymnocercus , which shares much of its southern range. The pampas fox, however, is lighter in color, has a longer snout, and lacks the black tips on its ears and black legs. Crab-eating foxes are mostly nocturnal and crepuscular in nature. According to one study, they were most active in the early half of the night, before midnight, and again in the hours close to dawn. They appeared to share the same habitat with the similar pampas fox by dividing the hours of each day in shifts, with the pampas fox being more active in the late-night hours between about midnight and 4:00 am, and again during the daylight hours. Crab-eating foxes generally form monogamous pairs that inhabit a relatively small territory, smaller than five square miles. The pairs travel together over their territory, sometimes accompanied by their offspring, but they tend to hunt alone. They communicate through high pitched barks that can be heard over long distances. The territories of rivals may overlap, and if food is abundant interlopers may be tolerated. However, crab-eating foxes have been observed aggressively defending their territory against others, particularly during the dry season. These foxes spend most of the day resting. They usually find places to rest above ground, within dense cover if they are in the midst of raising a litter. They do not excavate their own burrows like some other foxes. However, they do sometimes utilize holes made by other animals, such as the armadillos that are common within their range. Contrary to the name of this species, the omnivorous crab-eating fox eats much more than just crabs. In fact, the diet of Cerdocyon thous is quite varied and these foxes tend to favor whatever food is most readily available. Grasses constitute a large portion of their diet, and according to research may be necessary to aid in their digestion of other foods. These foxes also frequently consume fruits, such as murici, mess apples, and gooseberries. They may be instrumental in dispersing the seeds of these plants within their range. In addition to vegetation, crab-eating foxes consume a wide variety of different animals and even insects, although these may be ingested accidentally when individuals eat infested fruits or carrion. Although the crab-eating fox does hunt for land crabs and other crustaceans in low-lying flood plains during the rainy season, crabs are not always the most significant part of their diet. These foxes are highly opportunistic feeders and will eat almost any type of small animal. They eat mammals, including rodents , opossums , and armadillos . They eat reptiles, including lizards , snakes and tortoises . Amphibians and fish often make the menu, as well as birds and their eggs. Invertebrates of all sorts, carrion, and even human garbage are regular parts of the crab-eating fox’s diet. Crab-eating foxes form monogamous pairs that live and travel together across a relatively small territory. In the wild, pairs have one litter per year, although they may have up to two litters per year in captivity. Their offspring are usually called cubs, but they may be referred to as kits or pups. These foxes have between two to six cubs per litter. The cubs are born after a gestation period of 56 days. Both parents care for the cubs together, bringing them whole prey after they reach about 16 to 20 days old. The cubs are weaned after about 90 days, but stay with the parents for many months after that, until they are between 18 and 24 months old. They may even return to live in the same vicinity as their parents if their presence is well tolerated. Adult crab-eating foxes have no common predators. Human activity is the greatest threat to these foxes, primarily through the introduction of diseases via domestic dogs. Dogs and crab-eating foxes frequent the same food sources, garbage dumps created by humans. At these feeding locations, dangerous introduced pathogens are spread to the wild foxes. Persecution by humans is another threat to crab-eating foxes who wander too near livestock. These foxes are known to take chickens, eggs, and possibly lambs, and humans often retaliate by killing the foxes. Although hunting of wildlife is illegal in many areas, and quotas exist in others to prevent overharvesting, limits and restrictions are often ignored. The IUCN Red List for Threatened Species lists the crab-eating fox as a species of least concern. Although the exact population is not known, based on surveys, researchers believe that the population is stable across its range. The lifespan of this fox in the wild is not known, but in captivity it has been recorded at 11.5 years. There are currently no conservation plans in place for the crab-eating fox, but its commercial trade and use is prohibited by law.",
        "score": 0.7763637
    },
    {
        "Name": "Assassin Bug",
        "Genus": "Reduvius",
        "Diet": "Carnivore that eats insects or blood",
        "Behavior": "They can be characterized as solitary.",
        "Features": "The long piercing beak or proboscis",
        "Fun_Fact": "The assassin bug is named for its quick strike ability.",
        "Text": "Assassin bugs are known for their impressive quick strike ability. The assassin bug is a large family that includes more than 7,000 species. The name comes from highly predatory and stealthy behavior. While they do have the ability to deliver a painful bite, most species are actually beneficial to people, because they consume crop pests, but a few of them are bloodsuckers that prey on humans. These blood-sucking bugs should be dealt with as soon as possible. The kissing bug is considered to be a specific type of assassin bug. They suck blood around the eyes or mouths of their victims. There are actually a few different species that can be called kissing bugs, many of which live in the Americas but some throughout the rest of the world as well. The scientific name is Reduviidae. This is derived from the Latin word reduvia, meaning hangnail or remnant. It may refer to the ridges or rings that project from the abdomen. There are dozens of different genera containing some 7,000 species, all with different appearances and behaviors. Together they belong to the order of “true bugs” (scientific name Hemiptera). The assassin bug comes in a huge variety of different shapes and colors, which can make identification difficult, but most species are generally characterized by a long, flat body, plus a pair of wings and slender legs, all separated from the head by a very narrow neck. The curved beak (also sometimes called a proboscis) is so long that it fits into a groove between the front legs. Some species come in all manner of bright colors, including red, orange, and green, but many are black or gray. They can range dramatically in size (for an insect, at least), from just 0.2 inches to 1.6 inches. The largest species in North America is the wheel bug, so-named because of the cog-like crests on the thorax. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Assassin bugs nymphs basically resemble wingless adults (nymph is the preferred term over larvae, which undergo metamorphosis instead). These nymphs grow progressively larger with each molt, also known as an instar. After a certain number of molts, they will reach their adult phase. This resemblance to the adults should make identification easier. Assassin bugs are found all over the world except for the most extreme climates. Their most common locations include fields, gardens, and grasslands where other insects reside. Some species are adapted for specific plants or areas. For example, the milkweed assassin bug tends to prefer the milkweed plant where its prey is found. Assassin bugs come into two different types: the carnivorous ambush predators and the blood-sucking ectoparasites. The former insects, which represent the greatest number of species, will pierce their prey with a beak and suck out the body fluids. The latter, though far fewer in number, includes the kissing bug, which can bite people around the lips and eyes as they sleep. Assassin bugs are preyed upon by a wide variety of different birds , frogs , lizards , snakes , and small mammals. In order to defend themselves, they can deliver a very painful bite that may be aggravated by venom or digestive fluids within their saliva. To discourage predators, they can rub their proboscis against their bodies to make aggressive warning sounds. The predatory assassin bugs has a diverse diet of many different insects , including their eggs, larvae, and adult phases. Flies , leafhoppers, millipedes , and ants are some of their most common prey. Because of the digestive chemicals in their saliva, which can break down tissue, they can feed on insects much larger than themselves. Some species have the ability to coat their legs with sticky plant resin and capture insects like bees from the air. Another species will pluck the strings on a spider web to mimic the flailing a trapped insect; this will attract the spider for the bug to consume. The feather-legged bug has a special growth on the abdomen that releases a substance to attract and then paralyze ants. The leafhopper assassin bug secretes a sticky fluid from its body as well. In contrast to the predatory species, however, the blood-sucking assassin bugs can feed on any number of large vertebrates, including humans. Like mosquitoes , they are considered to be a vector (transmitter) of dangerous diseases. While there are several thousand types of Assassin Bugs in the world, there are just a few of them: While determining the evolutionary history of the Assassin Bug is difficult due to them being one of the older groups of insects dating back 100 million years ago and the lack of fossil evidence, scientists believe that the blood-sucking varieties of the kissing bugs diverged in Central and South America. Assassin Bug evolution is interesting and helpful to study because they are spread out across the world in different environments and provide insight into how other species diverged throughout history. Most assassin bugs are nothing to worry about. Besides biting people with their sharp mouth parts out of self defense (which causes pain and swelling), they generally do not bother humans. The blood-sucking bugs are more problematic, however. Kissing bugs are a particular concern in the United States . They can be found all throughout the home, including cracks, holes in the wall, furniture, and mattresses and box springs. Cleaning out these areas and closing holes to the outside is critical to prevent them from occurring. One of the best ways to get rid of them is with a chemical repellent from the store or a homemade solution that works on these types of insects. Traps are an option as well, but you may not necessarily need an exterminator unless there is a serious infestation. If you’ve been bitten (by any assassin bug, not just a kissing bug), you should wash the site out with antibacterial soap and apply lotion or ice. This should help to reduce the pain and prevent a possible infection. However, unless you catch a disease or develop an infection, immediate medical treatment is not normally necessary. You can easily treat the wound yourself.",
        "score": 0.77584326
    },
    {
        "Name": "Toxodon",
        "Genus": "Toxodon",
        "Text": "A Toxodon is an extinct genus of South American mammals. It’s a member of Notoungutata , one of several now extinct orders of hoofed mammals indigenous to South America. Toxodon are thought to have been herbivores, quickly adapting to their situation, depending on what plants were available. They are known to change their eating habits depending on where they are. For instance, they had an almost totally browsing diet in the Amazon rainforest. They developed mixed feeding in Bahia and the Pampas and almost completely dominate the grazing diet in the Chaco. Browsing is when plant-eating species will eat high-growing plants such as leaves, soft shoots, and fruits. Grazing is the opposite of browsing, as it consists of such species eating low-growing grass and plants. Toxodon had a wide distribution in South America during the late Pleistocene, extending from the Pampas to the Amazon rainforest. Charles Darwin was one of the first people to record the Toxodon, as he found fossils while on his voyage. Toxodon fossils led Darwin to believe that the animals in Europe were different from those in America. Therefore, they helped prompt his theory of evolution. During the Pleistocene, it was likely that the Toxodon was extremely common. If you could go back in time, you would find large populations of them during the Great American Interchange. During this period, the formation of the Isthmus of Panama created a land bridge. This bridge joined North and South America. Of course, this allowed previously isolated animals to mingle. However, not all animals benefited from this period. After all, some prey animals found themselves hunted by new predators. During the time Toxodon was around, there was a spread of North American predators such as the sabre-toothed cat, Smilodon.‭ ‬These cats likely hunted very large animals at the time, as they required a lot of meat. They could not spend their time wasting energy on small animals. This species of cat likely hunted the Toxodon when it was exposed to it. However, these cats didn’t originally share a range with the Toxodon, so this hunting wouldn’t have occurred until later. Humans were also a problem for the Toxodon. Scientists have found arrowheads with fossils of Toxodon, which shows that humans did hunt them. It is possible that the threat of humans eventually also caused the Toxodon to go extinct. In the end, it was likely multiple predator threats that lead the Toxodon to extinction. However, other theories abound. Most of the theories are linked to the disappearance of other megafauna. Therefore, we don’t reall y know why the Toxodon went extinct. Toxodon was found throughout South America. It was quite populous at the time it lived. Fossils of Toxodon have been found in Brazil, Argentina, Bolivia, Paraguay, and Uruguay. Toxodon seems to have been one of the most common herbivores across South America when it was around. In this way, it was similar to the modern buffalo . The Toxodon went extinct soon after the last ice age at the beginning of the Holocene period, almost 11,700 years ago. They are part of the Quaternary extinction event, along with almost all of the large animals in South America. It’s thought that new predators from the land bridge connecting North and South America were the cause of bringing in new predators to the Toxodon. There has also been a theory that humans were a large part of the extinction of this creature, due to there being arrowheads in and around certain fossils. Some paleontologists disagree and chalk it up to disease, a natural disaster, or some other cause that destroyed all of the megafauna of that time.",
        "Diet": "Herbivore with no preference",
        "score": 0.7746814
    },
    {
        "Name": "Ladybug",
        "Diet": "Carnivore that eats insects such as aphids, thrips, caterpillars, beetle larvae, scale insects, spider mites, mealybugs, other ladybirds, greenfly, small insects",
        "Behavior": "They can be characterized as solitary.",
        "Features": "Its brightly colored and patterned elytra",
        "Fun_Fact": "There are more than 5,000 species worldwide!",
        "Text": "Ladybird beetles, otherwise known as ladybugs, have been to outer space and had no problem catching prey in Zero-G. The typical description of the ladybug discusses the red shell and black spots, but there are many different patterns. In fact, the number of spots can even differentiate between the many species around today. They have a rather resilient body, ensuring that they can live in many different environments in North America and Europe . Ladybird beetles and ladybugs are the same insects. The difference is it’s called a ladybug in North America and a ladybird in the United Kingdom. Entomologists also consider ladybird being the more correct name for the insect, as it is not, in fact, a true bug but a beetle. The scientific name for the ladybug is Coccinellidae , and their classification places them in the invertebrate category. Coccinellidae comes from the Latin word “ coccineus ,” which means scarlet – a clear tribute to the color of their exoskeleton. It is sometimes called a ladybird, which comes from a British expression for the insect. Many people took to calling the insect “Our Lady’s bird.” The beetle gets its common name because it was associated with the Virgin Mary. Legend has it that a group of farmers was so plagued by aphids eating their crops that they prayed to the Virgin for help. When help arrived in the form of coccinellids, the beetles were known as “Our Lady’s beetles,” from then on. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Through genetic sampling, it is thought that the ladybug dates back to the Cretaceous period. While the ladybug belongs to a group of mostly plant-eating beetles, this insect evolved its characteristics based on defensive evolutions of their prey and also adaptations of plant life. Fossils of ladybugs have been found that date back to the Eocene period, which dates back 50 million years. Though most people are familiar with the typical red body and black spots, the ladybug is actually a category of over 5,000 different species. The species come in many different colors and markings, including combinations of red, black, brown, yellow, white, and neutral shades. They are primarily divided into the following categories: The elytra of many types of ladybirds are, indeed, scarlet, and the Virgin was sometimes depicted wearing a scarlet robe. The seven black dots on the insect’s elytra were supposed to represent her seven joys and seven sorrows, even though there are ladybird species that have more or less than seven spots. More ladybird species include: 1. Coleomegilla maculata 2. Coccinella novemnotata 3. Coccinella transversoguttata 4. Hippodamia convergens 5. Calvia quatuordecimguttata 6. Rhopalosiphum cerasifoliae 7. Rhopalosiphum maidis 8. Rodolia cardinalis 9. Coccinella californica 10. Psyllobora vigintiduopunctata When you imagine the appearance of a ladybug, colors like red and black typically come to mind. In fact, this traditional idea makes the ladybug (or ladybird) one of the most easily recognizable insects in the world. However, this description doesn’t come close to covering the 5,000 species that are out there today. While every ladybug has an oval shell, six legs, and the cutest cheeks of any insect, they also are found in many shapes, sizes, and colors. Most of these insects are just a centimeter long, but they can be as small as 1 mm. Along with the traditional red shell and black dots, other species include: Along their legs, their joints are specially designed to release a toxic fluid that can protect them from predators. Sometimes, they’ll even bite if they are threatened. While it is easy to find one or two ladybugs, they typically are found in a group, which is called a loveliness. Part of the reason that these insects swarm together is to reproduce quickly and deal with limited food supplies during winter. Approximately half of this population is made of females, and they choose a mate while they are in their large group. Ladybugs can be found around the world, but they tend to live in Europe and North America . They were not introduced to North America until the middle of the 1990s, used to help with the aphid problems that were plaguing the entire region at the time. Since then, ladybugs seem to have found a place that they are happy to stay in. Of the 5,000+ species, the United States is specifically home to over 500 variations. The ladybug’s flexibility in different habitats allows it to thrive. Just as easily as they will live in grasslands and forests, they’ll also collect in cities and suburbs. Some swarms can even be found along rivers. When they are ready to lay eggs, they will simply leave their larvae on the underside of a leaf. As recently as 2018, scientists grew concerned over the dwindling population of certain insect species, considering the major impact that they have on the world’s ecosystems. Some of the reasons for the decline can be credited to the use of insecticides, pollution, and climate change. However, the resilience of many different habitats is part of the reason that there are still millions of these beetles found worldwide. Ladybugs are omnivores, consuming both plants and other animals as their main source of nutrients. Primarily, they prefer to consume leaves, fungi, and other insects. Sometimes, they’ll even dine on mushrooms and mildew, but their primary diet is made of aphids. In fact, the ladybird consumes up to 50 aphids a day . Birds consume ladybugs, but that’s hardly their only predator. They also are eaten as a part of the diet of frogs, wasps , spiders, and dragonflies. While they have many defenses against other animals, they are still rather small animals that cannot fight back as strongly as others. While the ladybird will consume some types of plants, their diet primarily consists of other insects (especially aphids). They’ll go after scales, mealy bugs, mites, leafhoppers, and other insects that are smaller than them. They will also eat the larvae of other insects. Though the ladybug is mostly not harmful, having any beetles or insects in a home can be unsettling. They are safe to keep in a garden, but large infestations can damage a farm. If there is just a small group of ladybugs, sweeping or vacuuming them up is relatively safe. However, a massive infestation may need to be sprayed with soapy water. It is also safe to leave a bowl of soapy water where they collect. While some people swear by the use of Diatomaceous Earth to clear out a colony, there are also many homemade traps that can work. Small LED lights can be set up in an area to attract the beetles into a funnel or box before they are moved somewhere safer. Anyone with a green thumb and a disdain for ladybirds can plant mums around their home or porch. Apparently, as resilient as the beetles are, they absolutely hate the smell of these flowers, and they’ll likely choose a home without them instead. Natural repellants like lavender oil and citronella candles can also keep ladybugs and other insects away.",
        "score": 0.7743003
    },
    {
        "Name": "Cedar Waxwing",
        "Genus": "Bombycilla",
        "Diet": "Omnivore that eats berries, small fruit, flowers, oozing sap, and insects",
        "Behavior": "They can be characterized as social.",
        "Features": "Rotund bodies and flat crests",
        "Fun_Fact": "Their feathers have red, waxy tips that can be hard to identify unless you’re up close.",
        "Text": "“Their breeding habitats are solely chosen by the availability of fruiting trees and shrubs.” The cedar waxwing ( Bombycilla cedrorum) lives in North America and inhabits open areas with fruiting trees and shrubs. These birds are highly social and live in flocks year-round, often seen passing fruit to each other as they perch on branches. Listen for their high-pitched whistles as they fly over water or hover near berry bushes. Find out everything there is to know about this waxwing, including where it lives, what it eats, and how it behaves. Cedar waxwings live in North America in 15 countries, including Canada, Mexico, The United States , Costa Rica , and the Bahamas. This species is migratory, spending its springs and summers in Southern Canada and its winters throughout the US, Mexico, and Central America. They inhabit open woodlands with abundant fruiting trees, like orchards, forest edges, streamsides, swamp edges, and backyards. Their breeding habitats are solely chosen by the availability of fruiting trees and shrubs. They place their nests in trees on a horizontal branch or fork, around six to twenty feet above the ground. Both sexes build a loosely constructed open cup of grass and twigs lined with moss, grass, and animal hair. The cedar waxwing (Bombycilla cedrorum) is from the Bombycillidae family, which includes the waxwings, three species of passerine birds . The genus name, Bombycilla, is Ancient Greek and Latin for “silk” and “tail.” And its specific name, Cedrorum , is Latin for “of the cedars.” The cedar waxwing is a medium-sized passerine bird, measuring six to seven inches long and weighing 1.1 ounces, with an 8.7 to 11.8-inch wingspan. They have rotund bodies with large heads and broad, short bills. They have short tails and wide, pointed wings, and their crest is flat and lays over the back of their head. It has a light brown head and chest, a yellow belly, gray wings, and a black face mask outlined in white. Its tail is also gray with yellow tips, and its wings have red, waxy tips on the end of the feathers. These are highly social birds who stay in flocks year-round and will even nest in small communities. They are solid, steady fliers with constant wing beats reaching 25 Mph. It often calls, especially in flight. Their calls sound like high-pitched whistles and buzzy trills. They flutter around berry branches, passing fruit to one another. Cedar waxwings are short to long-distance migrants. They breed in Central to Southern Canada and spend winters in the Southern United States, Mexico, and Central America. Some populations in the northern half of the United States live year-round in their environments. Cedar waxwings are omnivores who forage in flocks. Their diet includes berries, small fruit, flowers, oozing sap, and insects . They feed on various berries like wild cherries and juniper and consume insects like beetles , ants, and caterpillars. These birds forage alone or in pairs during the nesting season but eat in flocks the rest of the year. They hover over vegetation to take berries and insects, and they will catch flying insects mid-air. The IUCN lists the cedar waxwing as LC or “least concern.” Due to its extensive range and extremely large, increasing population, this species does not meet the “threatened” status criteria. The most significant threat to the cedar waxwing is collisions with cars and windows. They could potentially be affected by climate change in the future and suffer from spring heat waves and wildfires. Cedar waxwing predators include merlins, hawks, grackles, and bullfrogs . Blue jays and house wrens are their nest predators. Not much is known about how these birds defend themselves, but they may find safety in numbers. Cedar waxwings are serially monogamous, meaning they mate with only one partner per breeding season. Their courtship displays include posturing, touching bills, and passing food back and forth. Their nesting season is late and doesn’t begin until mid-summer, and they lay two broods per year. Females lay two to six, typically three to five, pale blue-gray eggs with brown and black spots. Females incubate for 12 to 13 days, but both parents assist in feeding the nestlings. The young fledge the nest 14 to 18 days after hatching and can reproduce around one year old. This species can live up to eight years in the wild. The global cedar waxwing population is estimated to number 64 million mature individuals. Trends suggest their numbers increased over 7% in the last ten years and continue to increase slowly. Their numbers are not experiencing any extreme fluctuations or fragmentations.",
        "score": 0.7726981
    },
    {
        "Name": "Asian Cockroach",
        "Genus": "Blattella",
        "Diet": "Omnivore that eats decaying plant and animal matter",
        "Behavior": "They usually live in colonies.",
        "Features": "Body length wings",
        "Fun_Fact": "Originally discovered in Japan",
        "Text": "“The Asian cockroach was first discovered on the Japanese island of Okinawa.” Cockroaches have made their way onto every continent in the world, even Antarctica. They live everywhere humans live, and in many areas where people are absent. There are a shocking number of roach species around the world— almost 5,000 . One species, the Asian cockroach, was first described only a few decades ago, in the 1980’s. First seen in Japan, the Asian cockroach now lives throughout the southeastern United States. They’re almost always mistaken for the incredibly common German cockroach, though there are subtle differences between the two species. Fortunately, Asian cockroaches aren’t nearly as big of a problem as are German roaches. The Asian cockroach comes from a long line of roach relatives, about 350 million years worth. That’s right; cockroaches were around when dinosaurs roamed the earth. And, back then they looked almost exactly the same as they do today. Out of all the world’s insects, roaches just may be the best at surviving. The Asian cockroach is no exception; they continue to spread throughout the warm, humid regions of the United States. The scientific name of the Asian cockroach is Blattella asahinai . First classified in 1981 in Okinawa, the Asian cockroach can now be found throughout the southeastern United States. They’re limited to warm areas with plenty of damp soil and leaf litter. Scientists believe Asian cockroaches are closely related to German cockroaches; the two are almost identical. Asian roaches grow to between ½ and ¾ of an inch long as adults. Nymphs are smaller, and have no wings. Males and females are very similar in appearance , the only real difference being that males are slightly bigger, and have longer wings . Asian cockroaches follow the general format of all cockroach species; two antennae, six legs, and segmented bodies. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Compared to other roaches, the antennae of the Asian cockroach are relatively short. Shield-like structures called pronotum s protect their heads; two vertical, dark brown bands mark the pronotum. After the head comes the thorax, or second body segment. Both the wings and first pair of legs are attached to the thorax. The Asian roach’s abdomen is its longest body segment; both the second and third pairs of legs are attached to it. Like most species of roach, sharp spikes cover the Asian roach’s legs; they’re used for traction on slippery surfaces. Asian roaches have three main life stages; egg , nymph, and adult. Eggs aren’t freestanding, like chicken or snake eggs, though. Instead, they’re kept in hard, rectangular cases called ootheca. Females carry the ootheca around with them, attached to their rear ends, until the eggs inside are ready to hatch. Each egg case contains between 35-40 eggs which incubate for around 19 days. When they hatch, the newborn baby roaches are pale white with soft bodies. They often huddle underneath the mother for a few hours directly after birth, until their exoskeletons harden up a little. Nymphs grow steadily for 60-70 days, molting and regrowing their skins as they get bigger. After the final molt, the nymph becomes sexually mature and gains its adult wings. Females live longer in adulthood than males, but the average adult lifespan is between 50-100 days. In that time, female Asian roaches will produce just four egg cases. Unlike other species of pestilential roaches known for invading homes, the Asian cockroach actually prefers the outdoors. Like the Pennsylvania wood roach, the Asian roach prefers to live outside in natural settings. Asian cockroaches can most often be found in shaded, moist areas full of leaf litter or mulch. If conditions are right, they’ll stick to one area, and breed in that spot, until they’ve overrun the whole place. Asian cockroaches were originally found only in Japan, but in recent decades they have increasingly been found in the southeastern United States. They’re a heat-loving species and tend to stick to areas with plenty of gardening and landscaping areas. So far, they’ve been reported in Florida, Georgia, Alabama, South Carolina, and Texas. Like all cockroaches, Asian roaches are omnivores who specialize in detritus. They’ll eat just about anything they can find, though their predilection for the outdoors means they primarily eat leaf litter and rotting organic matter. However, Asian cockroaches are also fond of human food, which means that, when they do make their way into buildings, they can quickly cause problems. Because Asian cockroaches are capable of flight, open doors and windows make excellent entrances to homes. Once inside, they’ll feast on everything from leftover food to pet waste . Outdoors, they’re found in compost bins, near piles of mulch, or in garden beds. These cockroaches are mostly nocturnal; they’re most active at dusk. Their nocturnal nature keeps them safe from predators that only hunt in the day like most birds of prey. However, not all predators go to sleep when it gets dark. Reptiles, amphibians, small mammals, and nocturnal birds all prey on Asian roaches. When Asian cockroaches were first seen in the United States, they were mistaken for German cockroaches. The two look extremely similar, but there are important behavioral differences. The most extreme difference comes in the flight abilities of each species; German cockroaches can do no more than flutter their wings, while Asian roaches are capable of full flight. To look at them, you would have a hard time telling which is which. But, there are a few distinguishing features. First, Asian roaches have longer, narrower wings. Females of both species carry their egg cases around with them, but the longer wings of the Asian roach obscure most of her egg case. In contrast, German cockroach egg cases are not hidden by wings. Preventing an influx of these cockroaches may not be as easy as it sounds. They’re attracted to plant detritus of all kinds, which means they may take up residence in your garden, landscaping, or even your lawn. They don’t often come inside , though you should take care to screen any windows or doors to prevent entry. If you have an infestation of these cockroaches outside your home, you should clean up any unnecessary leaf litter or accumulated mulch. Then, instead of using insecticide sprays or roach traps, opt for toxic pelletized baits spread out around the garden. If you do decide to use pellet bait, be sure that it’s not accessible to pets or children. Roach traps and insecticides are toxic to both humans and animals.",
        "score": 0.77242124
    },
    {
        "Name": "Australian Cockroach",
        "Genus": "Periplaneta",
        "Diet": "Omnivore that eats decaying plant matter",
        "Behavior": "They usually live in colonies.",
        "Features": "Tan head with dark brown markings",
        "Fun_Fact": "The most common type outdoor roach in Florida",
        "Text": "“Despite their name, Australian cockroaches are thought to have originated in Africa.” Out of all the cockroach species in the world, the Australian roach just may be one of the prettiest—for a cockroach, that is. Australian cockroaches are also called waterbugs or shad roaches; they’re one of the most common outdoor roach species in the southern United States . They may be called Australian cockroaches, but scientists actually think they originally came from Africa via ships. Today, they’ve colonized the warmer parts of North America , as well as their native Africa, and even Australia . Australian cockroaches are just one of the thousands of roach species around the world. In fact, despite the fact that they like to hang out around man-made dwellings, they’re one of the less problematic cockroach species. Other roaches, like the American and German cockroaches, live entirely indoors and infest homes. The Australian cockroach, on the other hand, actually prefers the outdoors, and only comes inside in cases of cold weather, or in search of food. The Australian cockroach’s scientific name is Periplaneta australasiae . This species of roach is most often confused with the American cockroach, which is very similar in appearance. Interestingly, though Australian roaches aren’t actually from Australia, they’ve actually become one of the lucky country’s invasive cockroach species. It’s no wonder they’ve colonized Australia, Africa, and the warmer parts of North America—Australian cockroaches love heat and humidity. Australian cockroaches look very similar to other species of problem roach, like the American cockroach. All cockroaches have six legs, two antennae, and bodies separated into segments. The basic cockroach form hasn’t changed much in the last 300 million years; ancient cockroach fossils look almost identical to today’s roaches. The adult Australian roach has little sexual dimorphism, meaning males and females look almost exactly alike. Both are a rich, mahogany color, with yellow heads marked by two squarish brown markings. Their bodies are divided into the head, thorax, and abdomen. The head is covered by a hard, shield-like structure called a pronotum ; this is the yellow and brown part of the body. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Beyond the head, the Australian cockroach’s wings cover the thorax and abdomen. Their wings are actually longer than their bodies, giving them the ability to achieve true flight . Below the wings are six legs—one pair attached to the thorax, and two pairs attached to the abdomen. Like most species of cockroach, the Australian roach has stiff spikes on its legs that aid it in climbing and gripping smooth surfaces. The life cycle of the Australian cockroach can be summarized in three words: egg, nymph, adult. The egg stage lasts approximately 40 days. Eggs come encased in an egg case called an ootheca that looks like a tiny, dried kidney bean. Each ootheca has between 12-24 eggs inside; with luck, each will hatch into a baby cockroach . The mother doesn’t carry the egg case around for long though, instead, she opts to glue it in a safe place, like inside the bark of a tree, or in an out-of-the-way crevice. On hatching, the larval roaches have no color and are only the softest of exoskeletons. They grow rapidly though, molting and regrowing their ‘skin’ five times before reaching adulthood. This process can take up to one year, depending on weather conditions. Interestingly, nymphs grow faster in the presence of other nymphs—so a lone nymph will take longer to mature than a nymph among other nymphs . After the final molt, the nymphs become adults. For the first time in their lives, they have wings and can fly away from predators. There is a downside to adulthood for the Australian cockroach though—it only lasts 4-6 months. Adult females make the most of their short lives, producing up to 30 egg cases before they die. Like many peridomestic roaches, the Australian cockroach prefers to live outdoors, rather than in human homes. They’re not a cold-tolerant bug though and must choose areas with plenty of light, warmth, and humidity. This makes them one of the most common outdoor cockroaches in the southern United States. They’re especially prevalent in Florida, where they live among other outdoor species of roach. Australian cockroaches make their homes near buildings, in gardens, or landscaped areas. They’re particularly fond of mulch, leaf litter, woodpiles, and manicured gardens. They’ve even been observed hanging out around exotic species of garden plants—who says cockroaches don’t like to stop and smell the flowers? Only on rare occasions do Australian cockroaches come inside. They may head indoors in case of cold weather; they don’t tolerate the cold well, but they can go longer without water than some species of cockroach. If you find one in your home, and it’s not cold out, then it may have followed its nose. Australian cockroaches can fly into homes via open windows, doors, tiny cracks, or even plumbing fixtures like water pipes and toilets . Australian cockroaches feed primarily on dead and decaying green waste, like dead leaves and rotting trees. Their favorite meal is a plant that has died, but that doesn’t mean they’ll turn their ‘nose’ up at any easily available snack. Like all cockroaches, Australian roaches are opportunistic omnivores who will eat anything available. This includes human and pet food, as well as mulch, plants, leaf litter, and garbage. Australian cockroaches may be able to fly, but flying isn’t all it’s cracked up to be when it comes to aerial predators. Birds, like crows and hawks, are quick to snap up Australian roaches on the wing. On the ground, they often fall prey to toads, frogs, mice, rats, snakes, and lizards. Because they live in many of the same environs, it’s easy to confuse Australian and American cockroaches with one another. American cockroaches are slightly bigger, growing up to two inches in length. But, both species have full-length wings and red-brown bodies. Even the markings on their pronota are almost identical. It may seem impossible to tell the two species apart, but this cockroach has one key feature that the American cockroach lacks. These cockroaches have a tan-colored stripe on the upper outside margin of their forewing; American cockroach wings are entirely brown, with no stripe. If you’re still not sure what type of roach you’re looking at, consider where it is; if it’s inside, it’s probably an American cockroach. These cockroaches aren’t generally considered a pest species. That being said, they can still spread disease and pathogens and trigger asthma in people, so you don’t want them inside your home. The best way to prevent Australian roaches from getting out of control around your home is to remove all unnecessary green waste, like leaf litter and dead plants. Additionally, stack firewood away from the home, and ensure that you keep screens on any open doors or windows. If you do have an Australian roach infestation , you may want to call in a professional pest exterminator. If you would rather take care of the problem on your own, you can always purchase glue or bait traps and place them outside. Take care, however; cockroach traps and insecticides are toxic to both humans and pets.",
        "score": 0.77234125
    },
    {
        "Name": "Flea",
        "Diet": "Carnivore that enjoys blood and other organic matter",
        "Behavior": "They can be characterized as solitary.",
        "Features": "The long legs",
        "Fun_Fact": "Adult fleas can jump up to 7 inches in the air",
        "Text": "Fleas are tiny blood-sucking insects that live on the external body of a host. They are a constant annoyance for cat and dog owners; more than a billion dollars is spent every year on treatment. While their bites generally cause nothing more than itching and pain, they have been known to transmit diseases to people. They were largely responsible for the transmission of the bubonic plague from rats to humans in the Middle Ages. People can also develop allergies to repeated bites. Fleas normally take avian or mammalian hosts, but some species infest reptiles as well. This article will cover some interesting facts about the identification, prevention, habitat, and diet of the common flea. As per the study authors, fleas, contrary to common assumption, are taxonomically classified as scorpionflies. Their evolution can be traced back to the period between the Permian and Jurassic, approximately 290 to 165 million years ago when they began to feed on the blood of vertebrates. It is believed that modern fleas likely originated in the southern region of the Gondwana supercontinent and subsequently migrated swiftly toward the north. Their evolution is thought to have initially occurred in association with mammalian hosts, with the transition to avian hosts happening at a later stage. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The scientific name for the flea order is Siphonaptera. This is derived from the combination of two Greek words: siphon, meaning tube (their blood-sucking apparatus), and apteros, meaning wingless. There are an estimated 2,000 species spread across more than 240 genera. Some of the most common types include cat fleas, bird fleas, and rat fleas. Here are the most common: Fleas are small wingless insects , rarely measuring more than an eighth of an inch long. The small size can sometimes make identification difficult, but adults are characterized by black or brown bodies, bulbous or rounded at the back, with hard plates and various hairs and bristles directed backward. A long proboscis emerging from the mouth enables them to pierce the skin and suck the blood of its host. Their long legs are well-adapted for jumping and are also covered in strong claws that grasp the host’s body. Brown or black fleas often turn a shade of red after sucking up blood. The larvae, by contrast, look nothing like the adult. They have a long segmented worm-like body with short bristles instead of legs, no eyes, and mouthparts adapted for chewing. When the larva grows large enough to transform, it will often seek out dark spaces anywhere in the house or on the ground and then weave its cocoon. Some species can actually delay their development until they sense a host nearby. Vibrations, body heat, or carbon dioxide exhaled from a nearby animal are often triggers for the pupa to emerge from the cocoon and attach to the host. Fleas are found in almost all ecosystems around the world. As mentioned previously, they live on the body of a host. Some species are specialized for a specific host (like a cat or a rabbit ), while others will accept multiple hosts. Find out if fleas die in the winter in this article . Fleas rely completely on their host for their diet. The host provides nearly all of the organic matter they need to survive. Fleas are often preyed upon by other insects , spiders, lizards , snakes , and frogs . The adult flea feeds exclusively on blood; the technical term for a blood-feeding animal is hematophage. They typically have 10 to 15 blood feedings per day. The larvae, on the other hand, feed on skin flakes, dead mites, dried excrement, blood, and other bits of organic matter. The pupa does not usually eat at all until it emerges from the cocoon. Fleas are most likely to enter the home by taking a pet as a host. Both cat and dog owners should be especially vigilant for signs of infestation in the house. In order to treat your pet, a veterinarian will recommend either an oral insecticide in capsule or tablet form or a topical insecticide applied between the shoulder blades. This should kill adult fleas or prevent them from reproducing for about a month. Once your pet has received its treatment, you should use a powerful vacuum or steam cleaner on the bedding, carpets, floors, and upholstery every day (especially where you know your pet has been) for several weeks. The vacuum bag should be disposed of immediately after each use to prevent the fleas from immediately returning. Wash the infested bedding in hot water and dry it at the highest possible heat setting. Finally, you can use an aerosol spray (preferably not a fogger) to ensure any remaining fleas are killed. Chemicals like permethrin normally work for adults, while methoprene or pyriproxyfen will work as a form of pest control for the egg, larva, or pupa stage. Pets can pick up fleas from your yard, so make sure there isn’t any tall grass or debris where the insects can hide (they do not usually stay in exposed areas). Check the area where your pet has just been around the yard. Employing all of these strategies at once will help with the prevention of any future infestations.",
        "score": 0.7717426
    },
    {
        "Name": "Opossum",
        "Genus": "Didelphis",
        "Diet": "Omnivore that enjoys fruit and especially likes insects, frogs",
        "Text": "Opossums hold the distinction of being the only marsupial that lives in the United States and Canada! Throughout much of United States history, opossums were animals that were widely hunted and consumed by people. Although this remains true in some areas of the southern U.S., these savvy marsupials are now better known as pests due to their scavenging habits that leave garbage cans upended and messes in their wake. They continue to be popularly hunted in many parts of Central and South America; in fact, restrictions have been enacted to curb the overhunting of these animals in those areas. The opossum is believed to have originated in North America , where they began to change into the mammal we see today. Creatures resembling the opossom first appeared on earth over 65 million years ago, during the Cretaceous period and the end of the dinosaurs’ rule. Consisting of more than 103 species that span 19 different genera, the scientific name for opossums is Didelphidae . This mammal is classified in the order of Didelphimorphia , which is the largest in the Western Hemisphere. The term reflects the fact that these marsupials essentially have two wombs – one in which babies initially grow and a pouch where they continue to mature – with “di” meaning “two” and “delphus” meaning “womb.” The Virginia opossum, the only species in the U.S. and Canada, has the scientific name Didelphis virginiana. The word “opossum” was first recorded between the years 1607 and 1611. It is believed to have been borrowed from the Powhatan language and derived from a Proto-Algonquian word, “apousoum,” which means “white dog or dog-like animal.” The first recorded instances of the word can be traced back to John Smith and the Jamestown colony of Virginia. A type of mammal known as a marsupial, a fully-grown opossum is roughly the size of a house cat. On average, possums, as they are also known, measure approximately 2.5 feet long from nose to tail and weigh between 8.8 and 13.2 pounds. Mostly gray in color, these animals typically have white faces and long, pointed noses. Inside their mouths are 50 teeth – more than any other land-based mammal in North America. In addition to having four short limbs, they have specialized tails that they use in a variety of ways. Because these rat-like tails are capable of gripping onto things, they are regarded as prehensile. Thanks to this feature, opossums can use their tails to help keep their balance, aid in climbing trees, and hold onto nesting materials while climbing. Young animals use their prehensile tails to cling to their mothers’ backs while being carried around. Contrary to popular belief, however, opossums do not hang upside down from trees by their tails like bats. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . These mammals’ hind legs also feature opposable thumbs, which allow them to hold onto branches and the like even more effectively. Males are typically slightly larger than females. They also have larger canine teeth and tend to be significantly heavier. Solitary and nomadic in general, opossums are animals that have a distinctive, slow-moving, hobbling way of getting around. Primarily active at night, when they scavenge for food and engage in most other activities, these mammals’ eyes are well-adapted to darkness. By day, opossums tend to den up in convenient cavities rather than making their own nests. Examples include inside tree holes and brush piles or underneath manmade structures. During the warmer months, these marsupials tend to stay on the move. They typically travel wherever food takes them. In the winter, these marsupials tend to stay put in more permanent nesting sites. However, they remain moderately active throughout the colder months and therefore are not true hibernators. One of the most well-known behavioral features of these animals is their tendency to play dead when confronted by predators. Also known as “playing possum,” the technique is a second resort if the mammal’s initial reaction to a threat – hissing, baring its teeth, and growling – fails to scare it away. If a predator proceeds to attack, the animal will become completely limp and enter an almost catatonic state. Flopped over on its side, the marsupial may close its eyes or leave them staring blankly into space. With its tongue extended, the creature can appear remarkably dead. What people often don’t know is that opossums also typically defecate and emit a foul-smelling, green substance from its anal glands while playing dead. The animal may remain in this state for up to six hours; during that time, its breathing and heart rate slow down significantly. Although they’re not considered arboreal marsupials (which live in trees), they are excellent tree climbers and spend plenty of time up in canopies. They possess sharp claws that are excellent for grasping into tree bark, and they use their prehensile tails to assist in climbing and maneuvering around. Incredibly, opossums can also clean themselves of ticks and are capable of consuming upwards of 5,000 of them per season. Only a single species of opossum, the Virginia opossum, is found in the United States and Canada. This species’ habitat extends into northern Canada and as far south as Central America. South of there, dozens of additional species of opossum may be found. Opossums have adapted for survival in North, Central, and South America by developing prehensile tails that let them grip tree limbs. The opposable thumbs on their hind legs assist in this regard too. Given the vast area that they inhabit, opossums are capable of surviving across a variety of climates. Opossums are scavengers. Conveniently, they are also omnivores, which means that they are willing to scavenge both plant and animal materials for subsistence. They are well-known for scavenging from humans; in particular, they tend to get into dumpsters, garbage cans, and the like looking for food. Opossums are also attracted to carrion (decaying flesh), so they are often seen consuming roadkill. In general, opossums’ diets typically consist of fruit, grass, and various types of nuts. These mammals will also hunt birds , mice , worms, snakes , insects , and even chickens . Many species of opossums are immune to the venom of rattlesnakes and pit vipers and are therefore able to prey upon those creatures. This diet flexibility is one of the many attributes that have made the opossum such a successful species. Want the complete details on the opossum’s diet? Give our guide ‘ What Do Possums Eat ‘ a read! Humans are the biggest threat to opossums. Although not common in the United States anymore, these mammals were once hunted and consumed regularly; President Jimmy Carter was known to hunt them. Opossum hunting remains popular in many parts of Central and South America, where local governments have placed restrictions on hunting possums . However, opossums are classified as “ least concern ” by the International Union for the Conservation of Nature (IUCN) so they are not considered to be endangered. Opossums mate from the mid-winter through the mid-summer. In a single year, a female opossum can have multiple litters of baby opossums. After mating, female opossums typically give birth in about two weeks. Up to 20 opossums may be born in a single litter. On average, however, fewer than half survive. When they are born, baby opossums are almost entirely helpless. Blind, naked, and almost transparent in appearance, newborn opossums measure about half an inch in length and weigh just 1/200th of an ounce; this makes them roughly the size of a honeybee. Immediately after being born, baby opossums crawl into their mother’s pouch. There, they encounter a horseshoe-shaped arrangement of 13 teats, which they immediately latch onto. Those that are left without a teat to latch onto perish. Once latched on, the teat swells up and remains in place in the baby’s mouth for a period of about two months. At that point, the babies’ eyes start opening, and they start emerging from the pouch on occasion and may be carried around on their mothers’ backs while hunting. They become completely independent at around three months of age. The average lifespan of the common, or Virginia, the opossum is one to two years. Although they face several predators – most notably, humans, dogs, and cats – opossums are survivors that reproduce rapidly. Therefore, their populations have remained stable in modern times, and they are not classified as endangered animals.",
        "score": 0.77131736
    },
    {
        "Name": "Florida Woods Cockroach",
        "Genus": "Blattella",
        "Diet": "Omnivore that eats decaying plant and animal matter",
        "Behavior": "They usually live in colonies.",
        "Features": "Flattened, egg shaped body",
        "Fun_Fact": "Often found on palmetto trees",
        "Text": "“The Florida woods cockroach is commonly known as the palmetto bug in the southeastern United States.” You may read the word ‘ cockroach ’ and think immediately of those pesky crawlers that invade homes and spread filth wherever they go. But, rest assured, the Florida woods cockroach is not one of those roaches . Actually, startlingly few species of cockroach ever cause problems for humans. Out of nearly 5,000 species worldwide, only a handful ever come into contact with humans. Of those few species, the Florida woods roach is one that is commonly found in the hot southeastern states of Florida and Georgia. Known widely as a ‘ palmetto bug ’ because of its partiality for palmetto plants, the Florida roach makes its home mainly outdoors. Occasionally, they may wander indoors in search of food or shelter, but they would much rather be outside in the dirt, or hanging out on a nice plant. The scientific name of the Florida woods cockroach is ‘ Eurycotis floridana .’ They’re commonly called palmetto bugs, Florida stinkroaches, or skunk roaches. Florida roaches are native to the extreme southeastern part of the United States; they can be found in the Florida Keys, Florida, and the southern parts of Georgia, Alabama, and Mississippi. Palmetto bugs tend to be very thick-looking roaches. They don’t have the long, skinny shape of the American cockroach , though they’re not quite as big as the giant Madagascar hissing roach . More than anything, they resemble dark brown, flattened eggs. Like all roaches, Florida woods cockroaches have two antennae and six legs . Their antennae are nearly the length of the body and extend out in front of the head, rather than curling back over the body. There are three legs on each side of the body; the pair closest to the head are the shortest, while those at the rear are the longest. Each leg comes equipped with fierce-looking spikes—but don’t worry, they’re for climbing, not attack. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Some species of roach have wings and can fly, but not the palmetto bug. Florida woods roaches are wingless. Instead of wings, they have hard, shield-like structures on their backs called ‘tegmina.’ The tegmina are located just behind the pronotum—the hard shield that protects the back of the roach’s head. Like other species of roach, the Florida woods cockroach has very simple mouthparts. In fact, these mouthparts have remained extremely simplified for hundreds of millions of years. In cockroaches, the mouthparts actually face backward due to the orientation of the head on the body. If human heads were attached the same way roach heads are attached, our faces would point up to the sky. All cockroaches share three life stages: egg , nymph , and adult. For the Florida woods roach, the egg phase takes about 48 days, depending on weather conditions. Female roaches produce eggs encased in an egg case that becomes hard soon after birth. Once she’s expelled the egg case, the female glues it in a safe place, like inside a dead log, or under thick substrate. Upon hatching , the nymphs are bright white and soft. Over time their exoskeletons thicken and darken; they shed them 6-8 times before reaching adulthood. After 100-120 days, the nymphs reach full maturity and no longer shed their exoskeletons—they’re done growing. As adults, palmetto bugs can reach 1.5 inches long and 1 inch wide, and live for up to two years. In that time, females can reproduce with or without males—though unfertilized eggs are unlikely to hatch, and nymphs born of the unfertilized eggs rarely reach adulthood. Florida woods roaches aren’t likely to invade your home. If you’re dealing with an infestation of indoor roaches, chances are very good that they’re not Florida woods roaches. It’s not impossible to find them inside, particularly if there are easy means of access, like open doors, but palmetto bugs much prefer the outside. Further, Florida woods cockroaches don’t live anywhere cold, and they’re largely confined to the temperate regions of the southeastern United States. So, if you’re living in Asia, South America, or anywhere else outside the southern United States, it’s unlikely that you’ll see a palmetto bug. Palmetto bugs are scavengers; they’re detritivorous omnivores . Their main source of food comes from rotting plant matter, like leaves, bark, fruit, and wood. This diet is part of the reason you won’t generally find Florida woods roaches indoors—human homes don’t tend to have large amounts of decaying plant matter. You’re much more likely to see a palmetto bug outside in a planter bed or potted plant than in a home or business. As a slow-moving, ground-dwelling insect, the Florida woods roach is vulnerable to attack from many creatures. These include small mammals like mice and rats , frogs , lizards, birds, and even small snakes. However, the palmetto bug has a unique defense capability; stinky chemical secretions. When in danger, the Florida woods roach sprays an oily, nasty-smelling liquid from its rear end. The liquid is harsh enough to irritate the eyes and skin of any creature it comes in contact with, including humans. So, if you see a palmetto bug and feel like you just have to pick it up—don’t, or risk getting sprayed with noxious chemicals. There is one type of problem roach that looks very similar to the Florida woods roach: the Oriental cockroach. Oriental cockroaches are so dark brown that they’re almost black. Like palmetto bugs, they have ovoid bodies and almost lack wings. But, they have much longer antennae than the Florida woods roach. Instead of fleshy pads where the wings should be (as in the Florida woods roach), the Oriental cockroach has tiny, vestigial wings. If you’re still not sure which type of cockroach you’re looking at, consider where you found it. If it was inside, then it’s probably an Oriental roach. Further, Florida woods roaches move much slower than Oriental roaches. If you fear you may have too many palmetto bugs hanging around your home, there are a few steps you can take. Your first step should be to clear away all leaf litter and green waste. Doing so will remove the roaches’ main food source, and they should quickly move on. If that doesn’t do the trick, you may want to consider using store-bought roach traps and pesticides, like borax. Remember, if your roach problem is indoors, you’re probably dealing with a different species. If the problem persists, consider calling in a professional pest exterminator.",
        "score": 0.76952505
    },
    {
        "Name": "Figeater Beetle",
        "Genus": "Cotinis",
        "Diet": "Herbivore that enjoys ripe soft-skinned fruits",
        "Behavior": "They can be characterized as solitary.Their aggression level is low.",
        "Features": "The larvae of figeater beetles move by crawling on their backs",
        "Fun_Fact": "Figeater beetles only open their wings partially when they fly.",
        "Text": "Figeater beetles only open their wings partially when they fly. The figeater beetle is a type of scarab beetle native to North America . The beetle is most common in the southwestern region of the United States and Mexico. These brightly colored beetles are diurnal, i.e., more active during the day than at night. They often fly into people as they make their way clumsily through the hair. Their clumsy flight is due to their inability to open their elytra fully when they fly. Figeater beetles are herbivorous. They feed on ripe fruits and may become a severe agricultural pest if they infest a field in large numbers. Figeater beetle is the common name of Cotinis mutabilis, a beetle in the family Scarabaeidae. Insects in this family are also called scarabs or scarab beetles. Scarabs are stout-bodied insects known for their bright metallic colors and clubbed antennae. The scarab beetle family is a large one, with at least 30,000 species of beetles found all over the world. Figeater beetles are also called fig beetles or green fruit beetles. Their common name and nicknames reference their tendency to feed on ripe soft-bodied fruits, including figs, tomatoes, berries, and grapes. The figeater beetle’s diet is consistent with the feeding habit of beetles in the subfamily Cetoniinae where it belongs. This group of beetles with at least 4000 members are also commonly called flower chafers. Insects in this group feed on pollen, nectar, flower petals, and fruits. People often compare the green fruit beetle to the green june beetle , which has a similar appearance. However, the june beetle is typically smaller, and its range is limited to the eastern parts of the United States. Some people also tend to mistake them for japanese beetles native to the eastern United States. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Figeater beetles have the classic scarab beetle appearance. They’re stout-bodied with hard elytra covering their thorax and abdomen. Adults can grow to lengths of up to 1.2 inches (3.2 cm) on average. Figeater beetles are pretty attractive. They are typically semi-glossy green on the top, while their undersides and legs are usually a brilliant iridescent green color. You’re more likely to find this beetle during the day when they’re more active. They’re often seen congregating in the shade of fruit trees . One prominent distinguishing feature of this group of beetles is the loud buzzing noise they make when they fly. This is due to the fact that their elytras are only partially opened when they’re in flight. The larvae of fig beetles are also called “crawly back .” This nickname is due to the unique way they crawl. Instead of moving with their legs, they tend to propel their body forward by crawling on their backs. They have bristles on their body, which they use for traction. The whitish beetles are C-shaped like the larvae of other scarab beetles. They can grow to lengths of up to 5.1 cm. The figeater beetle is native to the United States and Mexico. They’re most common in moist locations in the southwestern area of the United States. However, their range has been expanding over the past few years. They have become more common near human populations, making their homes in gardens, organic mulch, compost piles, and anywhere their larvae can easily access decomposing organic matter. Fig beetles and other members of the subfamily Cetoniinae are known as fruit chaffers. This is due to their tendency to feed on pollen, nectar, and petals of different plants . As their name suggests, figeater beetles eat figs and other ripe soft-skinned fruits. Their diet primarily consists of berries, grapes, peaches, and tomatoes. They prefer ripe and over-ripe fruits because fruits with tough skins are often too hard for them to bite into. In addition, the larvae of fig beetles feed on decaying organic matter, such as organic mulch, compost, and plant roots. Figeater beetles don’t have any defense mechanisms and are clumsy fliers. As a result, they’re easy prey for birds , toads, lizards , rodents , and even other insects that prey on beetles. Digger wasps and some types of nematodes may also feed on fig beetle grubs in check. Raccoons , possums, and other rodents may also dig up the large larvae for food. Although figeater beetles feed on garden fruits, they’re hardly problematic because they only do minor damage in most cases. However, in some cases, an infestation can go out of hand, with the beetles attacking plants in large numbers and causing severe damage. If fig beetles or their larvae are causing a problem in your garden, the best way to defend your plants against them is to maintain a healthy garden. Adequate care for your plants will help minimize damage to your plant. Good irrigation can also help keep the larvae population under control since the grubs cannot survive for long in wet soil. Tiling the ground before planting in fall or early spring also exposes the grubs to the surface, where they can quickly get eaten by predators or die due to exposure to sunlight. Overripe fruits are their favorite. To prevent adults from damaging your fruit, it’s best to pick fruits as soon as they ripen. Using pesticides and other chemical controls is not recommended for fig beetles. This can affect other beneficial insects in your garden.",
        "score": 0.76903236
    },
    {
        "Name": "Mealybug",
        "Diet": "Herbivore with no preference",
        "Behavior": "They usually live in colonies.",
        "Features": "Waxy, mealy appearance",
        "Fun_Fact": "They have a symbiotic relationship with ants.",
        "Text": "Mealybugs are a type of unarmored scale insect found in warm, moist habitats around the world. Many species are pests because they cause damage to many plants, both indoors and outdoors. They also transmit plant diseases, inject plant toxins, and cause deformity, leaf drop, and sooty mold as they feed off plant sap. Mealybugs feed on certain plants and the most common are citrus mealybugs. Other species feed on mango, papaya, grapes, pineapple, cassava, cacti, sugarcane, coffee trees, ferns, gardenias, mulberry, sunflower, and orchids. The geographic range of this mealybug pest was previously documented across southern Europe, the Middle East, and certain regions of northern Africa , while its presence in North America, specifically Pl. ficus, was initially observed in the early 1990s and subsequently in Mexico. Originally native to North America, Phenacoccus solenopsis, commonly known as the cotton mealybug or Solenopsis mealybug, is a species of mealybug belonging to the family Pseudococcidae . It has expanded its presence to various regions globally and emerged as a significant pest affecting cotton crops. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Further, female mealybugs in their early stages experience three instars or developmental stages and remain mobile throughout their lives, while immature males (nymphs) settle down and construct a white, waxy cocoon. There are 269 genera of mealybugs. All of them are in the suborder Sternorrhyncha and the superfamily Coccoidea. In the United States , there are approximately 275 species. The most common mealybug species fall into the genera Pseudococcus and Planococcu s. The citrus mealybug’s scientific name is Planococcus citri . Mealybugs are insects of the order Hemiptera, and all members are hemimetabolous or undergo incomplete metamorphosis. Both sexes go from the egg to the nymph phase. Mealybugs are tiny white bugs that look like fuzzy white stuff on plant stems and leaves. They look similar to other scale insects but do not have a hard shell to cover their soft bodies. They are also flat and waxy, with segmented bodies and an oval shape. Adult male mealybugs have wings and two long tail filaments, look like gnats or small flies, and are confused for fungus gnats. Mealybugs measure about 2mm long. In colonies, they look like white fuzzy clumps. When they first hatch from eggs, they are yellow in color and molt several times. Mealybugs can be found on a variety of host plants indoors, outdoors, and in greenhouses. They make their habitat in warm, moist climates around the world and are most active outdoors during warm, dry weather. Male mealybugs are rarely seen, while adult females look like cotton balls and are especially visible when laying waxy-covered eggs. Root mealybugs make their habitat in the soil, so these are not often visible at first. Mealybugs create colonies in somewhat sheltered areas such as the base of stems, between the stem and touching leaves, branch crotches, plant crowns, or between two touching fruits. Mealybug eggs attach to twigs, leaves, or bark. The best way to tell if your plants have an infestation of the scale insect is if there is a cottony, wax-like residue on the leaves of the plants or on the soil, or if there is a sooty black mold from the honeydew mealybugs excrete. Other ways to tell are if there are clumps of waxy-covered eggs, ants crawling up the plants, the plants have lost color, wilted, or have stunted growth, there is leaf drop or yellowing, or the soil has a bluish tint. Mealybugs eat all parts of the plant, including the roots. Root mealybugs, who live underground, are in the genus Rhizoecus . Rhizoecus includes the ground mealybug, hibiscus mealybug, and Pritchard’s mealybug. Depending on the species, mealybugs usually have a type of host plant they are common pests of, such as the citrus mealybug or mango mealybug, but actually, eat a range of plants. Pritchard’s mealybug eats the roots of African violets and other plants. Certain plants are toxic to mealybugs and other pests. However, they are also toxic to animals and children. They are: There are some different treatments for getting rid of mealybugs. The least invasive or risky treatment is to use a home remedy or biocontrol. But first, you must isolate the infected plants to prevent the spreading of the scale insect to other plants. You can then use a treatment listed below or in combination: To prevent mealybugs from returning, you’ll want to do a few things: If all else fails after repeated attempts, it’s time to resort to pesticides. Cyfluthrin, bifenthrin, permethrin, or diazinon are effective, as are systemic pesticides such as imidacloprid, and compounds such as Flagship (thiamethoxam) and Safari (dinotefuran). Your very last resort is to discard severely infected plants.",
        "score": 0.76901364
    },
    {
        "Name": "Mealworm Beetle",
        "Genus": "Tenebrio",
        "Diet": "Omnivore with no preference",
        "Origin": "Europe",
        "Behavior": "They usually live in infestations.",
        "Features": "Their forewings that meet in the center of their bodies creating a straight line.",
        "Fun_Fact": "In 1968, the mealworm beetle traveled to space and circled the moon on the Soviet mission Zond 5.",
        "Text": "Adult mealworm beetles lay their tiny eggs in grain and grain containers, making it difficult for most homeowners to spot them. However, once they develop into larvae, they are easily seen as they are around an inch long. They adapt well to various habitats and occur in decaying animals, grains, grain products, and various plant species. Mealworm larvae are readily accessible as they are sold at most pet stores for bait and to feed to lizards , turtles , and reptiles . Two species of darkling beetle produce mealworm larvae: the yellow mealworm beetle ( Tenebrio molitor Linnaeus ) and the mini or dark mealworm beetle ( Tenebrio obscurus Fabricius ), which is less common. The mealworm beetle is native to Europe but occurs all over the world now, except in Antarctica. Mealworm beetles belong to the order Coleoptera , derived from the Greek words “koleos,” meaning sheath, and “ptera,” meaning wings. This refers to their forewings that act like a shield for their membranous hind wings. This order, which consists of beetles and weevils, is the largest in the Insecta class. Most adult species in this order have tough, dense exoskeletons that protect the majority of their body’s surface. Their forewings are called elytra and are just as strong as the beetle’s exoskeleton. They fold over the entire abdomen and act as protective shields for their big, membranous hind wings. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . Their most distinctive characteristic is the appearance of their elytra which meet along the center of their backs, forming a straight line. Mealworm beetles belong to the family Tenebrionidae, the 5 th largest family of the order Coleoptera. There are over 14,000 species in this family, with 1,345 species occurring in the United States alone. However, these figures are relatively low since, in the past 3 decades, the classification of the family has changed, with many new taxa discovered each year. The mealworm beetle is generally dark brown or black in color and is often misidentified as the predaceous ground beetle, but mealworm beetles typically have clubbed antennae. However, both beetles are nocturnal and generally flightless. Due to the sheer number of species in this family, there are considerable variations in size and appearance. However, most of them have elongated oval shapes and flattened bodies. Mealworm beetles can measure up to 1.5 inches long in North America. These beetles are divided into 3 segments: head, thorax, and abdomen. They have abdominal defensive glandular reservoirs that secrete an extremely foul-smelling fluid, which is their chemical defense against predators. Adult mealworm beetles and their larvae are often found near the soil’s surface. However, they prefer living in weed-filled habitats, under stones or rocks, in leaf litter, or on decomposing logs. In addition, several species can adapt to living in arid dunes or caves. Some species even take over other animals’ homes, like birds , rodents , and termites . Mealworms are often found in grains and are a common pest in chicken coops and grain storage containers. In addition, they occur in peoples’ homes where there is grain with high moisture content. However, they are not common pests in homes, and many people start small businesses by raising them in their homes and selling the larvae as pet food or bait. Mealworm beetles are natural decomposers who eat feces, dead insects , and stored grains. They live in habitats where they are surrounded by their primary food source, typically under rocks, animal burrows, logs, or stored grains. These beetles go through four stages of development: The total duration of their life cycle depends on factors like temperature and food availability. However, the mealworm beetle’s average life cycle ranges from 4 to 12 months. The females start seeking dark, secluded areas to lay their eggs in the late spring or early summer. If they are in buildings during this time, they will lay their eggs in meal, flour containers, or grain. Females can lay up to 300 white, bean-shaped eggs at a time. When the larvae hatch, they are referred to as mealworms and are milky white with slim, segmented bodies. As they grow, they start to turn yellowish-brown within a few days. They feed on whatever surrounds them and grow to about an inch long while shedding several times in the process, which contaminates food supplies. They remain in their larvae stage until Fall and then morph into pupae to hibernate. The pupae are C-shaped, stout, and light yellow in color, but as they enter adulthood, they become darker. Once winter is over and the temperature rises, adult mealworm beetles will start to emerge. At first, they are white and orange but eventually turn dark yellow or black within a few days. These beetles are relatively slow but can fly, making it easier to travel and infest new territory. The adults can live up to 3 to 12 months. Mealworm beetles don’t cause much damage but carry various diseases that may negatively impact their host plant. They are also major pests when raising poultry because they are carriers of avian diseases and Salmonella. Seedlings are the most susceptible plants in gardens, so be sure to inspect the younger plants often. Look for any damage and check the soil for the source if you do find anything. Damage is generally caused by darkling beetles and other insects like cutworms. As a preventative measure, you can install a floating row cover overtop, which should keep them out. If an infestation occurs, you must remove the source by locating the infested material and placing it in an airtight container before disposing of it. In addition, you can freeze this container for five days, killing the adults and eggs. To prevent further infestation, store pantry items like cereal, grain, pet food, bird seed, and flour in tight containers. They are also attracted to animal feces, so if you have dogs and cats, remove any excrement from the property so as not to create a breeding ground for them.",
        "score": 0.76751316
    },
    {
        "Name": "Least Flycatcher",
        "Genus": "Empidonax",
        "Diet": "Insectivore that eats insects",
        "Behavior": "They can be characterized as colonial nesting territorial.Their aggression level is low.",
        "Features": "Bold eyering",
        "Fun_Fact": "They can travel up to 72 miles in a single day.",
        "Text": "The least flycatcher is a small species of bird that mainly eats insects. Despite their size, they are territorial . This means that they are prone to aggression toward other birds, including those much larger than themselves. Least flycatchers, like many other passerines, are a migratory species. These species are common in the western hemisphere. They can be found in several different countries, from Canada to those in Central America . This includes Mexico and the United States as well. Least flycatchers spend the majority of their time in different types of forests and in shrubby fields. The two main forest types where they are found are semi-open deciduous and mixed forests. Least flycatchers of all ages are common here. These habitats are most frequently used during the breeding season. In the winter months, least flycatchers don’t typically stray far from the forests. However, they can be found at the edge of wooded areas, in forested ravines, and in pastures as well. Regardless of the season, least flycatchers tend to avoid higher elevations. Populations settling in Mexico may use tropical forests as their habitat. The breeding pair will work together to choose the right nesting location. Least flycatchers will make their nests in large deciduous trees. They will choose trees with an upright fork anywhere from 2 to 50 feet off the ground. This acts as a means of natural protection and structure for the nest. Female least flycatchers will build the nest. Nests can be made of plant materials such as bark, grasses, and fibers, and they can also feature animal components like spiderwebs, dragonfly wings, and animal fur. The final nest is small, averaging around 2.5 inches wide and 2 inches tall. It takes five to seven days for the female to finish building the nest. During this time frame, you may be able to see her flying to and from the nest in pursuit of materials. The scientific name of the least flycatcher is Empidonax minimus . It is in the Class Aves . This is the scientific class that includes all species of bird. It is in the Order Passeriformes and the Family Tyrannidae . This family, along with Muscicapidae , contains all species of flycatchers. Its genus is Empidonax , of which the least flycatcher is one of the smallest. The least flycatcher is the smallest species of Empidonax in the eastern region of North America. Adults grow to be between 4.7 and 5.5 inches and weigh between 0.3 and 0.8 ounces. Their wingspan measures an average of 7.9 inches. Overall, lest flycatchers have a greyish olive coloration. They have a faint yellow coloring on their chest and belly. Their most notable figures are the bold white eyerings and wing bars they sport. Least flycatchers tend to gather in large flocks within the forest. They tend to be rather vocal, spending the summer months singing as fly from perch to perch. There are little to no significant year-round populations of the least flycatcher in the western hemisphere. During their nonbreeding season, they are found in the southernmost areas of their range. This includes southern Florida , coastal and southern Mexico , and Central America . They are long-distance migrants. During their migratory period between breeding seasons, they can be spotted through central Mexico and the central and eastern United States. Much of their breeding range lies in the northernmost United States and Canada. Insects make up the largest portion of the least flycatcher’s diet. They are known to catch their prey either midair or by plucking them off vegetation. While insects are the main component of their diet, least flycatchers may occasionally eat plant materials as well. Least flycatchers eat a wide variety of insects that are common to their native areas. This includes ants , beetles, butterflies , flies, and leaf hoppers. Nesting material has shown that they may also hunt dragonflies. For the vegetative part of their diets, least flycatchers will eat blackberries, elderberries, and the seeds of different grasses. One of the largest threats to the least flycatcher population is disturbances in the forests they inhabit. This can be both human-influenced, such as logging, or natural, such as excessive grazing from animals like deer. The main characteristic of these disturbances is that they either change the forest canopy or result in large clearings. There are many animals that prey on the least flycatcher. This includes adults, juveniles, and their nests. Some of the many predators of least flycatchers include: Least flycatchers nest in clusters once they reach their breeding grounds. They are not monogamous species. Instead, they participate in a mating style known as extra-pair matings. This means that males and females will find other mates outside of their initial pairing. Cluster nesting is thought to aid in the search for mates and in adding protection for nests inside the cluster. The female will lay three to five eggs. Four eggs are the most common number per brood. The female incubates the eggs for 13 to 16 days while the male defends the territory and brings food to the nest. Once the young hatch, they are completely helpless. It takes 12 to 17 days for them to fledge and fly for the first time. In the meanwhile, both parents will take turns bringing food to the young least flycatchers. This will also continue for up to three weeks after the young fledge. The oldest least flycatcher known in the wild was at least 8 years old. The least flycatcher is a species of least concern . They have a relatively healthy population throughout their range, although it has declined nearly by half in the past half-century. There are an estimated 27 million adult individuals.",
        "score": 0.7663686
    },
    {
        "Name": "Water Bug",
        "Genus": "Nepomorpha",
        "Diet": "Omnivore that eats insects, tadpoles, small fishes, insects, and other arthropods",
        "Behavior": "They can be characterized as solitary.Their aggression level is medium.",
        "Features": "Their first pair of legs is modified for catching prey",
        "Fun_Fact": "Some species of water bugs can deliver a painful bite when handled.",
        "Text": "Some species of water bugs can deliver a painful bite when handled. The name “water bug” refers to members of an infraorder of insects known as Nepomorpha. This group of insects consists of more than 2000 species of true bugs found worldwide except in the polar regions. Most species live in freshwater habitats. They are prolific predators that feed on other insects. Larger species may also prey on fishes and amphibians in the water. Insects in the infraorder Nepomorpha are commonly referred to as water bugs. There are more than 2,000 species of insects in this group. They’re commonly called “true water bugs,” distinguishing them from other insects with the same nickname, such as the oriental cockroach . This group sometimes goes by the name Cryptocerata which means “the hidden-horned ones.” This refers to their antennae which are reduced and weak. Another common nickname for this group of insects is “toe biter.” This refers to their tendency to deliver a painful (but nontoxic) bite on the toes of unsuspecting human feet. Toe biters belong to the order Hemiptera. This is an order of insects commonly called true bugs. There are more than 80,000 species of trug bugs. Some of the most popular members of this group include aphids, leafhoppers, bed bugs, assassin bugs, and shield bugs . Most true bugs have sucking and piercing mouthparts. True water bugs are found in aquatic habitats worldwide except in the polar regions. They are grouped into seven superfamilies as highlighted below: Waterbugs have flattened, elongated bodies, and they have flattened legs. They typically have two large compound eyes. However, they do not have ocelli (a type of simple eye), which is a common feature of many other insects in the suborder Heteroptera where they belong. Water bugs have short antennae that they can tuck into grooves behind their eyes. Although they’re aquatic, most adults cannot breathe underwater. Instead, they possess a retractable breathing tube that can extend to the water surface for air. Except for a few species, most water bugs’ first pair of legs are modified for grabbing onto prey. Like other true bugs, all insects in this group have sucking and piercing mouthparts. They catch prey in their forelimbs and inject them with powerful saliva that immobilizes them. Given the variety of species, insects in this family vary in size considerably. The giant water bug, the biggest species in the group, measures up to 2–4 inches in length. Water scorpion , another large-sized species in the group, may measure between 0.6 and 1.8 inches in length. Members of the family Naucoridae are significantly smaller, usually about 0.2–0.8 inches long. They are typically tan to dark brown. In most species, a wing pad is visible from their dorsal view. However, most species are flightless. Toe biters occur worldwide except in the polar regions, where they cannot thrive due to extremely cold temperatures. Most species in this infraorder are aquatic. They typically live in freshwater habitats. However, a few members, such as species in the superfamily Ochteroidea, only live along the water’s edge and not in the water itself. Despite being aquatic, most adults in this group cannot breathe underwater. They tend to use breathing tubes that can extend to the surface of the water and retract when not in use. Many of the insects in the Nepomorpha group are predators of other invertebrates . They mostly prey on other insects. However, larger ones, such as the giant water bug and water scorpion, can prey on small fish and amphibians. Many species are omnivorous, while a few of them feed on plants . As with all the true bugs, their mouthpart forms a rostrum which they use to pierce their food source and suck fluids from it. Some groups, like the Corixidae, can chew on their food before sucking the pulp. In some species, the rostrum is a stinging mouthpart that they can use to deliver a painful sting. Water bugs have several predators. This includes birds, fish, and frogs (especially bullfrogs and wasps. Some species, especially toe biters, are a delicacy in south and southeast Asia . Water bugs have various defensive mechanisms against predators. For example, some species have stinging mouthparts and can deliver a painful bite when disturbed. Some species also emit a bad odor to repel predators. The flat, leaf-like appearance also serves as excellent camouflage.",
        "score": 0.7663059
    },
    {
        "Name": "Blue Gray Gnatcatcher",
        "Genus": "Polioptila",
        "Diet": "Insectivore that eats insects",
        "Features": "Bluish cap of feathers",
        "Fun_Fact": "Joy and happiness are the spiritual meaning of this bird.",
        "Text": "“A Blue-gray gnatcatcher can snatch insects out of mid-air” One of the Blue-gray gnatcatcher’s most notable features is the cap of deep blue feathers on its head. Another notable feature is a call that sounds like spee, spee! Blue-gray gnatcatchers live in open woods, scrubs, and thickets. Flies, small wasps, beetles , and spiders are all in its diet. The Blue-gray gnatcatcher is native to North America and lives in a temperate climate. These birds are year-round residents in many states along the southern coast of the United States . This range includes the southern part of California traveling east to Florida and up into southern parts of Georgia and South Carolina . Some are permanent residents of Mexico and Cuba as well. There are some Blue-gray gnatcatchers that make their home in northern parts of the United States. But birds living in northern states such as Michigan and Wisconsin migrate south for the winter. Sometimes they travel as far as Mexico. These birds start migrating south in September. The breeding season for this bird runs from March or April into late July. This is a great time to see these birds at work building nests and feeding their chicks. So, if you see a couple of Blue-gray gnatcatchers building a nest remember that joy and happiness are two words in the spiritual meaning of this feathered creature. In the springtime, the male Blue-gray gnatcatcher sings its song to attract females to the area. Once he finds a mate, nest construction begins. See all of our entertaining and insightful animal articles . See all of our entertaining and insightful animal articles . The nest design is a cup shape made with mud , grass, and twigs. Animal hair and grass are put on the inside of the nest to serve as a soft layer for the eggs. Both male and female Blue-gray gnatcatchers work together to apply a layer of spider webs and lichen to the exterior of the nest. This helps hide it from predators. These birds usually build their nest at a height of 20 to 40 feet in a tree. Polioptila caerulea is the scientific name of the Blue-gray gnatcatcher. The Greek word Polioptila means gray plumage and the word caerulea means blue. It’s in the Aves class and the Polioptilidae family. Well, the name of the Blue-gray gnatcatcher says a lot about the appearance and behavior of this bird. Yes, this bird has bluish-gray feathers on its back and wings along with a cap of deeper blue feathers on its head. Its breast is white. Blue-gray gnatcatchers have a long, thin, pointed beak. Its beak design allows it to pluck an insect out of the air. Capturing insects in mid-air is called hawking. Its long tail feathers contain both black and white feathers. This bird flicks its tail feathers side to side to frighten insects out of bushes. Male Blue-gray gnatcatchers are larger than females. Plus, a male has a black stripe extending from the base of its beak, over each eye, and across each side of its head. The length of a Blue-gray gnatcatcher is four to five inches, and its height is three to four inches. It’s very light, weighing just .21 ounces. The wingspan of this bird is 6.3 inches. The dark color of the Blue-gray gnatcatcher gives it an advantage when it’s trying to blend into its wooded habitat. The thin, pointed beak of this bird helps it to get a firm hold on its prey. The Blue-gray gnatcatcher covers the outside of its nest with spider webs and lichen. Once again, this is an attempt to hide the nest from snakes, hawks, and other predators able to get into the treetops to kill an adult bird or steal an egg. This bird uses its call to warn other Blue-gray gnatcatchers of predators. Blue-gray gnatcatchers living in the northern parts of the United States migrate south to warmer weather for the winter season. In late September, birds living in Michigan, Wisconsin, southern Montana, and other northern states start on a southward path. Some of these birds stay in southern states such as Florida, Georgia, or Texas for the winter. Other Blue-gray gnatcatchers travel further south into Mexico. In the spring, these migratory birds fly north again for the breeding season starting in March or April. Does a Blue-gray gnatcatcher look like a carnivore to you? It is! In fact, some biologists call this bird an insectivore because of its diet of insects. This bird eats flies , leafhoppers, small wasps , spiders, and caterpillars . Along with capturing insects in mid-air, they also hop along the branches of a tree looking for bugs on leaves. One interesting behavior of this bird is it will pick up a leaf-covered twig and shake it. This is an effort to scare the insects out from beneath the leaves. This tiny bird has lots of predators including snakes , hawks , kestrels , and cats . All of these animals are able to chase after Blue-gray gnatcatchers even if they try to escape into the trees. Loss of habitat is an issue for Blue-gray gnatcatchers, but it’s not considered of major concern. The IUCN Red List of Threatened Species reports this bird as Least Concern with a population that is rising. Male Blue-gray gnatcatchers attract females with their song. A male and female Blue-gray gnatcatcher pair up during the breeding season. However, biologists aren’t sure whether they stay together for life. These birds begin breeding in March or April. A female has four or five eggs that hatch in just 13 days. Both the male and the female take turns going out to find food for their babies, or chicks. The chicks grow quickly and are able to leave the nest at about 14 or 15 days old. Typically, these birds live up to four years of age. But there is one Blue-gray gnatcatcher on record as having lived four years, two months! Despite not having a specific population listed on their IUCN Red List of Threatened Species page, this bird is thought to be of Least Concern. Furthermore, its numbers are estimated to be on the rise.",
        "score": 0.7655108
    }
]